package com.ej.rovadiahyosefcalendar.classes;

import static com.ej.rovadiahyosefcalendar.activities.OmerActivity.getSefirahAttribute;
import static com.ej.rovadiahyosefcalendar.activities.OmerActivity.omerList;

import com.kosherjava.zmanim.hebrewcalendar.JewishCalendar;
import com.kosherjava.zmanim.hebrewcalendar.JewishDate;

import java.util.ArrayList;
import java.util.Calendar;

public class SiddurMaker {

	private ArrayList<HighlightString> siddur = new ArrayList<>();
	private final JewishDateInfo jewishDateInfo;
	private final boolean isTachanunSaidInTheMorning;
	private final boolean isTachanunSaidByMincha;
	private final String lineBreak = "[break here]";
	private final String menorah = "לַמְנַצֵּ֥חַ בִּנְגִינֹ֗ת מִזְמ֥וֹר שִֽׁיר׃ אֱֽלֹהִ֗ים יְחׇנֵּ֥נוּ וִיבָרְכֵ֑נוּ יָ֤אֵֽר פָּנָ֖יו אִתָּ֣נוּ סֶֽלָה׃ לָדַ֣עַת בָּאָ֣רֶץ דַּרְכֶּ֑ךָ בְּכׇל־גּ֝וֹיִ֗ם יְשׁוּעָתֶֽךָ׃ יוֹד֖וּךָ עַמִּ֥ים ׀ אֱלֹהִ֑ים י֝וֹד֗וּךָ עַמִּ֥ים כֻּלָּֽם׃ יִ֥שְׂמְח֥וּ וִירַנְּנ֗וּ לְאֻ֫מִּ֥ים כִּֽי־תִשְׁפֹּ֣ט עַמִּ֣ים מִישֹׁ֑ר וּלְאֻמִּ֓ים ׀ בָּאָ֖רֶץ תַּנְחֵ֣ם סֶֽלָה׃ יוֹד֖וּךָ עַמִּ֥ים ׀ אֱלֹהִ֑ים י֝וֹד֗וּךָ עַמִּ֥ים כֻּלָּֽם׃ אֶ֭רֶץ נָתְנָ֣ה יְבוּלָ֑הּ יְ֝בָרְכֵ֗נוּ אֱלֹהִ֥ים אֱלֹהֵֽינוּ׃ יְבָרְכֵ֥נוּ אֱלֹהִ֑ים וְיִֽירְא֥וּ א֝וֹת֗וֹ כׇּל־אַפְסֵי־אָֽרֶץ׃";
	private final String vayavor = "וַיַּעֲבֹ֨ר יְהֹוָ֥ה ׀ עַל־פָּנָיו֮ וַיִּקְרָא֒ יְהֹוָ֣ה ׀ יְהֹוָ֔ה אֵ֥ל רַח֖וּם וְחַנּ֑וּן אֶ֥רֶךְ אַפַּ֖יִם וְרַב־חֶ֥סֶד וֶאֱמֶֽת׃ נֹצֵ֥ר‏ חֶ֙סֶד֙ לָאֲלָפִ֔ים נֹשֵׂ֥א עָוֺ֛ן וָפֶ֖שַׁע וְחַטָּאָ֑ה וְנַקֵּה֙:";
	private final String shema = "וְאָ֣הַבְתָּ֔ אֵ֖ת יְהֹוָ֣ה אֱלֹהֶ֑יךָ בְּכׇל־לְבָבְךָ֥ וּבְכׇל־נַפְשְׁךָ֖ וּבְכׇל־מְאֹדֶֽךָ׃ וְהָי֞וּ הַדְּבָרִ֣ים הָאֵ֗לֶּה אֲשֶׁ֨ר אָנֹכִ֧י מְצַוְּךָ֛ הַיּ֖וֹם עַל־לְבָבֶֽךָ׃ וְשִׁנַּנְתָּ֣ם לְבָנֶ֔יךָ וְדִבַּרְתָּ֖ בָּ֑ם בְּשִׁבְתְּךָ֤ בְּבֵיתֶ֙ךָ֙ וּבְלֶכְתְּךָ֣ בַדֶּ֔רֶךְ וּֽבְשׇׁכְבְּךָ֖ וּבְקוּמֶֽךָ׃ וּקְשַׁרְתָּ֥ם לְא֖וֹת עַל־יָדֶ֑ךָ וְהָי֥וּ לְטֹטָפֹ֖ת בֵּ֥ין עֵינֶֽיךָ׃ וּכְתַבְתָּ֛ם עַל־מְזֻז֥וֹת בֵּיתֶ֖ךָ וּבִשְׁעָרֶֽיךָ׃ \n\n" +
		"וְהָיָ֗ה אִם־שָׁמֹ֤עַ תִּשְׁמְעוּ֙ אֶל־מִצְוֺתַ֔י אֲשֶׁ֧ר אָנֹכִ֛י מְצַוֶּ֥ה אֶתְכֶ֖ם הַיּ֑וֹם לְאַהֲבָ֞ה אֶת־יְהֹוָ֤ה אֱלֹֽהֵיכֶם֙ וּלְעׇבְד֔וֹ בְּכׇל־לְבַבְכֶ֖ם וּבְכׇל־נַפְשְׁכֶֽם׃ וְנָתַתִּ֧י מְטַֽר־אַרְצְכֶ֛ם בְּעִתּ֖וֹ יוֹרֶ֣ה וּמַלְק֑וֹשׁ וְאָסַפְתָּ֣ דְגָנֶ֔ךָ וְתִֽירֹשְׁךָ֖ וְיִצְהָרֶֽךָ׃ וְנָתַתִּ֛י עֵ֥שֶׂב בְּשָׂדְךָ֖ לִבְהֶמְתֶּ֑ךָ וְאָכַלְתָּ֖ וְשָׂבָֽעְתָּ׃ הִשָּֽׁמְר֣וּ לָכֶ֔ם פֶּ֥ן יִפְתֶּ֖ה לְבַבְכֶ֑ם וְסַרְתֶּ֗ם וַעֲבַדְתֶּם֙ אֱלֹהִ֣ים אֲחֵרִ֔ים וְהִשְׁתַּחֲוִיתֶ֖ם לָהֶֽם׃ וְחָרָ֨ה אַף־יְהֹוָ֜ה בָּכֶ֗ם וְעָצַ֤ר אֶת־הַשָּׁמַ֙יִם֙ וְלֹֽא־יִהְיֶ֣ה מָטָ֔ר וְהָ֣אֲדָמָ֔ה לֹ֥א תִתֵּ֖ן אֶת־יְבוּלָ֑הּ וַאֲבַדְתֶּ֣ם מְהֵרָ֗ה מֵעַל֙ הָאָ֣רֶץ הַטֹּבָ֔ה אֲשֶׁ֥ר יְהֹוָ֖ה נֹתֵ֥ן לָכֶֽם׃ וְשַׂמְתֶּם֙ אֶת־דְּבָרַ֣י אֵ֔לֶּה עַל־לְבַבְכֶ֖ם וְעַֽל־נַפְשְׁכֶ֑ם וּקְשַׁרְתֶּ֨ם אֹתָ֤ם לְאוֹת֙ עַל־יֶדְכֶ֔ם וְהָי֥וּ לְטוֹטָפֹ֖ת בֵּ֥ין עֵינֵיכֶֽם׃ וְלִמַּדְתֶּ֥ם אֹתָ֛ם אֶת־בְּנֵיכֶ֖ם לְדַבֵּ֣ר בָּ֑ם בְּשִׁבְתְּךָ֤ בְּבֵיתֶ֙ךָ֙ וּבְלֶכְתְּךָ֣ בַדֶּ֔רֶךְ וּֽבְשׇׁכְבְּךָ֖ וּבְקוּמֶֽךָ׃ וּכְתַבְתָּ֛ם עַל־מְזוּז֥וֹת בֵּיתֶ֖ךָ וּבִשְׁעָרֶֽיךָ׃ לְמַ֨עַן יִרְבּ֤וּ יְמֵיכֶם֙ וִימֵ֣י בְנֵיכֶ֔ם עַ֚ל הָֽאֲדָמָ֔ה אֲשֶׁ֨ר נִשְׁבַּ֧ע יְהֹוָ֛ה לַאֲבֹתֵיכֶ֖ם לָתֵ֣ת לָהֶ֑ם כִּימֵ֥י הַשָּׁמַ֖יִם עַל־הָאָֽרֶץ׃ \n\n" +
		"וַיֹּ֥אמֶר יְהֹוָ֖ה אֶל־מֹשֶׁ֥ה לֵּאמֹֽר׃ דַּבֵּ֞ר אֶל־בְּנֵ֤י יִשְׂרָאֵל֙ וְאָמַרְתָּ֣ אֲלֵהֶ֔ם וְעָשׂ֨וּ לָהֶ֥ם צִיצִ֛ת עַל־כַּנְפֵ֥י בִגְדֵיהֶ֖ם לְדֹרֹתָ֑ם וְנָ֥תְנ֛וּ עַל־צִיצִ֥ת הַכָּנָ֖ף פְּתִ֥יל תְּכֵֽלֶת׃ וְהָיָ֣ה לָכֶם֮ לְצִיצִת֒ וּרְאִיתֶ֣ם אֹת֗וֹ וּזְכַרְתֶּם֙ אֶת־כׇּל־מִצְוֺ֣ת יְהֹוָ֔ה וַעֲשִׂיתֶ֖ם אֹתָ֑ם וְלֹֽא־תָת֜וּרוּ אַחֲרֵ֤י לְבַבְכֶם֙ וְאַחֲרֵ֣י עֵֽינֵיכֶ֔ם אֲשֶׁר־אַתֶּ֥ם זֹנִ֖ים אַחֲרֵיהֶֽם׃ לְמַ֣עַן תִּזְכְּר֔וּ וַעֲשִׂיתֶ֖ם אֶת־כׇּל־מִצְוֺתָ֑י וִהְיִיתֶ֥ם קְדֹשִׁ֖ים לֵאלֹֽהֵיכֶֽם׃ אֲנִ֞י יְהֹוָ֣ה אֱלֹֽהֵיכֶ֗ם אֲשֶׁ֨ר הוֹצֵ֤אתִי אֶתְכֶם֙ מֵאֶ֣רֶץ מִצְרַ֔יִם לִהְי֥וֹת לָכֶ֖ם לֵאלֹהִ֑ים אֲנִ֖י יְהֹוָ֥ה אֱלֹהֵיכֶֽם׃ אֱמֶת. \n\n";

	private final String[] anaBekoach = {
		"אָֽנָּֽא בְּכֹֽחַ. גְּדוּלַת יְמִינֶֽךָ. תַּתִּיר צְרוּרָה: (אב\"ג ית\"ץ)",
		"קַבֵּל רִנַּת עַמֶּֽךָ. שַׂגְּבֵֽנוּ. טַהֲרֵֽנוּ נוֹרָא: (קר\"ע שט\"ן)",
		"נָא גִבּוֹר. דּֽוֹרְשֵֽׁי יִחוּדֶֽךָ. כְּבָבַת שָׁמְרֵם: (נג\"ד יכ\"ש)",
		"בָּֽרְכֵֽם טַהֲרֵם. רַחֲמֵי צִדְקָתֶֽךָ. תָּמִיד גָּמְלֵם: (בט\"ר צת\"ג)",
		"חֲסִין קָדוֹשׁ. בְּרֹב טֽוּבְךָֽ. נַהֵל עֲדָתֶֽךָ: (חק\"ב טנ\"ע)",
		"יָחִיד גֵּאֶה. לְעַמְּךָ פְנֵה. זֽוֹכְרֵֽי קְדֻשָּׁתֶֽךָ: (יג\"ל פז\"ק)",
		"שַׁוְעָתֵֽנוּ קַבֵּל. וּשְׁמַע צַעֲקָתֵֽנוּ. יוֹדֵֽעַ תַּעֲלוּמוֹת: (שק\"ו צי\"ת)"
	};

	/**
	 * This goal of this class is to create the proper tefilot/prayers for the day
	 * with the date set in the
	 * JewishDateInfo object passed into the constructor. This class uses multiple
	 * {@link HighlightString} objects to define which texts are regular strings and
	 * which texts
	 * should be highlighted in the UI using the
	 * {@link HighlightString#shouldBeHighlighted()} method.
	 * The text is pulled from multiple sources (mainly sefaria.org).
	 * These tefilot/prayers are based on Edut Mizrach (Sephardic Rite), and follow
	 * the rulings of
	 * Rabbi Ovadiah Yosef ZT"L and his sons.
	 * <p>
	 * See the introduction to the "Chazon Ovadia Siddur" for a majority of the text
	 * changes.
	 * <p>
	 * NOTE: All methods that return prayers for the night time should have the
	 * jewish date be set to the NEXT DATE.
	 *
	 * @param jewishDateInfo the information for the current jewish date
	 * @see JewishDateInfo
	 * @see HighlightString
	 */
	public SiddurMaker(JewishDateInfo jewishDateInfo) {
		this.jewishDateInfo = jewishDateInfo;
		this.isTachanunSaidInTheMorning = jewishDateInfo.getIsTachanunSaid().equals("Tachanun only in the morning")
				|| jewishDateInfo.getIsTachanunSaid().equals("אומרים תחנון רק בבוקר")
				|| jewishDateInfo.getIsTachanunSaid().equals("Some say Tachanun today")
				|| jewishDateInfo.getIsTachanunSaid().equals("יש אומרים תחנון")
				|| jewishDateInfo.getIsTachanunSaid().equals("There is Tachanun today")
				|| jewishDateInfo.getIsTachanunSaid().equals("אומרים תחנון")
				|| jewishDateInfo.getIsTachanunSaid().equals("יש מדלגים תחנון במנחה")
				|| jewishDateInfo.getIsTachanunSaid().equals("Some skip Tachanun by mincha")
				|| jewishDateInfo.isPurimMeshulash() && (jewishDateInfo.getJewishCalendar().getIsSafekMukafChoma()
						|| jewishDateInfo.getJewishCalendar().getIsMukafChoma());

		this.isTachanunSaidByMincha = jewishDateInfo.getIsTachanunSaid().equals("There is Tachanun today")
				|| jewishDateInfo.getIsTachanunSaid().equals("אומרים תחנון")
				|| jewishDateInfo.getIsTachanunSaid().equals("Some say Tachanun today")
				|| jewishDateInfo.getIsTachanunSaid().equals("יש אומרים תחנון")
				|| jewishDateInfo.getIsTachanunSaid().equals("יש מדלגים תחנון במנחה")
				|| jewishDateInfo.getIsTachanunSaid().equals("Some skip Tachanun by mincha")
				|| jewishDateInfo.isPurimMeshulash() && (jewishDateInfo.getJewishCalendar().getIsSafekMukafChoma()
						|| jewishDateInfo.getJewishCalendar().getIsMukafChoma());
	}

	public ArrayList<HighlightString> getSelichotPrayers(boolean isInAMinyan, boolean isAfterChatzot) {
		siddur = new ArrayList<>();// reset

		if (jewishDateInfo.getJewishCalendar().isAssurBemelacha()) {
			addToSiddur("Shabbat and Yom Tov are currently not supported/שבת ויום טוב כרגע אינם נתמכים");
			addToSiddurHighlighted("Open Sefaria Siddur/פתח את סידור ספריה");
			return siddur;
		}

		// All of the Te'amim are sung in the Tehilim tune

		addToSiddur(
			"(אם קודם עלות השחר/If before alot hashachar) קַמְתִּי בְּאַשְׁמוֹרֶת, לְבַקֵּשׁ עַל עֲוֹנִי. וְנַפְשִׁי שְׁחַרְחוֹרֶת מִפְּנֵי רוֹב זְדוֹנִי. רַחֵם עַל עֲדָתֶךָ. צֹאן מַרְעִיתֶךָ. אַשְׁרֵי יוֹשְׁבֵי בֵיתֶךָ. עוֹד יְהַלְלוּךָ סֶּלָה: \n\n" +
			"אַ֭שְׁרֵי יוֹשְׁבֵ֣י בֵיתֶ֑ךָ ע֝֗וֹד יְֽהַלְל֥וּךָ סֶּֽלָה: אַשְׁרֵ֣י הָ֭עָם שֶׁכָּ֣כָה לּ֑וֹ אַֽשְׁרֵ֥י הָ֝עָ֗ם שֱׁיְהֹוָ֥ה אֱלֹהָֽיו: " +
			"תְּהִלָּ֗ה לְדָ֫וִ֥ד אֲרוֹמִמְךָ֣ אֱלוֹהַ֣י הַמֶּ֑לֶךְ וַאֲבָרְכָ֥ה שִׁ֝מְךָ֗ לְעוֹלָ֥ם וָעֶֽד׃ בְּכָל־י֥וֹם אֲבָֽרְכֶ֑ךָּ וַאֲהַֽלְלָ֥ה שִׁ֝מְךָ֗ לְעוֹלָ֥ם וָעֶֽד׃ גָּ֘ד֤וֹל יְהֹוָ֣ה וּמְהֻלָּ֣ל מְאֹ֑ד וְ֝לִגְדֻלָּת֗וֹ אֵ֣ין חֵֽקֶר׃ דּ֣וֹר לְ֭דוֹר יְשַׁבַּ֣ח מַעֲשֶׂ֑יךָ וּגְב֖וּרֹתֶ֣יךָ יַגִּֽידוּ׃ הֲ֭דַר כְּב֣וֹד הוֹדֶ֑ךָ וְדִבְרֵ֖י נִפְלְאֹתֶ֣יךָ אָשִֽׂיחָה׃ וֶעֱז֣וּז נֽוֹרְאֹתֶ֣יךָ יֹאמֵ֑רוּ וּגְדֻלָּתְךָ֥ אֲסַפְּרֶֽנָּה׃ זֵ֣כֶר רַב־טוּבְךָ֣ יַבִּ֑יעוּ וְצִדְקָתְךָ֥ יְרַנֵּֽנוּ׃ חַנּ֣וּן וְרַח֣וּם יְהֹוָ֑ה אֶ֥רֶךְ אַ֝פַּ֗יִם וּגְדׇל־חָֽסֶד׃ טוֹב־יְהֹוָ֥ה לַכֹּ֑ל וְ֝רַחֲמָ֗יו עַל־כׇּל־מַעֲשָֽׂיו׃ יוֹד֣וּךָ יְ֭הֹוָה כׇּל־מַעֲשֶׂ֑יךָ וַ֝חֲסִידֶ֗יךָ יְבָרְכֽוּכָה׃ כְּב֣וֹד מַלְכוּתְךָ֣ יֹאמֵ֑רוּ וּגְבוּרָתְךָ֥ יְדַבֵּֽרוּ׃ לְהוֹדִ֤יעַ ׀ לִבְנֵ֣י הָ֭אָדָם גְּבוּרֹתָ֑יו וּ֝כְב֗וֹד הֲדַ֣ר מַלְכוּתֽוֹ׃ מַֽלְכוּתְךָ֗ מַלְכ֥וּת כׇּל־עֹלָמִ֑ים וּ֝מֶֽמְשַׁלְתְּךָ֗ בְּכׇל־דּ֥וֹר וָדֹֽר׃ סוֹמֵ֣ךְ יְ֭הֹוָה לְכׇל־הַנֹּפְלִ֑ים וְ֝זוֹקֵ֗ף לְכׇל־הַכְּפוּפִֽים׃ עֵֽינֵי־כֹ֭ל אֵלֶ֣יךָ יְשַׂבֵּ֑רוּ וְאַתָּ֤ה נֽוֹתֵן־לָהֶ֖ם אֶת־אׇכְלָ֣ם בְּעִתּֽוֹ׃ פּוֹתֵ֥חַ אֶת־יָדֶ֑ךָ וּמַשְׂבִּ֖יעַ לְכׇל־חַ֣י רָצֽוֹן׃ צַדִּ֣יק יְ֭הֹוָה בְּכׇל־דְּרָכָ֑יו וְ֝חָסִ֗יד בְּכׇל־מַעֲשָֽׂיו׃ קָר֣וֹב יְ֭הֹוָה לְכׇל־קֹרְאָ֑יו לְכֹ֤ל אֲשֶׁ֖ר יִקְרָאֻ֣הוּ בֶֽאֱמֶֽת׃ רְצוֹן־יְרֵאָ֥יו יַעֲשֶׂ֑ה וְֽאֶת־שַׁוְעָתָ֥ם יִ֝שְׁמַ֗ע וְיוֹשִׁיעֵֽם׃ שׁוֹמֵ֣ר יְ֭הֹוָה אֶת־כׇּל־אֹהֲבָ֑יו וְאֵ֖ת כׇּל־הָרְשָׁעִ֣ים יַשְׁמִֽיד׃ תְּהִלַּ֥ת יְהֹוָ֗ה יְֽדַבֶּ֫ר פִּ֥י וִיבָרֵ֣ךְ כׇּל־בָּ֭שָׂר שֵׁ֥ם קׇדְשׁ֗וֹ לְעוֹלָ֥ם וָעֶֽד׃ וַאֲנַ֤חְנוּ ׀ נְבָ֘רֵ֤ךְ יָ֗הּ מֵעַתָּ֥ה וְעַד־עוֹלָ֗ם הַֽלְלוּיָֽהּ׃ \n\n" +
			"(ואומר השליח צבור חצי קדיש) (Chazzan says half kaddish)");
		addHalfKaddish(false);
		addToSiddur(
			"בֶּן אָדָם, מַה לְּךָ נִרְדָּם, קוּם קְרָא בְּתַחֲנוּנִים. שְׁפֹךְ שִׂיחָה, דְּרֹשׁ סְלִיחָה, מֵאֲדוֹן הָאֲדוֹנִים. רְחַץ וּטְהַר, וְאַל תְּאַחַר, בְּטֶרֶם יָמִים פּוֹנִים. וּמְהֵרָה, רוּץ לְעֶזְרָה, לִפְנֵי שׁוֹכֵן מְעוֹנִים. וּמִפֶּשַׁע, וְגַם רֶשַׁע, בְּרַח וּפְחַד מֵאֲסוֹנִים. אָנָּא שְׁעֵה, שִׁמְךָ יוֹדְעֵי, יִשְׂרָאֵל נֶאֱמָנִים. לְךָ֤ אֲדֹנָי֙ הַצְּדָקָ֔ה וְלָ֛נוּ בֹּ֥שֶׁת הַפָּנִ֖ים: עֲמֹד כְּגֶבֶר, וְהִתְגַּבֵּר, לְהִתְוַדּוֹת עַל חֲטָאִים. יָהּ אֵל דְּרֹשׁ, בְּכֹבֶד רֹאשׁ, לְכַפֵּר עַל פְּשָׁעִים. כִּי לְעוֹלָם, לֹא נֶעְלָם, מִמֶּנּוּ נִפְלָאִים. וְכָל מַאֲמָר, אֲשֶׁר יֵאָמַר, לְפָנָיו הֵם נִקְרָאִים. הַמְּרַחֵם, הוּא יְרַחֵם, עָלֵינוּ כְּרַחֵם אָב עַל בָּנִים: \n\n" +
			"לְךָ֤ אֲדֹנָי֙ הַצְּדָקָ֔ה וְלָ֛נוּ בֹּ֥שֶׁת הַפָּנִ֖ים: מַה נִּתְאוֹנֵן וּמַה נֹּאמַר. מַה נְּדַבֵּר וּמַה נִּצְטַדָּק: נַחְפְּשָׂה דְרָכֵינוּ וְנַחְקֹרָה. וְנָשׁוּבָה אֵלֶיךָ: כִּי יְמִינְךָ פְּשׁוּטָה. לְקַבֵּל שָׁבִים: שָׁבִים אֵלֶיךָ בְּכָל לֵב. שַׁוְעָתָם תְּקַבֵּל בְּרַחֲמֶיךָ: בְּרַחֲמֶיךָ הָרַבִּים בָּאנוּ לְפָנֶיךָ. כְּדַלִּים וּכְרָשִׁים דָּפַקְנוּ דְלָתֶיךָ: דְּלָתֶיךָ דָּפַקְנוּ רַחוּם וְחַנּוּן. אַל תְּשִׁיבֵנוּ רֵיקָם מִלְּפָנֶיךָ: מִלְּפָנֶיךָ מַלְכֵּנוּ רֵיקָם אַל תְּשִׁיבֵנוּ. כִּי אַתָּה שׁוֹמֵעַ תְּפִלָּה: שׁוֹמֵעַ תְּפִלָּה. עָדֶיךָ כָּל בָּשָׂר יָבֹאוּ: שׁוֹמֵעַ תְּחִנָּה. אֵלֶיךָ כָּל הָרוּחוֹת יָבֹאוּ: יָבֹאוּ אֵלֶיךָ הָרוּחוֹת. וְכָל הַנְּשָׁמָה: הַנְּשָׁמָה לָךְ וְהַגּוּף פָּעֳלָךְ. חוּסָה עַל עֲמָלָךְ: הַנְּשָׁמָה לָךְ וְהַגּוּף פָּעֳלָךְ. צוּר אֲשֶׁר אֵין דּוֹמֶה לָךְ. חוּסָה עַל עֲמָלָךְ: הַנְּשָׁמָה לָךְ וְהַגּוּף פָּעֳלָךְ. יהוה עֲשֵׂה לְמַעַן שִׁמֶךָ: אָתָאנוּ עַל שִׁמְךָ. יהוה עֲשֵׂה לְמַעַן שִׁמְךָ: בַּעֲבוּר שִׁמְךָ. כִּי אֵל מֶלֶךְ חַנּוּן וְרַחוּם שְׁמֶךָ: שִׁמְךָ נִקְרָא עָלֵינוּ. יהוה אֱלֹהֵינוּ: שִׁמְךָ נִקְרָא בְּקִרְבֵּנוּ. אַל תַּנִּיחֵנוּ יהוה אֱלֹהֵינוּ: אֱלֹהֵינוּ בּוֹשְׁנוּ בְּמַעֲשֵׂינוּ. וְנִכְלַמְנוּ בַּעֲוֹנוֹתֵינוּ: אֵין לָנוּ פֶּה לְהָשִׁיב. וְלֹא מֵצַח לְהָרִים רֹאשׁ: כִּי־רַבּ֥וּ מְשׁוּבֹתֵ֖ינוּ לְךָ֥ חָטָֽאנוּ: חָטָ֥אנוּ עִם־אֲבוֹתֵ֗ינוּ הֶעֱוִ֥ינוּ הִרְשָֽׁעְנוּ: מַה נֹּאמַר לְפָנֶיךָ יהוה אֱלֹהֵינוּ. מַה נְּדַבֵּר וּמַה נִּצְטַדָּק: מַה נֹּאמַר לְפָנֶיךָ יוֹשֵׁב מָרוֹם. וּמַהּ נְּסַפֵּר לְפָנֶיךָ שׁוֹכֵן שְׁחָקִים: הֲלֹא הַנִּסְתָּרוֹת וְהַנִּגְלוֹת. אַתָּה יוֹדֵעַ: אַתָּה יוֹדֵעַ רָזֵי עוֹלָם. וְתַעֲלוּמוֹת סִתְרֵי כָל חָי: אַתָּה חוֹפֵשׂ כָּל חַדְרֵי בָטֶן. רוֹאֶה כְלָיוֹת וָלֵב: אֵין דָּבָר נֶעְלָם מִמָּךְ. וְאֵין נִסְתָּר מִנֶּגֶד עֵינֶיךָ: אִם־עֲוֺנֵ֙ינוּ֙ עָ֣נוּ בָ֔נוּ יְהֹוָ֕ה עֲשֵׂ֖ה לְמַ֣עַן שְׁמֶ֑ךָ: אִם־עֲוֺנ֥וֹת תִּשְׁמׇר־יָ֑הּ אֲ֝דֹנָ֗י מִ֣י יַעֲמֹֽד: כִּֽי־עִמְּךָ֥ הַסְּלִיחָ֑ה לְ֝מַ֗עַן תִּוָּרֵֽא: כִּֽי־עִ֭מְּךָ מְק֣וֹר חַיִּ֑ים בְּ֝אוֹרְךָ֗ נִרְאֶה־אֽוֹר: כִּ֣י ׀ לֹ֣א עַל־צִדְקֹתֵ֗ינוּ אֲנַ֨חְנוּ מַפִּילִ֤ים תַּחֲנוּנֵ֙ינוּ֙ לְפָנֶ֔יךָ כִּ֖י עַל־רַחֲמֶ֥יךָ הָרַבִּֽים:");

		if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()) {
			addToSiddurHighlighted(
				"לְמַעַנְךָ אֱלֹהַי. רְצֵה עַם לְךָ שִׁחַר. לְחַלּוֹת פָּנֶיךָ. בְּמַעֲמַד הַשַּׁחַר. אֲדֹנָ֛י הַֽקְשִׁ֥יבָה וַעֲשֵׂ֖ה אַל־תְּאַחַ֑ר: \n\n" +
				"לְמַעַנְךָ אֱלֹהַי. דְּלֵה מִמְּצֻלוֹת יָם. שְׂבֵעֵי רוֹשׁ וְלַעַן. בְּבֵית נוֹדָם וְשִׁבְיָם. וְשׁוּר לַחְצָם וְעָנְיָם. וְאַל תֵּפֶן לְמֶרְיָם. וְהַט אֹזֶן לְשַׁוְעָם. בִּתְפִלַּת הַשַּׁחַר: אֲדֹנָ֛י הַֽקְשִׁ֥יבָה וַעֲשֵׂ֖ה אַל־תְּאַחַ֑ר: \n\n" +
				"לְמַעַנְךָ אֱלֹהַי. וַעֲשֵׂה לְטוֹבָה אוֹת. וְחוֹן נְפָשׁוֹת עֲצוּבוֹת. לְמֵי יֶשַׁע צְמֵאוֹת. וְקַבֵּץ נִדָּחִים. פְּזוּרִים בְּכָל פֵּאוֹת. אֲשֶׁר מֵרֹב תְּלָאוֹת. עוֹרָם מְאֹד שָׁחַר: אֲדֹנָ֛י הַֽקְשִׁ֥יבָה וַעֲשֵׂ֖ה אַל־תְּאַחַ֑ר: \n\n" +
				"לְמַעַנְךָ אֱלֹהַי. יֶהֱמוּ רַחֲמֶיךָ. וּמִמְּעוֹן שָׁמֶיךָ. שְׁמַע קוֹל עַמֶּךָ. סוֹבְלֵי אַפְּךָ. קִצְפְּךָ וְזַעֲמֶךָ. וּמִנְּשׂוֹא אֵימֶיךָ. לִבָּם מְאֹד סְחַרְחַר: אֲדֹנָ֛י הַֽקְשִׁ֥יבָה וַעֲשֵׂ֖ה אַל־תְּאַחַ֑ר: \n\n" +
				"לְמַעַנְךָ אֱלֹהַי. דַּלֶּיךָ תְּרַחֵם. וְשַׂמְּחֵם מִיגוֹנָם. וּבַעֲצָתְךָ תַנְחֵם. וְהַפְלֵא חֲסָדֶיךָ. וְחוּסָה נָּא וְרַחֵם. עֲמוּסִים מִבֶּטֶן וּמֵרֶחֶם מִשְׁחָר. אֲדֹנָ֛י הַֽקְשִׁ֥יבָה וַעֲשֵׂ֖ה אַל־תְּאַחַ֑ר:");
		}

		addToSiddur(
			"אֲדֹנָ֤י ׀ שְׁמָ֙עָה֙ אֲדֹנָ֣י ׀ סְלָ֔חָה אֲדֹנָ֛י הַֽקְשִׁ֥יבָה וַעֲשֵׂ֖ה אַל־תְּאַחַ֑ר לְמַֽעַנְךָ֣ אֱלֹהַ֔י כִּֽי־שִׁמְךָ֣ נִקְרָ֔א עַל־עִירְךָ֖ וְעַל־עַמֶּֽךָ: הֲשִׁיבֵ֨נוּ יְהֹוָ֤ה ׀ אֵלֶ֙יךָ֙ וְֽנָשׁ֔וּבָה חַדֵּ֥שׁ יָמֵ֖ינוּ כְּקֶֽדֶם: \n\n" +
			"שֵׁבֶט יְהוּדָה בְּדֹחַק וּבְצַעַר. הֲיִשְׁאַג אַרְיֵה בַיַּעַר: מְקַוִּים יְשׁוּעָתְךָ אָבוֹת וּבָנִים. הָעֲנִיִּים וְהָאֶבְיוֹנִים: עֲמֹד בַּפֶּרֶץ בַּל נִהְיֶה לִשְׂחֹק. לָמָ֣ה יְ֭הֹוָה תַּעֲמֹ֣ד בְּרָח֑וֹק: יוֹנָתְךָ עַד שַׁעֲרֵי מָוֶת הִגִּיעָה. יוֹשֵׁב הַכְּרוּבִים הוֹפִיעָה: הָֽבָה־לָּ֣נוּ עֶזְרָ֣ת מִצָּ֑ר. הֲיַ֥ד יְהֹוָ֖ה תִּקְצָ֑ר: חַדֵּשׁ יָמֵינוּ בְגָלוּת יָשָׁן. עוּרָה לָמָּה תִישָׁן: זְכֹר בָּנֶיךָ בְּאֶרֶץ לֹא לָהֶם. וְזָ֖ר לֹא־יִקְרַ֥ב אֲלֵיכֶֽם: קֵץ הַנֶּחְתָּם גַּלֵּה לְגַלְמוּדָה. יִשְׂמַ֤ח ׀ הַר־צִיּ֗וֹן תָּ֭גֵלְנָה בְּנ֣וֹת יְהוּדָ֑ה: שַׁוְעָתֵנוּ תַּעֲלֶה לִשְׁמֵי מְרוֹמִים. אֶל מֶלֶךְ יוֹשֵׁב עַל כִּסֵּא רַחֲמִים: \n\n" +
			"אֵל מֶלֶךְ יוֹשֵׁב עַל כִּסֵּא רַחֲמִים וּמִתְנַהֵג בַּחֲסִידוּת. מוֹחֵל עֲוֹנוֹת עַמּוֹ מַעֲבִיר רִאשׁוֹן רִאשׁוֹן. מַרְבֶּה מְחִילָה לַחַטָּאִים. וּסְלִיחָה לַפּוֹשְׁעִים. עוֹשֶׂה צְדָקוֹת עִם כָּל בָּשָׂר וְרוּחַ. לֹא כְרָעָתָם לָהֶם גּוֹמֵל. אֵל הוֹרֵתָנוּ לוֹמַר מִדּוֹת שְׁלֹשׁ עֶשְׂרֵה. זְכֹר לָנוּ הַיּוֹם בְּרִית שְׁלֹשׁ עֶשְׂרֵה. כְּמוֹ שֶׁהוֹדַעְתָּ לֶעָנָו מִקֶּדֶם. וְכֵן כָּתוּב בְּתוֹרָתָךְ: וַיֵּ֤רֶד יְהֹוָה֙ בֶּֽעָנָ֔ן וַיִּתְיַצֵּ֥ב עִמּ֖וֹ שָׁ֑ם וַיִּקְרָ֥א בְשֵׁ֖ם יְהֹוָֽה. וְשָׁם נֶאֱמַר: \n\n" +
			vayavor +
			" וְסָלַחְתָּ לַעֲוֹנֵנוּ וּלְחַטָּאתֵנוּ וּנְחַלְתָּנוּ:");

		addToSiddur(
			"רַחֲמָנָא אִדְכַּר לָן קְיָמֵהּ דְּאַבְרָהָם רְחִימָא, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא אִדְכַּר לָן קְיָמֵהּ דְּיִצְחָק עֲקֵידָא, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא אִדְכַּר לָן קְיָמֵהּ דְּיַעֲקֹב שְׁלֵימָא, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא אִדְכַּר לָן קְיָמֵהּ דְּמֹשֶׁה נְבִיאָה, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא אִדְכַּר לָן קְיָמֵהּ דְּאַהֲרֹן כַּהֲנָא, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא אִדְכַּר לָן זְכוּתֵהּ דְּיוֹסֵף צַדִּיקָא, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא אִדְכַּר לָן קְיָמֵהּ דְּדָוִד מַלְכָּא מְשִׁיחָא, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא אִדְכַּר לָן קְיָמֵהּ דְּפִינְחָס קַנָּאָה, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא אִדְכַּר לָן צְלוֹתֵהּ דִּשְׁלֹמֹה מַלְכָּא, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא אָרֵים יְמִינָךְ וְאַצְמַח פֻּרְקָנָךְ, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא בְּכִסּוּפֵי אַפִּין אָתֵינָא לְמִקְרֵי קַמָּךְ רַחֵם עֲלָן, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא גַּלֵּי גְבֻרְתָּךְ וּפְרֹק לָן, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא דִּינָן אַפֵּיק לִנְהוֹרָא, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא דִּינָא דְחַיֵּי טָבֵי גְּזֹר עֲלָן, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא הַדְרָךְ שַׁוִּי עֲלָן, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא וְלָא תִתְפְּרַע כְּעוֹבָדָנָא בִּישִׁין מִנָּן, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא זִיוָךְ אַשְרֵי עֲלָן, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא זַכְוָן חַפֵּשׂ לָן, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא חֲשׁוֹב עֲלָן טַבְוָן, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא טַבְוָן סַגִּיאָן אַיְתִי עֲלָן, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא יִתְגַּלְגְּלוּן רַחֲמָךְ עֲלָן, בְּדִיל וַיַּעֲבֹר:");

		if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()) {
			addToSiddurHighlighted(
				"רַחֲמָנָא כַּתְבִינָן בְּסִפְרָא דְחַיֵּי טָבֵי, בְּדִיל וַיַּעֲבֹר: \n\n" +
				"רַחֲמָנָא כַּתְבִינָן בְּסִפְרָא דְרַחֲמֵי, בְּדִיל וַיַּעֲבֹר: \n\n" +
				"רַחֲמָנָא כַּתְבִינָן בְּסִפְרָא דְצַדִּיקֵי וַחֲסִידֵי, בְּדִיל וַיַּעֲבֹר: \n\n" +
				"רַחֲמָנָא כַּתְבִינָן בְּסִפְרָא דִישָׁרֵי וּתְמִימֵי, בְּדִיל וַיַּעֲבֹר: \n\n" +
				"רַחֲמָנָא כַּתְבִינָן בְּסִפְרָא דְפַרְנָסָתָא טַבְתָּא וּמְזוֹנֵי טָבֵי, בְּדִיל וַיַּעֲבֹר:");
		}

		addToSiddur(
			"רַחֲמָנָא כְּבֹשׁ חֶמְתָּא וְרֻגְזָא מִנָּן, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא לָא תַעְבֵּיד גְּמִירָא לָן, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא מְחֹל וּשְׁבֹק לְחוֹבִין וְלַעֲוָיָן, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא נְהוֹר טוּבָךְ אַנְהַר עֲלָן, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא סְעִיד וּסְמִיךְ הֱוֵי לָן, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא עֲבֵיד עִמָּנָא אָתָא לְטַב, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא פְּתַח שְׁמַיָּא לִצְלוֹתִין, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא צְלוֹתָנָא קַבֵּל בְּרַעֲוָא, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא קַבֵּל צְלוֹתִין וּבָעוּתִין בְּעִדָּן עַקְתִּין, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא רַחֵם עַל נִשְׁמָתִין, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא שַׁתָּא טַבְתָּא אַיְיתֵי עֲלָן, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא תּוּב מֵרֻגְזָךְ, בְּדִיל וַיַּעֲבֹר: \n\n" +
			"רַחֲמָנָא וְלָא נֶהְדָּר רֵיקָם מִן קַמָּךְ, בְּדִיל וַיַּעֲבֹר: \n\n" +
			vayavor +
			" וְסָלַחְתָּ לַעֲוֹנֵנוּ וּלְחַטָּאתֵנוּ וּנְחַלְתָּנוּ:" + "\n\n" +
			"אַנְשֵׁי אֱמוּנָה אָבָדוּ. בָּאִים בְּכֹחַ מַעֲשֵׂיהֶם: גִּבּוֹרִים לַעֲמֹד בַּפֶּרֶץ. דּוֹחִים אֶת הַגְּזֵרוֹת: הָיוּ לָנוּ לְחוֹמָה. וּלְמַחְסֶה בְּיוֹם זַעַם: זוֹעֲכִים אַף בְּלַחֲשָׁם. חֵמָה עָצְרוּ בְּשַׁוְּעָם: טֶרֶם קְרָאוּךָ עֲנִיתָם. יוֹדְעִים לַעֲתֹר וּלְרַצּוֹת: כְּאָב רִחַמְתָּ לְמַעֲנָם. לֹא הֱשִׁיבוֹתָ פְּנֵיהֶם רֵיקָם: מֵרֹב עֲוֹנֵינוּ אֲבַדְנוּם. נֶאֶסְפוּ מֶנּוּ בַּחֲטָאֵינוּ: סָעוּ הֵמָּה לִמְנוּחוֹת. עָזְבוּ אוֹתָנוּ לַאֲנָחוֹת: פַּסּוּ גוֹדְרֵי גָדֵר. צֻמְּתוּ מְשִׁיבֵי חֵמָה: קָמִים בַּפֶּרֶץ אַיִן. רְאוּיִים לְרַצּוֹתְךָ אָפֵסוּ: שׁוֹטַטְנוּ בְּאַרְבַּע פִּנּוֹת. תְּרוּפָה לֹא מָצָאנוּ: שַׁבְנוּ אֵלֶיךָ בְּבֹשֶׁת פָּנֵינוּ. לְשַׁחֲרָךְ אֵל בְּעֵת סְלִיחָתֵנוּ: \n\n" +
			"אֵל מֶלֶךְ יוֹשֵׁב עַל כִּסֵּא רַחֲמִים וּמִתְנַהֵג בַּחֲסִידוּת. מוֹחֵל עֲוֹנוֹת עַמּוֹ מַעֲבִיר רִאשׁוֹן רִאשׁוֹן. מַרְבֶּה מְחִילָה לַחַטָּאִים. וּסְלִיחָה לַפּוֹשְׁעִים. עוֹשֶׂה צְדָקוֹת עִם כָּל בָּשָׂר וְרוּחַ. לֹא כְרָעָתָם לָהֶם גּוֹמֵל. אֵל הוֹרֵתָנוּ לוֹמַר מִדּוֹת שְׁלֹשׁ עֶשְׂרֵה. זְכֹר לָנוּ הַיּוֹם בְּרִית שְׁלֹשׁ עֶשְׂרֵה. כְּמוֹ שֶׁהוֹדַעְתָּ לֶעָנָו מִקֶּדֶם. וְכֵן כָּתוּב בְּתוֹרָתָךְ: וַיֵּ֤רֶד יְהֹוָה֙ בֶּֽעָנָ֔ן וַיִּתְיַצֵּ֥ב עִמּ֖וֹ שָׁ֑ם וַיִּקְרָ֥א בְשֵׁ֖ם יְהֹוָֽה. וְשָׁם נֶאֱמַר: \n\n" +
			vayavor +
			" וְסָלַחְתָּ לַעֲוֹנֵנוּ וּלְחַטָּאתֵנוּ וּנְחַלְתָּנוּ:" + "\n\n" +
			"תָּמַהְנוּ מֵרָעוֹת. תָּשַׁשׁ כֹּחֵנוּ מִצָּרוֹת: שַׁחְנוּ עַד לִמְאֹד. שָׁפַלְנוּ עַד עָפָר: רַחוּם כַּךְ הִיא מִדָּתֵנוּ. קְשֵׁי עֹרֶף וּמַמְרִים אֲנַחְנוּ: צָעַקְנוּ בְּפִינוּ חָטָאנוּ. פְּתַלְתֹּל וְעִקֵּשׁ לִבֵּנוּ: עֶלְיוֹן רַחֲמֶיךָ מֵעוֹלָם. סְלִיחָה עִמְּךָ הִיא: נִחָם עַל הָרָעָה. מַטֵּה כְלַפֵּי חֶסֶד: לֹא תִתְעַלָּם בְּעִתּוֹת כָּאֵל. כִּי בְצָרָה גְדוֹלָה אֲנַחְנוּ: יִוָּדַע לְעֵינֵי הַכֹּל. טוּבְךָ וְחַסְדְּךָ עִמָּנוּ: חֲתֹם פֶּה שָׂטָן וְאַל יַשְׂטִין עָלֵינוּ. זְעֹם בּוֹ וְיִדּוֹם: וְיַעֲמֹד מֵלִיץ טוֹב לְצַדְּקֵנוּ. הוּא יַגִּיד יָשְׁרֵנוּ: דְּרָכֶיךָ רַחוּם וְחַנּוּן. גִּלִּיתָ לְנֶאֱמַן בַּיִת: בְּבַקְשׁוֹ אָז מִלְּפָנֶיךָ. אֱמוּנָתְךָ הוֹדַעְתָּ לּוֹ: \n\n" +
			"אֵל מֶלֶךְ יוֹשֵׁב עַל כִּסֵּא רַחֲמִים וּמִתְנַהֵג בַּחֲסִידוּת. מוֹחֵל עֲוֹנוֹת עַמּוֹ מַעֲבִיר רִאשׁוֹן רִאשׁוֹן. מַרְבֶּה מְחִילָה לַחַטָּאִים. וּסְלִיחָה לַפּוֹשְׁעִים. עוֹשֶׂה צְדָקוֹת עִם כָּל בָּשָׂר וְרוּחַ. לֹא כְרָעָתָם לָהֶם גּוֹמֵל. אֵל הוֹרֵתָנוּ לוֹמַר מִדּוֹת שְׁלֹשׁ עֶשְׂרֵה. זְכֹר לָנוּ הַיּוֹם בְּרִית שְׁלֹשׁ עֶשְׂרֵה. כְּמוֹ שֶׁהוֹדַעְתָּ לֶעָנָו מִקֶּדֶם. וְכֵן כָּתוּב בְּתוֹרָתָךְ: וַיֵּ֤רֶד יְהֹוָה֙ בֶּֽעָנָ֔ן וַיִּתְיַצֵּ֥ב עִמּ֖וֹ שָׁ֑ם וַיִּקְרָ֥א בְשֵׁ֖ם יְהֹוָֽה. וְשָׁם נֶאֱמַר: \n\n" +
			vayavor +
			" וְסָלַחְתָּ לַעֲוֹנֵנוּ וּלְחַטָּאתֵנוּ וּנְחַלְתָּנוּ:" + "\n\n" +
			"אֲנַחְנוּ בּוֹשְׁנוּ בְּמַעֲשֵׂינוּ, וְנִכְלַמְנוּ בַּעֲוֹנוֹתֵינוּ, אֵין לָנוּ פֶּה לְהָשִׁיב, וְלֹא מֵצַח לְהָרִים רֹאשׁ: \n\n" +
			"אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ. אַל תַּעַשׂ עִמָּנוּ כָלָה. תֹּאחֵז יָדְךָ בַּמִּשְׁפָּט: בְּבֹא תוֹכֵחָה נֶגְדֶּךָ. שְׁמֵנוּ מִסִּפְרְךָ אַל תֶּמַח: גִּשְׁתְּךָ לַחֲקֹר מוּסָר. רַחֲמֶיךָ יְקַדְּמוּ רָגְזֶךָ: דַּלּוּת מַעֲשִׂים בְּשׁוּרֶךָ. קָרֵב צֶדֶק מֵאֵלֶיךָ: הוֹרֵנוּ, בְּזַעֲקֵנוּ לָךְ. צַו יְשׁוּעָתֵנוּ בְּמַפְגִּיעַ: וְתָשִׁיב שְׁבוּת אָהֳלֵי תָם. פְּתָחָיו רְאֵה כִּי שָׁמֵמוּ: זְכֹר נָאַמְתָּ. עֵדוּת לֹא תִשָּׁכַח מִפִּי זַרְעוֹ: חוֹתָם תְּעוּדָה תַתִּיר. סוֹדְךָ שִׂים בְּלִמּוּדֶךָ. טַבּוּר אַגַּן הַסַּהַר. נָא אַל יֶחְסַר הַמָּזֶג: יָהּ, דַּע אֶת יִשְׂרָאֵל אֲשֶׁר יְדָעוּךָ. מַגֵּר אֶת הַגּוֹיִם אֲשֶׁר לֹא יְדָעוּךָ: כִּי תָשִׁיב לְבִצָּרוֹן. לְכוּדִים אֲסִירֵי הַתִּקְוָה: \n\n" +
			"רִבּוֹנוֹ שֶׁל עוֹלָם. אֶתְוַדֶּה עַל עֲבֵרוֹת. קַלּוֹת וַחֲמוּרוֹת. בַּלַּיְלָה לְסוֹף אַשְׁמוּרוֹת: יִצְרִי עֲלִילוֹת בְּרֶשַׁע לְהִתְעוֹלֵל. שׁוֹמֵר מַה מִּלַּיְלָה שׁוֹמֵר מַה מִּלֵּיל: לִבִּי וְעֵינַי לַחֲטֹא יֵאוֹתוּ. וְיוֹם וָלַיְלָה לֹא יִשְׁבֹּתוּ: וּשְׁאָר אֵבָרַי לַעֲשׂוֹת הָרַע בְּעֵינֶיךָ יִתְלַחֲשׁוּ. כָּל הַיּוֹם וְכָל הַלַּיְלָה תָּמִיד לֹא יֶחֱשׁוּ: וְיַעַן אֲשֶׁר עָבַרְתִּי עַל מִצְוֹת עֲשֵׂה וְעַל מִצְוֹת לֹא תַעֲשֶׂה. מִי יִתֵּן וְאַשְׂחֶה בְּכָל לַיְלָה מִטָּתִי בְּדִמְעָתִי עַרְשִׂי אַמְסֶה: אוּלַי יִשְׁמַע קוֹל בִּכְיִי נוֹרָא עֲלִילָה. יוֹם צָעַקְתִּי בַּלָּיְלָה: אֶקְרָא יוֹמָם וְאָרִים קוֹלִי. עַל פִּשְׁעִי וּמַעֲלִי. וְלַיְלָה וְלֹא דוּמִיָּה לִי: אֶת מִקְצַת חֲטָאַי אֲנִי מַזְכִּיר לִפְנֵי צוֹפֶה עֲתִידוֹת. לַיְלָה אָקוּם לְהוֹדוֹת: וְאוֹדֶה עֲלֵי פְשָׁעַי וּזְדוֹנַי. הַלַּיְלָה הַזֶּה לַיהוה: \n\n"
					.replace("לְסוֹף", isAfterChatzot ? "בְּתוֹך" : "לְסוֹף")
			+
			"אָנָּא יהוה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ. תָּבֹא לְפָנֶיךָ תְּפִלָּתֵנוּ. וְאַל תִּתְעַלַּם מַלְכֵּנוּ מִתְּחִנָּתֵנוּ. שֶׁאֵין אֲנַחְנוּ עַזֵּי פָנִים וּקְשֵׁי עֹרֶף לוֹמַר לְפָנֶיךָ יהוה אלהינו וֵאלֹהֵי אֲבוֹתֵינוּ, צַדִּיקִים אֲנַחְנוּ וְלֹא חָטָאנוּ. אֲבָל חָטָאנוּ. עָוִינוּ. פָּשַׁעְנוּ. אֲנַחְנוּ וַאֲבוֹתֵינוּ וְאַנְשֵׁי בֵיתֵנוּ: \n\n" +
			"חַטָּאתִי אוֹדִיעֲךָ וַעֲוֹנִי לֹא כִסִּיתִי. אָמַרְתִּי אוֹדֶה עֲלֵי פְשָׁעַי לַ יהוה. וְאַתָּה נָשָׂאתָ עֲוֹן חַטָּאתִי סֶלָה: מְכַסֶּה פְשָׁעָיו לֹא יַצְלִיחַ. וּמוֹדֶה וְעֹזֵב יְרֻחָם: \n\n" +
			"אָשַׁמְנוּ. אָכַלְנוּ מַאֲכָלוֹת אֲסוּרוֹת. בָּגַדְנוּ. בִּטַּלְנוּ תוֹרָתֶךָ. גָּזַלְנוּ. גָּנַבְנוּ. גָּאִינוּ. דִּבַּרְנוּ דֹפִי וְלָשׁוֹן הָרָע. דִּבַּרְנוּ אֶחָד בַּפֶּה וְאֶחָד בַּלֵּב. הֶעֱוִינוּ. הִרְהַרְנוּ הִרְהוּרִים רָעִים בַּיּוֹם וּבָאנוּ לִידֵי טֻמְאַת קֶרִי בַּלַּיְלָה. וְהִרְשַׁעְנוּ. וִיעַדְנוּ עַצְמֵנוּ לִדְבַר עֲבֵרָה. זַדְנוּ. זָנִינוּ אַחַר לִבֵּנוּ וְעֵינֵינוּ. חָמַסְנוּ. חָמַדְנוּ. חִלַלְנוּ שָׁבָּתוֹת וּמוֹעֲדֵי קֹדְשֶךָ. טָפַלְנוּ שֶׁקֶר וּמִרְמָה. יָעַצְנוּ עֵצוֹת רָעוֹת עַד אֵין חֵקֶר. כִּזַּבְנוּ. כָּעַסְנוּ. לַצְנוּ. לוֹצַצְנוּ. מָרַדְנוּ. מָרִינוּ דְבָרֶיךָ. מָרַדְנוּ בְמַלְכוּת שָׁמַיִם. מָרַדְנוּ בְמַלְכוּת בֵּית דָּוִד. מָאַסְנוּ בְבֵית הַמִּקְדָּשׁ, וּשְׁלָשְׁתָּם אֲנַחְנוּ מְבַקְשִׁים. נִאַצְנוּ. נִאַפְנוּ. נִשְׁבַּעְנוּ לַשָּׁוְא וְלַשֶּׁקֶר. נָדַרְנוּ וְלֹא שִׁלַּמְנוּ. סָרַרְנוּ. סוֹרְרִים וּמוֹרִים הָיִינוּ. עָוִינוּ. עָבַרְנוּ עַל מִצְוֹת עֲשֵׂה וְעַל מִצְוֹת לֹא תַעֲשֶׂה. עָבַרְנוּ עַל כְּרִיתוֹת וּמִיתוֹת בֵּית דִּין. עָבַרְנוּ עַל חִלּוּל הַשֵּׁם. פָּשַׁעְנוּ. פָּגַמְנוּ בְּאוֹת בְּרִית קֹדֶשׁ. צָרַרְנוּ. צִעַרְנוּ אָב וָאֵם. קִשִּׁינוּ עֹרֶף. קִלְקַלְנוּ צִנּוֹרוֹת הַשֶּׁפַע. רָשַׁעְנוּ. רָעִים לַשָּׁמַיִם וְלַבְּרִיּוֹת הָיִינוּ. שִׁחַתְנוּ. שִׁקַּרְנוּ. שִׁחַתְנוּ זֶרַע קֹדֶשׁ לְבַטָּלָה וּבָרָאנוּ מַשְׁחִית לְחַבֵּל. גַּם בִּכְנָפֵינוּ נִמְצְאוּ דַּם נַפְשׁוֹת אֶבְיוֹנִים נְקִיִּים וְהִנֵּה דִמְעַת הָעֲשׁוּקִים וְאֵין לָהֶם מְנַחֵם. לִבִּי לִבִּי עַל חַלְלֵיהֶם. מֵעַי מֵעַי עַל הֲרוּגֵיהֶם. אוֹי לְרָשָׁע רָע, כִּי גְמוּל יָדָיו יֵעָשֶׂה לּוֹ. תִּעַבְנוּ. תָּעִינוּ וְתִעֲתַעְנוּ. וְסַרְנוּ מִמִּצְוֹתֶיךָ וּמִמִּשְׁפָּטֶיךָ הַטּוֹבִים וְלֹא שָׁוָה לָנוּ. וְאַתָּה צַדִּיק עַל כָּל הַבָּא עָלֵינוּ. כִּי אֱמֶת עָשִׂיתָ. וַאֲנַחְנוּ הִרְשָׁעְנוּ: \n\n" +
			"אָשַׁמְנוּ מִכָּל עָם. בּוֹשְׁנוּ מִכָּל גּוֹי. גָּלָה מִמֶּנּוּ מָשׂוֹשׂ. דָּוֶה לִבֵּנוּ בַּחֲטָאֵינוּ. הָחְבַּל אֶוְיֵנוּ. וְנִפְרַע פְּאֵרֵנוּ. זְבוּל מִקְדָּשֵׁנוּ. חָרֵב בַּעֲוֹנֵינוּ. טִירָתֵנוּ הָיְתָה לְשַׁמָּה. יְפִי אַדְמָתֵנוּ לְזָרִים. כֹּחֵנוּ לְנָכְרִים: לְעֵינֵינוּ עָשְׁקוּ עֲמָלֵנוּ. מְמֻשָּׁךְ וּמֹרָט מִמֶּנּוּ. נָתְנוּ עֻלָּם עָלֵינוּ. סָבַלְנוּ עַל שִׁכְמֵנוּ. עֲבָדִים מָשְׁלוּ בָנוּ. פּוֹרֵק אֵין מִיָּדָם. צָרוֹת רַבּוֹת סְבָבוּנוּ. קְרָאנוּךָ יהוה אלהינו. רִחַקְתָּ מִמֶּנּוּ בַּעֲוֹנֵינוּ. שַׁבְנוּ מֵאַחֲרֶיךָ. תָּעִינוּ כַּצֹּאן וְאָבַדְנוּ. וַעֲדַיִן לֹא שַׁבְנוּ מִתְּעִיָּתֵנוּ. \n\n" +
			"לַאדֹנָי אֱלֹהֵינוּ הָרַחֲמִים וְהַסְּלִיחוֹת, כִּי חָטָאנוּ לוֹ: \n\n" +
			"לַאדֹנָי אֱלֹהֵינוּ הָרַחֲמִים וְהַסְּלִחוֹת, כִּי מָרַדְנוּ בּוֹ: \n\n" +
			"אַל נָא תָשֵׁת עָלֵינוּ חַטָּאת, אֲשֶׁר נוֹאַלְנוּ וַאֲשֶׁר חָטָאנוּ: \n\n" +
			"חָטָאנוּ צוּרֵנוּ. סְלַח לָנוּ יוֹצְרֵנוּ: \n\n" +
			"שְׁמַע יִשְׂרָאֵל, יהוה אֱלֹהֵינוּ, יהוה אֶחָד: \n\n" +
			"יהוה הוּא הָאֱלֹהִים. יהוה הוּא הָאֱלֹהִים:  (ב' פעמים)(twice) \n\n" +
			"אֶרְאֵלֵי מַעְלָה. אוֹמְרִים יהוה אֲדוֹנֵנוּ. בְּחִירֵי סְגֻלָּה. עוֹנִים וְאוֹמְרִים. יהוה הוּא הָאֱלֹהִים. יהוה הוּא הָאֱלֹהִים: \n\n" +
			"גַּלְגַּלֵּי מַעְלָה. אוֹמְרִים יהוה אֲדוֹנֵנוּ. דְּגוּלֵי סְגֻלָּה. עוֹנִים וְאוֹמְרִים. יהוה הוּא הָאֱלֹהִים. יהוה הוּא הָאֱלֹהִים: \n\n" +
			"הֲמוֹנֵי מַעְלָה. אוֹמְרִים יהוה אֲדוֹנֵנוּ. יִשְׂרָאֵל בְּצָרָתָם וּבְגָלוּתָם עוֹנִים וְאוֹמְרִים. יהוה הוּא הָאֱלֹהִים. יהוה הוּא הָאֱלֹהִים: \n\n" +
			"יהוה מֶלֶךְ. יהוה מָלָךְ. יהוה יִמְלֹךְ לְעוֹלָם וָעֶד: (ב' פעמים)(twice) \n\n" +
			"בְּטֶרֶם שְׁחָקִים וַאֲרָקִים נִמְתָּחוּ. יהוה מֶלֶךְ. \n\n" +
			"וְעַד לֹא מְאוֹרוֹת זָרָחוּ. יהוה מָלָךְ. \n\n" +
			"וְהָאָרֶץ כַּבֶּגֶד תִּבְלֶה. וְשָׁמַיִם כְּעָשָׁן נִמְלָחוּ. יהוה יִמְלֹךְ לְעוֹלָם וָעֶד: \n\n" +
			"וְעַד לֹא עָשָׂה אֶרֶץ וְחוּצוֹת. יהוה מֶלֶךְ. \n\n" +
			"וּבַהֲכִינוֹ יְצוּרִים עֲלֵי אֲרָצוֹת. יהוה מָלָךְ. \n\n" +
			"וְעֵת יְקַבֵּץ נְפוּצִים מֵאַרְבַּע תְּפוּצוֹת. יהוה יִמְלֹךְ לְעוֹלָם וָעֶד: \n\n" +
			"מְיוּחָד בְּאֶהְיֶה אֲשֶׁר אֶהְיֶה. הוּא הָיָה וְהוּא הֹוֶה וְהוּא יִהְיֶה. הוּא מֵמִית וּמְחַיֶּה. לְפָנָיו לֹא נוֹצַר אֵל. וְאַחֲרָיו לֹא יִהְיֶה: \n\n" +
			"אֶחָד אֱלֹהֵינוּ. גָּדוֹל אֲדוֹנֵנוּ. קָדוֹשׁ וְנוֹרָא שְׁמוֹ: כִּי גָדוֹל מֵעַל שָׁמַיִם חַסְדֶּךָ. וְעַד שְׁחָקִים אֲמִתֶּךָ: כִּי גָדוֹל אַתָּה וְעֹשֵׂה נִפְלָאוֹת. אַתָּה אֱלֹהִים לְבַדֶּךָ: שְׁפֹךְ חֲמָתְךָ אֶל הַגּוֹיִם אֲשֶׁר לֹא יְדָעוּךָ. וְעַל מַמְלָכוֹת. אֲשֶׁר בְּשִׁמְךָ לֹא קָרָאוּ: \n\n" +
			"לִקְדֻשַּׁת שִׁמְךָ עֲשֵׂה וְלֹא לָנוּ: לֹא לָנוּ יהוה לֹא לָנוּ. כִּי לְשִׁמְךָ תֵּן כָּבוֹד. עַל חַסְדְּךָ עַל אֲמִתֶּךָ: לָמָּה יֹאמְרוּ הַגּוֹיִם. אַיֵּה נָא אֱלֹהֵיהֶם: וֵאלֹהֵינוּ בַּשָּׁמַיִם. אֶחָד אֱלֹהֵינוּ בַּשָּׁמַיִם. עֵדוּתֵנוּ בְּכָל יוֹם פַּעֲמַיִם. חַי וְקַיָּם הוּא. מָלֵא רַחֲמִים הוּא. מָלֵא זַכִּיּוּת הוּא. כָּל אֲשֶׁר חָפֵץ עָשָׂה בַשָּׁמַיִם וּבָאָרֶץ. אֵין מִי יֹאמַר לוֹ מַה תַּעֲשֶׂה. וְאֵין מִי יֹאמַר לוֹ מַה תִּפְעַל. כִּי הַכֹּל מַעֲשֵׂה יָדָיו: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם שְׁמַע קוֹלֵנוּ וְקַבֵּל תְּפִלָּתֵנוּ בְּרָצוֹן: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם אַל תְּאַבְּדֵנוּ בְּאֹרֶךְ גָּלוּתֵנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם אַבֵּד כָּל הַקָּמִים עָלֵינוּ לְרָעָה: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם בְּרִיתְךָ זְכֹר וְאַל תִּשְׁכָּחֵנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם בָּרֵךְ אֶת לַחְמֵנוּ וְאֶת מֵימֵינוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם בַּשְֹּרֵנוּ בְּשׂוֹרוֹת טוֹבוֹת: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם בַּטֵּל מֵעָלֵינוּ כָּל גְּזֵרוֹת קָשׁוֹת וְרָעוֹת: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם גְּזֹר עָלֵינוּ גְּזֵרוֹת טוֹבוֹת: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם גַּלֵּה כְּבוֹד מַלְכוּתְךָ עָלֵינוּ מְהֵרָה: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם דְּרַשְׁנוּךָ הִמָּצֵא לָנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם דְּרֹשׁ דָּמֵינוּ מִיַּד קָמֵּינוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם הֵעָתֵר לָנוּ הַיּוֹם וּבְכָל יוֹם וָיוֹם בִּתְפִלָּתֵנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם הַחֲזִירֵנוּ בִּתְשׁוּבָה שְׁלֵמָה לְפָנֶיךָ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם וְאַל תְּבִישֵׁנוּ מִשִֹּבְרֵנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם וְנִקְרָא וְאַתָּה תַעֲנֵנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם זָכְרֵנוּ בְּזִכְרוֹן טוֹב מִלְּפָנֶיךָ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם זַכֵּנוּ בְּדִינֵנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם חֲמֹל עָלֵינוּ וְעַל טַפֵּינוּ וְעַל עוֹלָלֵינוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם חוּס וְרַחֵם עָלֵינוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם טַהֲרֵנוּ מֵעֲוֹנֵינוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם טַהֲרֵנוּ מִטֻּמְאוֹתֵינוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם יֶהֱמוּ נָא רַחֲמֶיךָ עָלֵינוּ:");

		if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()) {
			addToSiddurHighlighted(
				"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם כָּתְבֵנוּ בְּסֵפֶר חַיִּים טוֹבִים: \n\n" +
				"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם כָּתְבֵנוּ בְּסֵפֶר צַדִּיקִים וַחֲסִידִים: \n\n" +
				"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם כָּתְבֵנוּ בְּסֵפֶר יְשָׁרִים וּתְמִימִים: \n\n" +
				"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם כָּתְבֵנוּ בְּסֵפֶר זָכִיּוֹת: \n\n" +
				"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם כָּתְבֵנוּ בְּסֵפֶר מְזוֹנוֹת וּפַרְנָסָה טוֹבָה: \n\n" +
				"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם כָּתְבֵנוּ בְּסֵפֶר מְחִילָה וּסְלִיחָה וְכַפָּרָה: \n\n" +
				"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם כָּתְבֵנוּ בְּסֵפֶר גְּאֻלָּה וִישׁוּעָה:");
		}

		addToSiddur(
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם כְּבֹשׁ אֶת כּוֹבְשֵׁנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם כָּלָה אַל תַּעַשׂ עִמָּנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם לְמַעֲנָךְ עֲשֵׂה אִם לֹא לְמַעֲנֵנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם לְחַץ אֶת לוֹחֲצֵינוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם לְחַם אֶת לוֹחֲמֵינוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם מַלֵּא מִשְׁאֲלוֹת לִבֵּנוּ לְטוֹבָה לַעֲבוֹדָתֶךָ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם נְקֹם אֶת נִקְמָתֵנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם סְמֹךְ אֶת נְפִילָתֵנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם סְמֹךְ אֶת סֻכַּת דָּוִד הַנּוֹפֶלֶת: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם עֲנֵה אֶת עֲתִירָתֵנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם עֲנֵנוּ בְּיוֹם קָרְאֵנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם עַנֵּה אֶת מְעַנֵּנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם פְּדֵנוּ מִידֵי כָל אוֹיְבֵינוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם פְּדֵנוּ מִידֵי יִצְרֵנוּ הָרַע: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם צַוֵּה אִתָּנוּ בִּרְכוֹתֶיךָ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם צַוֵּה אִתָּנוּ יְשׁוּעוֹתֶיךָ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם צַדְּקֵנוּ בְּמִשְׁפָּטֶיךָ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם קָרֵב לָנוּ קֵץ הַגְּאֻלָּה: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם קָרֵב לָנוּ יוֹם הַיְשׁוּעָה: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם קָרְבֵנוּ לַעֲבוֹדָתֶךָ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם רִיבָה רִיבֵנוּ וּגְאָלֵנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם רְאֵה בָּעֳנִי עַמְּךָ יִשְׂרָאֵל: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם רְפָא כָּל חוֹלֵי עַמְּךָ יִשְׂרָאֵל: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם רְאֵה בְּדֹחַק הַשָּׁעָה: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם שְׁעֵה אֶת שַׁוְעָתֵנוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם שִׁית שָׁלוֹם בֵּינֵינוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם שִׁית שַׁלְוָה בְּאַרְמְנוֹתֵינוּ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם תֵּן שָׁלוֹם בָּאָרֶץ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם תֵּן שָׂבָע בָּעוֹלָם: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם תֵּן שָׁלוֹם בַּמַּלְכוּת: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם תֵּן טַל וּמָטָר לִבְרָכָה בְּעִתּוֹ בָּאָרֶץ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם תֵּן זֶרַע לַזּוֹרֵעַ וְלֶחֶם לָאוֹכֵל: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם תֵּן לֶחֶם לְפִי הַטָּף לָשׂבַע: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם תִּכּוֹן תְּפִלָּתֵנוּ קְטֹרֶת לְפָנֶיךָ: \n\n" +
			"אֱלֹהֵינוּ שֶׁבַּשָּׁמַיִם עֲשֵׂה עִמָּנוּ אוֹת לְטוֹבָה. עֲשֵׂה עִמָּנוּ אוֹת לִישׁוּעָה. עֲשֵׂה עִמָּנוּ אוֹת לְרַחֲמִים. יִרְאוּ שׂוֹנְאֵינוּ וְיֵבוֹשׁוּ. יֶחֱזוּ אוֹיְבֵינוּ וְיִכָּלְמוּ. כִּי אַתָּה יהוה עֲזַרְתָּנוּ וְנִחַמְתָּנוּ: \n\n" +
			"בְּרֹגֶז רַחֵם תִּזְכֹּר. בְּרֹגֶז אַהֲבָה תִּזְכֹּר. בְּרֹגֶז עֲקֵדָה תִּזְכֹּר. בְּרֹגֶז תְּמִימוּת תִּזְכֹּר. הַבֵּט לַבְּרִית וְאַל תָּפֵר בְּרִיתְךָ אִתָּנוּ. עֲנֵנוּ בָעֵת וּבָעוֹנָה הַזֹּאת: \n\n" +
			"(כשאומר \"עננו\" יזהר מאד שלא להדגיש הנו\"ן, שלא ישָמע מלשון עינוי חלילה)(Be careful not to stress the first NUN, so it should not sound like the word for affliction)\n\n" +
			"עֲנֵנוּ אָבִינוּ עֲנֵנוּ. עֲנֵנוּ בּוֹרְאֵנוּ עֲנֵנוּ. עֲנֵנוּ גּוֹאֲלֵנוּ עֲנֵנוּ. עֲנֵנוּ דּוֹרְשֵׁנוּ עֲנֵנוּ. עֲנֵנוּ הוֹד וְהָדָר עֲנֵנוּ. עֲנֵנוּ וָתִיק בְּנֶחָמוֹת עֲנֵנוּ. עֲנֵנוּ זַךְ וְיָשָׁר עֲנֵנוּ. עֲנֵנוּ חַי וְקַיָּם עֲנֵנוּ. עֲנֵנוּ טְהוֹר עֵינַיִם עֲנֵנוּ. עֲנֵנוּ יוֹשֵׁב שָׁמַיִם עֲנֵנוּ. עֲנֵנוּ כַּבִּיר כֹּחַ עֲנֵנוּ. עֲנֵנוּ לֹא אֵל חָפֵץ בְּרֶשַׁע עֲנֵנוּ. עֲנֵנוּ מֶלֶךְ מַלְכֵי הַמְּלָכִים עֲנֵנוּ. עֲנֵנוּ נוֹרָא וְנִשְׂגָּב עֲנֵנוּ. עֲנֵנוּ סוֹמֵךְ נוֹפְלִים עֲנֵנוּ. עֲנֵנוּ עוֹזֵר דַּלִּים עֲנֵנוּ. עֲנֵנוּ פּוֹדֶה וּמַצִּיל עֲנֵנוּ. עֲנֵנוּ צַדִּיק וּמַצְדִּיק עֲנֵנוּ. עֲנֵנוּ קָרוֹב לְכָל קוֹרְאָיו בֶּאֱמֶת עֲנֵנוּ. עֲנֵנוּ רָם וְנִשָֹּא עֲנֵנוּ. עֲנֵנוּ שׁוֹכֵן שְׁחָקִים עֲנֵנוּ. עֲנֵנוּ תּוֹמֵךְ תְּמִימִים עֲנֵנוּ: \n\n" +
			"עֲנֵנוּ אֱלֹהֵי אַבְרָהָם עֲנֵנוּ: עֲנֵנוּ וּפַחַד יִצְחָק עֲנֵנוּ: עֲנֵנוּ אֲבִיר יַעֲקֹב עֲנֵנוּ: עֲנֵנוּ מָגֵן דָּוִד עֲנֵנוּ: עֲנֵנוּ הָעוֹנֶה בְּעֵת רָצוֹן עֲנֵנוּ: עֲנֵנוּ הָעוֹנֶה בְּעֵת צָרָה עֲנֵנוּ: עֲנֵנוּ הָעוֹנֶה בְּעֵת רַחֲמִים עֲנֵנוּ: עֲנֵנוּ אֱלֹהֵי הַמֶּרְכָּבָה עֲנֵנוּ: עֲנֵנוּ אֱלָהָא דְמֵאִיר עֲנֵנוּ: עֲנֵנוּ בִּזְכוּתֵהּ דְבַר־יוֹחַאי עֲנֵנוּ: עֲנֵנוּ רַחוּם וְחַנּוּן עֲנֵנוּ: \n\n" +
			"רַחוּם וְחַנּוּן חָטָאנוּ לְפָנֶיךָ רַחֵם עָלֵינוּ: \n\n" +
			"אֲדוֹן הַסְּלִיחוֹת. בּוֹחֵן לְבָבוֹת. גּוֹלֶה עֲמוּקוֹת. דּוֹבֵר צְדָקוֹת. חָטָאנוּ לְפָנֶיךָ רַחֵם עָלֵינוּ: הָדוּר בְּנִפְלָאוֹת. וָתִיק בְּנֶחָמוֹת. זוֹכֵר בְּרִית אָבוֹת. חוֹקֵר כְּלָיוֹת: חָטָאנוּ לְפָנֶיךָ רַחֵם עָלֵינוּ: טוֹב וּמֵטִיב לַבְּרִיּוֹת. יוֹדֵעַ כָּל נִסְתָּרוֹת. כּוֹבֵשׁ עֲוֹנוֹת. לוֹבֵשׁ צְדָקוֹת: חָטָאנוּ לְפָנֶיךָ רַחֵם עָלֵינוּ: מָלֵא זַכִּיּוּת. נוֹרָא תְהִלּוֹת. סוֹלֵחַ עֲוֹנוֹת. עוֹנֶה בְּעֵת צָרוֹת: חָטָאנוּ לְפָנֶיךָ רַחֵם עָלֵינוּ: פּוֹעֵל יְשׁוּעוֹת. צוֹפֶה עֲתִידוֹת. קוֹרֵא הַדּוֹרוֹת. רוֹכֵב עֲרָבוֹת. שׁוֹמֵעַ תְּפִלּוֹת. תְּמִים דֵּעוֹת: חָטָאנוּ לְפָנֶיךָ רַחֵם עָלֵינוּ: אֵל רַחוּם שִׁמְךָ. אֵל חַנּוּן שִׁמְךָ. אֵל אֶרֶךְ אַפַּיִם שִׁמְךָ. מָלֵא רַחֲמִים שִׁמְךָ. בָּנוּ נִקְרָא שִׁמְךָ. יהוה עֲשֵׂה לְמַעַן שְׁמֶךָ:");

		if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()) {
			addToSiddurHighlighted(
				"אֵל רַחוּם שְׁמָךְ. אֵל חַנּוּן שְׁמָךְ. רְאֵה בָּעֳנִי עַמָּךְ. רַחֵם עַל עוֹלָמָךְ: \n\n" +
				"אֵל אַדִּיר שְׁמָךְ. אֵל בָּרוּךְ שְׁמָךְ. אֵל גָּדוֹל שְׁמָךְ. אֵל דָּגוּל שְׁמָךְ: רְאֵה בָּעֳנִי עַמָּךְ. רַחֵם עַל עוֹלָמָךְ: \n\n" +
				"אֵל הָדוּר שְׁמָךְ. אֵל וָתִיק שְׁמָךְ. אֵל זַכָּאי שְׁמָךְ. אֵל חוֹנֵן שְׁמָךְ: רְאֵה בָּעֳנִי עַמָּךְ. רַחֵם עַל עוֹלָמָךְ: \n\n" +
				"אֵל טָהוֹר שְׁמָךְ. אֵל יָחִיד שְׁמָךְ. אֵל כַּבִּיר שְׁמָךְ. אֵל לָעַד שְׁמָךְ: רְאֵה בָּעֳנִי עַמָּךְ. רַחֵם עַל עוֹלָמָךְ: \n\n" +
				"אֵל מֶלֶךְ שְׁמָךְ. אֵל נוֹרָא שְׁמָךְ. אֵל סוֹמֵךְ שְׁמָךְ. אֵל עוֹזֵר שְׁמָךְ: רְאֵה בָּעֳנִי עַמָּךְ. רַחֵם עַל עוֹלָמָךְ: \n\n" +
				"אֵל פּוֹדֶה שְׁמָךְ. אֵל צַדִּיק שְׁמָךְ. אֵל קָדוֹשׁ שְׁמָךְ. אֵל רַחְמָן שְׁמָךְ: רְאֵה בָּעֳנִי עַמָּךְ. רַחֵם עַל עוֹלָמָךְ: \n\n" +
				"אֵל שַׁדַּי שְׁמָךְ. אֵל שׁוֹמֵר שְׁמָךְ. אֵל תּוֹמֵךְ שְׁמָךְ. אֵל תָּמִים שְׁמָךְ: רְאֵה בָּעֳנִי עַמָּךְ. רַחֵם עַל עוֹלָמָךְ: \n\n" +
				"(בעשרת ימי תשובה אומרים:)\n\n" +
				"יֶהֶוֶהֶ חָנֵּנוּ וַהֲקִימֵנוּ, וּבְסֵפֶר חַיִּים זָכְרֵנוּ וְכָתְבֵנוּ: \n\n" +
				"יְהְוְהְ בְּיוֹם יְשׁוּעָתָה בַּשְׂרֵנוּ וְרַחֲמֵנוּ, וּבְסֵפֶר חַיִּים זָכְרֵנוּ וְכָתְבֵנוּ: \n\n" +
				"יֹהֹוֹהֹ גַּלְגֵּל הֲמוֹן רַחֲמֶיךָ עָלֵינוּ, וּבְסֵפֶר חַיִּים זָכְרֵנוּ וְכָתְבֵנוּ: \n\n" +
				"יִהִוִהִ יֶהֱמוּ נָא רַחֲמֶיךָ עָלֵינוּ, וּבְסֵפֶר חַיִּים זָכְרֵנוּ וְכָתְבֵנוּ: \n\n" +
				"יֻהֻוֻהֻ כַּחוֹתָם עַל לֵב הַיּוֹם שִׂימֵנוּ, וּבְסֵפֶר חַיִּים זָכְרֵנוּ וְכָתְבֵנוּ: \n\n" +
				"יוּהוּווּהוּ רִיבָה רִיבֵנוּ וּלְחַם לוֹחֲמֵינוּ, וּבְסֵפֶר חַיִּים זָכְרֵנוּ וְכָתְבֵנוּ: \n\n" +
				"יהוה בָּרֵךְ אֶת לַחְמֵנוּ וְאֶת מֵימֵינוּ, וּבְסֵפֶר חַיִּים זָכְרֵנוּ וְכָתְבֵנוּ:");
		}

		addToSiddur(
			"יהוה עֲשֵׂה לְמַעַן שְׁמֶךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּךָ: \n\n" +
			"יהוה עֲשֵׂה לְמַעַן אַבְרָהָם אֶזְרָח תְּמִימֶךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּךָ: \n\n" +
			"יהוה עֲשֵׂה לְמַעַן יִצְחָק נֶעֱקַד בְּאוּלַמֶּךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּךָ: \n\n" +
			"יהוה עֲשֵׂה לְמַעַן יַעֲקֹב נֶעֱנָה בְסֻלָּם מִמְּרוֹמֶיךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּךָ: \n\n" +
			"יהוה עֲשֵׂה לְמַעַן מֹשֶׁה נֶאֱמָן בְּכָל בֵּיתֶךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּךָ: \n\n" +
			"יהוה עֲשֵׂה לְמַעַן אַהֲרֹן כִּהֵן בְּאוּרֶיךָ וְתֻמֶּיךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּךָ: \n\n" +
			"יהוה עֲשֵׂה לְמַעַן זְכוּת יוֹסֵף אָסִיר צַדִּיקֶךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּךָ: \n\n" +
			"יהוה עֲשֵׂה לְמַעַן דָּוִד נְעִים זְמִירוֹתֶיךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּךָ: \n\n" +
			"יהוה עֲשֵׂה לְמַעַן פִּינְחָס זַךְ קִנֵּא לִשְׁמֶךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּךָ: \n\n" +
			"יהוה עֲשֵׂה לְמַעַן מֶלֶךְ שְׁלֹמֹה בָּנָה בַּיִת לִשְׁמֶךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּךָ: \n\n" +
			"יהוה עֲשֵׂה לְמַעַן הֲרוּגִים וּשְׂרוּפִים עַל יִחוּד קְדֻשַּׁת שְׁמֶךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּךָ: \n\n" +
			"יהוה עֲשֵׂה לְמַעַן שְׁמֶךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּךָ: \n\n" +
			"עֲשֵׂה לְמַעַן שְׁמָךְ. עֲשֵׂה לְמַעַן אֲמִתָּךְ. עֲשֵׂה לְמַעַן בְּרִיתָךְ. עֲשֵׂה לְמַעַן גָּדְלָךְ. עֲשֵׂה לְמַעַן דָּתָךְ. עֲשֵׂה לְמַעַן הֲדָרָךְ. עֲשֵׂה לְמַעַן וִיעוּדָךְ. עֲשֵׂה לְמַעַן זִכְרָךְ. עֲשֵׂה לְמַעַן חַסְדָּךְ. עֲשֵׂה לְמַעַן טוּבָךְ. עֲשֵׂה לְמַעַן יָשְׁרָךְ. עֲשֵׂה לְמַעַן כְּבוֹדָךְ. עֲשֵׂה לְמַעַן לִמּוּדָךְ. עֲשֵׂה לְמַעַן מַלְכוּתָךְ. עֲשֵׂה לְמַעַן נִצְחָךְ. עֲשֵׂה לְמַעַן סוֹדָךְ. עֲשֵׂה לְמַעַן עֻזָּךְ. עֲשֵׂה לְמַעַן פְּאֵרָךְ. עֲשֵׂה לְמַעַן צִדְקָתָךְ. עֲשֵׂה לְמַעַן קְדֻשָּׁתָךְ. עֲשֵׂה לְמַעַן רַחֲמָנוּתָךְ. עֲשֵׂה לְמַעַן שְׁכִינָתָךְ. עֲשֵׂה לְמַעַן תּוֹרָתָךְ: \n\n" +
			"עֲשֵׂה לְמַעַן אַבְרָהָם יִצְחָק וְיַעֲקֹב. עֲשֵׂה לְמַעַן מֹשֶׁה וְאַהֲרֹן. עֲשֵׂה לְמַעַן יוֹסֵף דָּוִד וּשְׁלֹמֹה. עֲשֵׂה לְמַעַן יְרוּשָׁלַיִם עִיר הַקֹּדֶשׁ. עֲשֵׂה לְמַעַן צִיּוֹן מִשְׁכַּן כְּבוֹדָךְ. עֲשֵׂה לְמַעַן חָרְבַּן בֵּיתָךְ. עֲשֵׂה לְמַעַן שִׁמֲמוּת הֵיכָלָךְ. עֲשֵׂה לְמַעַן יִשְׂרָאֵל הָעֲנִיִּים. עֲשֵׂה לְמַעַן יִשְׂרָאֵל הַדַּלִּים. עֲשֵׂה לְמַעַן יִשְׂרָאֵל הַשְּׁרוּיִים בְּצָרוֹת. עֲשֵׂה לְמַעַן יְתוֹמִים וְאַלְמָנוֹת. עֲשֵׂה לְמַעַן יוֹנְקֵי שָׁדַיִם. עֲשֵׂה לְמַעַן גְּמוּלֵי חָלָב. עֲשֵׂה לְמַעַן תִּינוֹקוֹת שֶׁל בֵּית רַבָּן שֶׁלֹּא חָטְאוּ: \n\n" +
			"עֲשֵׂה לְמַעֲנָךְ אִם לֹא לְמַעֲנֵנוּ. עֲשֵׂה לְמַעֲנָךְ וְהוֹשִׁיעֵנוּ. הוֹשִׁיעֵנוּ וַעֲנֵנוּ הַיּוֹם וּבְכָל יוֹם וָיוֹם בִּתְפִלָּתֵנוּ כִּי תְהִלָּתֵנוּ אָתָּה: \n\n" +
			"דְּעָנֵי לַעֲנִיֵּי. עֲנֵינָן: דְּעָנֵי לַעֲשִׁיקֵי. עֲנֵינָן: דְּעָנֵי לִתְבִירֵי לִבָּא. עֲנֵינָן: דְּעָנֵי לְשִׁפְלֵי דַעְתָּא. עֲנֵינָן: דְּעָנֵי לְמַכִּיכֵי רוּחָא. עֲנֵינָן: דְּעָנֵי לְאַבְרָהָם אָבִינוּ בְּהַר הַמּוֹרִיָּה. עֲנֵינָן: דְּעָנֵי לְיִצְחָק עַל גַּבֵּי מַדְבְּחָא. עֲנֵינָן: דְּעָנֵי לְיַעֲקֹב בְּבֵית אֵל. עֲנֵינָן: דְּעָנֵי לְיוֹסֵף בְּבֵית אֲסִירֵי. עֲנֵינָן: דְּעָנֵי לְמֹשֶׁה וַאֲבוֹתֵינוּ עַל יַם סוּף. עֲנֵינָן: דְּעָנֵי לְאַהֲרֹן בַּמַּחְתָּא. עֲנֵינָן: דְּעָנֵי לְפִינְחָס בַּשִּׁטִּים. עֲנֵינָן: דְּעָנֵי לִיהוֹשֻׁעַ בַּגִּלְגָּל. עֲנֵינָן: דְּעָנֵי לְעֵלִי בָּרָמָה. עֲנֵינָן: דְּעָנֵי לִשְׁמוּאֵל בַּמִּצְפָּה. עֲנֵינָן: דְּעָנֵי לְדָוִד וְלִשְׁלֹמֹה בְּנוֹ בִּירוּשָׁלַיִם. עֲנֵינָן: דְּעָנֵי לְאֵלִיָּהוּ בְּהַר הַכַּרְמֶל. עֲנֵינָן: דְּעָנֵי לֶאֱלִישָׁע בִּירִיחוֹ. עֲנֵינָן: דְּעָנֵי לְחִזְקִיָּהוּ בַּחֲלוֹתוֹ. עֲנֵינָן: דְּעָנֵי לְיוֹנָה בִּמְעֵי הַדָּגָה. עֲנֵינָן: דְּעָנֵי לַחֲנַנְיָה מִישָׁאֵל וַעֲזַרְיָה בְּגוֹ אַתּוּן נוּרָא יָקִדְתָּא. עֲנֵינָן: דְּעָנֵי לְדָנִיֵּאל בְּגֻבָּא דְאַרְיָוָתָא. עֲנֵינָן: דְּעָנֵי לְמָרְדְּכַי וְאֶסְתֵּר בְּשׁוּשַׁן הַבִּירָה. עֲנֵינָן: דְּעָנֵי לְעֶזְרָא בַּגּוֹלָה. עֲנֵינָן: דְּעָנֵי לְחוֹנִי בַּמַּעְגָּל. עֲנֵינָן: דְּעָנֵי לְצַדִּיקֵי וַחֲסִידֵי וּתְמִימֵי דִּי בְּכָל דָּר וְדָר. עֲנֵינָן: רַחֲמָנָא עֲנֵינָן. רַחֲמָנָא שְׁזִיב. רַחֲמָנָא פְּרֹק. רַחֲמָנָא דְּיִתְמְלֵי רַחֲמִין רַחֵם עָלָנָא וְעַל כָּל אַנְשֵׁי בֵיתָנָא. וְעַל כָּל יִשְׂרָאֵל אָחָנָא. וּמֵחֲשׁוֹכָא לִנְהוֹרָא אַפְּקִנָּן בְּדִיל שְׁמָךְ רַבָּא:");

		if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()) {
			addToSiddurHighlighted(
				"יָהּ שְׁמַע אֶבְיוֹנֶיךָ. הַמְחַלִּים פָּנֶיךָ. אָבִינוּ לְבָנֶיךָ. אַל תַּעְלֵם אָזְנֶיךָ. \n\n" +
				"יָהּ עַם מִמַּעֲמַקִּים. יִקְרְאוּ מֵרֹב מְצוּקִים. אַל נָא תְשִׁיבֵם רֵקִים. הַיּוֹם מִלְּפָנֶיךָ: \n\n" +
				"הַוּוֹתָם וַעֲוֹנָם. מְחֵה וְרֻבֵּי זְדוֹנָם. וְאִם לֹא תַעֲשֶׂה לְמַעֲנָם. עֲשֵׂה צוּרִי לְמַעֲנֶךָ: \n\n" +
				"וּמְחֵה הַיּוֹם חוֹבָם. וּרְצֵה כְּמוֹ שַׁי נִיבָם. וּלְךָ תָּכִין לִבָּם. וְגַם תַּקְשִׁיב אָזְנֶךָ: \n\n" +
				"דִּמְעַת פְּנֵיהֶם תִּשְׁעֶה. וְתֶאֱסֹף עֵדֶר תּוֹעֶה. וְתָקִים לְךָ רוֹעֶה. וּפְקֹד בְּטוֹב צֹאנֶךָ: \n\n" +
				"הוֹלְכֵי בְּדֶרֶךְ נְכוֹחָה. תְּבַשְֹּרֵם הַיּוֹם סְלִיחָה. וּבִתְפִלַּת הַשַּׁחַר. הַמְצִיאֵם חִנֶּךָ:");
		}

		addToSiddur(
			"(יש אומרים:) (Some say)\n\n" +
			"אִם אָפֵס רֹבַע הַקֵּן. אֹהֶל שִׁכֵּן אִם רִקֵּן. אַל נָא נֹאבְדָה כִּי עַל כֵּן. יֵשׁ לָנוּ אָב זָקֵן: פָּנִים לוֹ תַכִּיר. וְצִדְקוֹ לְפָנֶיךָ נַזְכִּיר. קַח נָא בֵּן יַקִּיר. וְנִמְצָה דָמוֹ עַל קִיר: רָץ אֶל הַנַּעַר לְהַקְדִּישׁוֹ. וְנַפְשׁוֹ קְשׁוּרָה בְּנַפְשׁוֹ. עִטְּרוֹ בָּעֵצִים וְאִשּׁוֹ. נֵזֶר אֱלֹהָיו עַל רֹאשׁוֹ: יָחִיד הוּקַל כַּצְּבִי. עָנָה וְאָמַר אָבִי. הִנֵּה הָאֵשׁ וְהָעֵצִים נָבִיא. וּתְשׁוּרָה אֵין לְהָבִיא: מִלִּים הֱשִׁיבוֹ מִלְּהַבְהִילוֹ. וַיַּעַן וַיֹּאמֶר לוֹ. בְּנִי, אֱלֹהִים יִרְאֶה לוֹ. וְיוֹדַע יהוה אֶת אֲשֶׁר לוֹ: בְּמִצְוָתְךָ שְׁנֵיהֶם נִזְהָרִים. וְאַחֲרֶיךָ לֹא מְהַרְהְרִים. חָשׁוּ וְהָלְכוּ נִמְהָרִים. עַל אַחַד הֶהָרִים: רָאוּ אֵד תְּלוּלָה. מִהֲרוּ עֲצֵי עוֹלָה. יַחַד בְּאַהֲבָה כְּלוּלָה. יַשְּׁרוּ בָּעֲרָבָה מְסִלָּה: רָאָה יָחִיד כִּי הוּא הַשֶֹּה. נָאַם לְהוֹרוֹ הַמְּנֻסֶּה. אָבִי אוֹתִי כַּכֶּבֶשׂ תַּעֲשֶׂה. לֹא תַחְמֹל וְלֹא תְכַסֶּה: בִּי חָפֵץ וְנִכְסֹף. לְבָבִי לוֹ לַחֲשֹׂף. אִם תִּמְנָעֵנִי סוֹף. רוּחִי וְנִשְׁמָתִי אֵלָיו יֶאֱסֹף: יָדָיו וְרַגְלָיו עָקַד. וְחַרְבּוֹ עָלָיו פָּקַד. לְשׂוּמוֹ עַל הָעֵצִים שָׁקַד. וְהָאֵשׁ עַל הַמִּזְבֵּחַ תּוּקַד: צַוָּאר פָּשַׁט מֵאֵלָיו. וְאָבִיו נִגַּשׁ אֵלָיו. לְשֹׁחֲטוֹ לְשֵׁם בְּעָלָיו. וְהִנֵּה יהוה נִצָּב עָלָיו: חֲקֹר אֶת כָּל אֲשֶׁר עָשָׂה. הָאָב עַל בְּנוֹ לֹא חָסָה. וְלִבּוֹ אֶל כַּפַּיִם נָשָׂא. וַיַּרְא אֱלֹהִים אֶת כָּל אֲשֶׁר עָשָׂה: קָרָא מֵרֶחֶם מִשְׁחָר. תְּמוּר בִּנְךָ הַנִּבְחָר. וְהִנֵּה אַיִל אַחַר. וַעֲשֵׂה אַל תְּאַחַר: חֲלִיפֵי אַזְכָּרָתוֹ. תִּכּוֹן כְּהַקְטָרָתוֹ. וְתַעֲלֶה לְךָ תִּימְרָתוֹ. וְהָיָה הוּא וּתְמוּרָתוֹ: \n\n" +
			"זִכָּרוֹן לְפָנֶיךָ בַּשַּׁחַק. לָעַד בַּסֵּפֶר יוּחַק. בְּרִית עוֹלָם בַּל יֻמְחַק. אֶת אַבְרָהָם וְאֶת יִצְחָק: קוֹרְאֶיךָ בָּאִים לָקוֹד. בְּצָרָה עֲקֵדָה תִּשְׁקֹד. וְצֹאנְךָ בְּרַחֲמִים תִּפְקֹד. פְּנֵי הַצֹּאן אֶל עָקוֹד: עוֹרְרָה רַחֲמֶיךָ לְהָקִיץ נִרְדָּמִים. לְמַעַנְךָ תִּפְדֶּה חֲרֵדִים נִדְהָמִים. לְהַמְשִׁיךְ רַחֲמֶיךָ וַחֲסָדֶיךָ מִשְּׁמֵי מְרוֹמִים. אֵל מֶלֶךְ יוֹשֵׁב עַל כִּסֵּא רַחֲמִים: \n\n" +
			"אֵל מֶלֶךְ יוֹשֵׁב עַל כִּסֵּא רַחֲמִים וּמִתְנַהֵג בַּחֲסִידוּת. מוֹחֵל עֲוֹנוֹת עַמּוֹ מַעֲבִיר רִאשׁוֹן רִאשׁוֹן. מַרְבֶּה מְחִילָה לַחַטָּאִים. וּסְלִיחָה לַפּוֹשְׁעִים. עוֹשֶׂה צְדָקוֹת עִם כָּל בָּשָׂר וְרוּחַ. לֹא כְרָעָתָם לָהֶם גּוֹמֵל. אֵל הוֹרֵתָנוּ לוֹמַר מִדּוֹת שְׁלֹשׁ עֶשְׂרֵה. זְכֹר לָנוּ הַיּוֹם בְּרִית שְׁלֹשׁ עֶשְׂרֵה. כְּמוֹ שֶׁהוֹדַעְתָּ לֶעָנָו מִקֶּדֶם. וְכֵן כָּתוּב בְּתוֹרָתָךְ. וַיֵּרֶד יהוה בֶּעָנָן וַיִּתְיַצֵּב עִמּוֹ שָׁם. וַיִּקְרָא בְשֵׁם, יהוה. וְשָׁם נֶאֱמַר: \n\n" +
			vayavor +
			" וְסָלַחְתָּ לַעֲוֹנֵנוּ וּלְחַטָּאתֵנוּ וּנְחַלְתָּנוּ:" + "\n\n" +
			"יש נוהגים לומר/Some have the minhag to say: \n\n" +
			"בְּזָכְרִי עַל מִשְׁכָּבִי, זְדוֹן לִבִּי וַאֲשָׁמָיו. אָקוּמָה וְאָבוֹאָה, אֶל בֵּית אֱלֹהַי וַהֲדוֹמָיו. וָאֹמַר בְּנָשְׂאִי עַיִן, בְּתַחֲנוּנַי אֱלֵי שָׁמָיו. נִפְּלָה נָּא בְּיַד יהוה כִּי רַבִּים רַחֲמָיו: \n\n" +
			"לְךָ אֵלִי צוּר חֵילִי, מְנוּסָתִי בְּצָרָתִי. בְּךָ שִׂבְרִי וְתִקְוָתִי, אֱיָלוּתִי בְּגָלוּתִי. לְךָ כָּל מִשְׁאֲלוֹת לִבִּי, וְנֶגְדְּךָ כָּל תַּאֲוָתִי. פְּדֵה עֶבֶד לְךָ צוֹעֵק, מִיַּד רוֹדָיו וְקָמָיו: נִפְּלָה נָּא בְּיַד יהוה כִּי רַבִּים רַחֲמָיו: \n\n" +
			"עֲנֵנִי יהוה עֲנֵנִי, בְּקָרְאִי מִן הַמֵּצַר. וְיִוָּדַע בָּעַמִּים, כִּי יָדְךָ לֹא תִקְצַר. וְאַל תִּבְזֶה עֱנוּת עָנִי, צוֹעֵק מִתִּגְרַת צַר. אֲשֶׁר פְּשָׁעָיו לְךָ מוֹדֶה, וּמִתְוַדֶּה עַל עֲלוּמָיו: נִפְּלָה נָּא בְּיַד יהוה כִּי רַבִּים רַחֲמָיו: \n\n" +
			"מַה יִּתְאוֹנֵן וְיֹאמַר, מַה יְּדַבֵּר וְיִצְטַדָּק. יְצִיר חֹמֶר אֲשֶׁר תָּשׁוּב, גְּוִיָּתוֹ כְּאָבָק דַּק. מַה יִּתֵּן לְךָ הָאָדָם, כִּי יִרְשַׁע וְכִי יִצְדַּק. הֲלֹא מִלָּיו וּמִפְעָלָיו, כְּתוּבִים בְּסֵפֶר יָמָיו: נִפְּלָה נָּא בְּיַד יהוה כִּי רַבִּים רַחֲמָיו: \n\n" +
			"חֲצוֹת (נ\"א בְּעוֹד) לַיְלָה לְךָ קָמוּ, עֲבָדֶיךָ בְּמַהֲלָלָם. זְכוּת אָבוֹת לָהֶם תִּזְכֹּר, וְאַל תֵּפֶן לְמַעֲלָלָם. קְנֵה עֲדָתְךָ כִּימֵי קֶדֶם, קְדוֹשׁ יַעֲקֹב גֹּאֲלָם. וְהִנָּשֵׂא הָאֵל, עוֹשֶׂה הַשָּׁלוֹם בִּמְרוֹמָיו: נִפְּלָה נָּא בְּיַד יהוה כִּי רַבִּים רַחֲמָיו: \n\n" +
			"רַחוּם וְחַנּוּן חָטָאנוּ לְפָנֶיךָ רַחֵם עָלֵינוּ וְהוֹשִׁיעֵנוּ: \n\n" +
			"לְדָוִ֡ד אֵלֶ֥יךָ יְ֝הֹוָ֗ה נַפְשִׁ֥י אֶשָּֽׂא׃ אֱֽלֹהַ֗י בְּךָ֣ בָ֭טַחְתִּי אַל־אֵב֑וֹשָׁה אַל־יַעַלְצ֖וּ אוֹיְבַ֣י לִֽי׃ גַּ֣ם כָּל־קֹ֭וֶיךָ לֹ֣א יֵבֹ֑שׁוּ יֵ֝בֹ֗שׁוּ הַבּוֹגְדִ֥ים רֵיקָֽם׃ דְּרָכֶ֣יךָ יְ֭הֹוָה הוֹדִיעֵ֑נִי אֹ֖רְחוֹתֶ֣יךָ לַמְּדֵֽנִי׃ הַדְרִ֘יכֵ֤נִי בַאֲמִתֶּ֨ךָ ׀ וְֽלַמְּדֵ֗נִי כִּֽי־אַ֭תָּה אֱלֹהֵ֣י יִשְׁעִ֑י אוֹתְךָ֥ קִ֝וִּ֗יתִי כׇּל־הַיּֽוֹם׃ זְכֹר־רַחֲמֶ֣יךָ יְ֭הֹוָה וַחֲסָדֶ֑יךָ כִּ֖י מֵעוֹלָ֣ם הֵֽמָּה׃ חַטֹּ֤אות נְעוּרַ֨י ׀ וּפְשָׁעַ֗י אַל־תִּ֫זְכֹּ֥ר כְּחַסְדְּךָ֥ זְכׇר־לִי־אַ֑תָּה לְמַ֖עַן טוּבְךָ֣ יְהֹוָֽה׃ טוֹב־וְיָשָׁ֥ר יְהֹוָ֑ה עַל־כֵּ֤ן יוֹרֶ֖ה חַטָּאִ֣ים בַּדָּֽרֶךְ׃ יַדְרֵ֣ךְ עֲ֭נָוִים בַּמִּשְׁפָּ֑ט וִילַמֵּ֖ד עֲנָוִ֣ים דַּרְכּֽוֹ׃ כׇּל־אׇרְח֣וֹת יְ֭הֹוָה חֶ֣סֶד וֶאֱמֶ֑ת לְנֹצְרֵ֥י בְ֝רִית֗וֹ וְעֵדֹתָֽיו׃ לְמַֽעַן־שִׁמְךָ֥ יְהֹוָ֑ה וְֽסָלַחְתָּ֥ לַ֝עֲוֺנִ֗י כִּ֣י רַב־הֽוּא׃ מִי־זֶ֣ה הָ֭אִישׁ יְרֵ֣א יְהֹוָ֑ה י֝וֹרֶ֗נּוּ בְּדֶ֣רֶךְ יִבְחָֽר׃ נַ֭פְשׁוֹ בְּט֣וֹב תָּלִ֑ין וְ֝זַרְע֗וֹ יִ֣ירַשׁ אָֽרֶץ׃ ס֣וֹד יְ֭הֹוָה לִירֵאָ֑יו וּ֝בְרִית֗וֹ לְהוֹדִיעָֽם׃ עֵינַ֣י תָּ֭מִיד אֶל־יְהֹוָ֑ה כִּ֤י הֽוּא־יוֹצִ֖יא מֵרֶ֣שֶׁת רַגְלָֽי׃ פְּנֵה־אֵלַ֥י וְחׇנֵּ֑נִי כִּֽי־יָחִ֖יד וְעָנִ֣י אָֽנִי׃ צָר֣וֹת לְבָבִ֣י הִרְחִ֑יבוּ מִ֝מְּצוּקוֹתַ֗י הוֹצִיאֵֽנִי׃ רְאֵ֣ה עׇ֭נְיִי וַעֲמָלִ֑י וְ֝שָׂ֗א לְכׇל־חַטֹּאותָֽי׃ רְאֵֽה־אֹיְבַ֥י כִּי־רָ֑בּוּ וְשִׂנְאַ֖ת חָמָ֣ס שְׂנֵאֽוּנִי׃ שׇׁמְרָ֣ה נַ֭פְשִׁי וְהַצִּילֵ֑נִי אַל־אֵ֝ב֗וֹשׁ כִּֽי־חָסִ֥יתִי בָֽךְ׃ תֹּם־וָיֹ֥שֶׁר יִצְּר֑וּנִי כִּ֝֗י קִוִּיתִֽיךָ׃ פְּדֵ֣ה אֱ֭לֹהִים אֶת־יִשְׂרָאֵ֑ל מִ֝כֹּ֗ל צָרוֹתָֽיו׃ יְהֹוָה אֱלֹהֵי יִשְׂרָאֵל שׁוּב מֵחֲרוֹן אַפֶּךָ. וְהִנָּחֵם עַל הָרָעָה לְעַמֶּךָ: \n\n" +
			"שׁוּב מֵחֲרוֹן אַפֶּךָ, וְהִנָּחֵם עַל הָרָעָה לְעַמֶּךָ:" +
			" אַל תִּקְצֹף יְהֹוָה עַד מְאֹד וְאַל לָעַד תִּזְכֹּר עָוֹן. הֵן הַבֶּט נָא עַמְּךָ כֻלָּנוּ:" +
			" אַל תִּנְאַץ לְמַעַן שִׁמְךָ. אַל תְּנַבֵּל כִּסֵּא כְבוֹדֶךָ. זְכֹר אַל תָּפֵר בְּרִיתְךָ אִתָּנוּ:" +
			" אִם עֲוֹנֵינוּ עָנוּ בָנוּ. יְהֹוָה עֲשֵׂה לְמַעַן שְׁמֶךָ. כִּי רַבּוּ מְשׁוּבֹתֵינוּ לְךָ חָטָאנוּ. אָדוֹן סְלַח לָנוּ:\n\n" +
			"אָתָאנוּ לְחַלּוֹת פָּנֶיךָ. כִּי חֶסֶד וֶאֱמֶת יְקַדְּמוּ פָנֶיךָ. נָא אַל תְּבִישֵׁנוּ. נָא אַל תְּשִׁיבֵנוּ רֵיקָם מִלְּפָנֶיךָ. סְלַח לָנוּ. וּשְׁלַח לָנוּ. יְשׁוּעָה וְרַחֲמִים מִמְּעוֹנֶךָ: \n\n" +
			"אָתָאנוּ לְבַקֵּשׁ מִמְּךָ כַּפָּרָה. אָיֹם וְנוֹרָא. מִשְׂגָּב לְעִתּוֹת בַּצָּרָה. תְּחַיֵּינוּ. תְּחָנֵּנוּ. וּבְשִׁמְךָ נִקְרָא. סְלַח לָנוּ. וּשְׁלַח לָנוּ. יְשׁוּעָה וְרַחֲמִים מִמְּעוֹנֶךָ: \n\n" +
			"מָרָנָא דְבִשְׁמַיָּא. לָךְ מִתְחַנְּנָן כְּעַבְדָּא דְּמִתְחַנֵּן לְמָארֵהּ. הַב לָן לִבָּא לְתִיּוּבְתָּא. וְלָא נֶהְדַּר רֵיקָם מִן קַמָּךְ: מָרָנָא דְבִשְׁמַיָּא. לָךְ מִתְחַנְּנָן כְּבַר שִׁבְיָא דְמִתְחַנֵּן לְמָארֵהּ. כֻּלְּהוֹן בְּנֵי שִׁבְיָא בְּכַסְפָּא מִתְפָּרְקִין. וְעַמָּךְ בֵּית יִשְׂרָאֵל בִּצְלוֹתִין וּבְתַחֲנוּנִין. אָרֵם יְמִינָךְ וְאַצְמַח פֻּרְקָנָךְ. סִבְרָא דְחַיָּיָא וּמֵתַיָּא: מִתְרַצֶּה בְּרַחֲמִים. וּמִתְפַּיֵּס בְּתַחֲנוּנִים. הִתְרַצֵּה וְהִתְפַּיֵּס. לְעַם עָנִי וּמְדֻלְדָּל. פְּרוֹקָנָא דְמֵעָלְמָא מְשֵׁזְבָנָא דְּמִלְּקַדְמִין. פְּרֹק יַעֲקֹב מֵאַרְעָא רְחִיקָא. וְאַסִּיק זַרְעֵהּ מֵאַרְעָא דְשִׁבְיָא: \n\n" +
			"מַחֵי וּמַסֵּי. מֵמִית וּמֵחֵי. מַסִּיק מִן שְׁאוֹל לְחַיֵּי עָלְמָא: בְּרָא כַּד חָטֵי. אָבוּהִי לַקְיֵהּ (י״ג: אַלְקְיֵהּ). אָבוּהִי דְחַיִּיס. אַסֵּי לְכֵאבֵהּ: עַבְדָּא דְמָרִיד. וְנָפִיק בְּקוֹלָר. לְמָארֵהּ תָּאִיב. יִתְבַּר קוֹלָרֵהּ. בְּרָךְ בֻּכְרָךְ אֲנָן. וְחַטֵּינָן קַמָּךְ. הָא רַוְיָא נַפְשִׁין. בְּגִדִּין וּמְרָדִין: הָא עַבְדָּךְ אֲנָן. וּמְרַדְּנָן קַמָּךְ. הָא בְּבִזְתָּא וְשִׁבְיָא. וְהָא בְּמַלְקִיּוּתָא: בְּבָעוּ מִנָּךְ. בְּמָטוּ מִנָּךְ. בְּרַחֲמָךְ דִּנְפִישִׁין. אַסֵּי לְכֵאבִין. דְּאִתְּקָפוּ עֲלָן. עַד דְּלָא נֶהֱוֵי. גְּמִירָא בְּשִׁבְיָא: מַחֵי וּמַסֵּי. מֵמִית וּמֵחֵי. מַסִּיק מִן שְׁאוֹל לְחַיֵּי עָלְמָא: \n\n" +
			"רַחֲמִים פְּשׁוּטִים וְחַיִּים טוֹבִים בִּקַּשְׁנוּ וְשָׁאַלְנוּ מִמָּךְ. כִּי רַבִּים רַחֲמִים וּמְקוֹר חַיִּים עִמָּךְ. צְדָקָה וָחֶסֶד עֲשֵׂה עִמָּנוּ לְמַעַן שְׁמֶךָ. אָנָּא יהוה אֱלֹהֵינוּ הָסֵר מִמֶּנּוּ וּמִבָּתֵּינוּ. וּמִבָּתֵּי כָל עַמְּךָ בֵּית יִשְׂרָאֵל בְּכָל מָקוֹם שֶׁהֵם. דֶּבֶר. וְחֶרֶב. וְרָעָה. וְרָעָב. וּשְׁבִי. וּבִזָּה. וּמַשְׁחִית. וּמַגֵּפָה. וְשָׂטָן. וְיֵצֶר הָרָע. וְחוֹלָאִים רָעִים. וְצַר. מֵעַמָּךָ: \n\n" +
			"אֵלֶיךָ יהוה נָשָׂאתִי עֵינַי. שְׁמַע קוֹל תַּחֲנוּנַי. כְּגֹדֶל חַסְדֶּךָ: בְּשִׁמְךָ בָּטַחְתִּי. וְכַפַּי שִׁטַּחְתִּי. דְּבָרִים לָקַחְתִּי. וּבָאתִי עָדֶיךָ: גָּבְרוּ יְגוֹנוֹתַי. וַיִּרְבּוּ אַנְחוֹתַי. כִּי כָל עֲוֹנוֹתַי. שַׁתָּה לְנֶגְדֶּךָ: דָּלְפָה מִתּוּגָה. נַפְשִׁי הָעֲנוּגָה. וְחַלֵּץ מִדְּאָגָה. נֶפֶשׁ עַבְדֶּךָ: הַעֲבֵר חַטָּאתִי. אֱלֹהֵי יְשׁוּעָתִי. וְגַם אֶת דִּמְעָתִי. שִׂימָה בְּנֹאדֶךָ: וּבְרֹגֶז רַחֵם. זָכְרָה וְהִנָּחֵם. וְשַׂמֵּחַ וְנַחֵם. נֶפֶשׁ עַבְדֶּךָ: זְכֹר עָנְיִי וּמְרוּדִי. לַעֲנָה מֵעוֹדִי. עַד מָתַי לְנֶגְדִּי. תְּחַדֵּשׁ עֵדֶיךָ: חֵרְפוּנִי צוֹרְרַי. אוֹיְבַי וְשׁוֹרְרַי. הַקְשֵׁב נָא אֲמָרַי. בְּבֹאִי בְּפַחְדֶּךָ: טָמְנוּ לִי זֵדִים. פַּחִים וּמְצוּדִים. וּבָהֶם נִלְכָּדִים. פַּעֲמֵי יְדִידֶיךָ: יְשִׂימוּן לִי מְצוּדִים. וְשֶׁקֶר בִּי מְעִידִים. בְּעָלוּנִי זֵדִים. צוּר, בִּלְעָדֶיךָ: כְּבוֹדְךָ גַּלֵּה צוּר. לְעַם עָזוּב וְעָצוּר. וְטוּבְךָ הַנָּצוּר. תְּנָה לִשְׂרִידֶיךָ: לְחוּצִים בְּרֹב דֹּחַק. מֵהֶם אַל תִּרְחַק. זְכֹר לְאַבְרָהָם לְיִצְחָק. וּלְיִשְׂרָאֵל עֲבָדֶיךָ: מָרוֹם מִמְּרוֹמִים. רַחֵם עַל עֲגוּמִים. וְעַל זֶרַע רְחוּמִים. יְלִידֵי יְדִידֶיךָ: נוֹאֲקִים בְּבוֹר גָּלוּת. בְּךָ שָׂמוּ אֱיָלוּת. וְהָרֵם מִשִּׁפְלוּת. גֶּזַע חֲסִידֶיךָ: סוֹבְלֵי עֹל תְּצַהֵל. וְאוֹיְבֵיהֶם תְּבַהֵל. וּכְקֶדֶם תְּנַהֵל. דִּגְלֵי גְדוּדֶיךָ: עֲנֵה אֶת עֲתִירָתָם. סְמֹךְ אֶת נְפִילָתָם. וְהָשֵׁב אֶת שְׁבוּתָם. מֵאַפְסֵי חֶלְדֶּךָ: פְּדֵה עַם לְךָ הוֹמֶה. וּכְאִלֵּם דּוֹמֶה. בְּגָלוּת זֶה כַמֶּה. שָׂבְעוּ נְדוּדֶיךָ: צַדִּיק בְּמִפְעָלוֹת. לְךָ נִתְכְּנוּ עֲלִילוֹת. דְּלֵנוּ מִמְּצוּלוֹת. לְמַעַן חֲסָדֶיךָ: קַבֵּץ מְפֻזָּרִים. בְּכַבְלֵי צַר סְגוּרִים. בְּלָעוּם אַכְזָרִים. שָׂרְפוּ מוֹעֲדֶיךָ: רַחוּם הֱיֵה לְמִשְׁעָן. לְעַם רָוֵה לַעַן. וַעֲשֵׂה נָא לְמַעַן. שְׁלֹשֶׁת עֲבָדֶיךָ: שַׁדַּי נִשְׂגַּבְתָּ. בְּכָל אֲשֶׁר פָּעַלְתָּ. כִּי צַדִּיק אַתָּה. וְצֶדֶק מַדֶּיךָ: תְּכַפֵּר עֲוֹנִי כִּי. שִׂבְרִי בְּךָ מַלְכִּי. וְכוֹנֵן אֶת דַּרְכִּי. אֱלֹהַי לְעָבְדֶּךָ: תִּשְׁעֶה לִתְפִלָּתִי. וּלְשִׂיחַ רִנָּתִי. כִּי אַתָּה תִקְוָתִי. וּמִי לֹא יְעִידֶךָ: אֵלֶיךָ יהוה נָשָׂאתִי עֵינַי. שְׁמַע קוֹל תַּחֲנוּנַי. כְּגֹדֶל חַסְדֶּךָ: \n\n" +
			"אָבִינוּ אָב הָרַחֲמָן, הוֹשִׁיעֵנוּ לְמַעַן שְׁמֶךָ: \n\n" +
			"אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, הוֹשִׁיעֵנוּ לְמַעַן שְׁמֶךָ: \n\n" +
			"בַּצָּר לָנוּ קְרָאנוּךָ, וְהוֹשִׁיעֵנוּ לְמַעַן שְׁמֶךָ: \n\n" +
			"גַּלְגֵּל עָלֵינוּ הֲמוֹן רַחֲמֶיךָ, וְהוֹשִׁיעֵנוּ לְמַעַן שְׁמֶךָ: \n\n" +
			"דְּרַשְׁנוּךָ הִמָּצֵא לָנוּ, וְהוֹשִׁיעֵנוּ לְמַעַן שְׁמֶךָ: \n\n" +
			"הֵעָתֵר לָנוּ הַיּוֹם וּבְכָל יוֹם וָיוֹם בִּתְפִלָּתֵנוּ, וְהוֹשִׁיעֵנוּ לְמַעַן שְׁמֶךָ: \n\n" +
			"וְאַל תְּבִישֵׁנוּ מִשִֹּבְרֵנוּ, וְהוֹשִׁיעֵנוּ לְמַעַן שְׁמֶךָ: \n\n" +
			"זָכְרֵנוּ בְּזִכְרוֹן טוֹב מִלְּפָנֶיךָ, וְהוֹשִׁיעֵנוּ לְמַעַן שְׁמֶךָ: \n\n" +
			"חוּס וְרַחֵם עָלֵינוּ, וְהוֹשִׁיעֵנוּ לְמַעַן שְׁמֶךָ: \n\n" +
			"טַהֲרֵנוּ מִטֻּמְאוֹת עֲוֹנֵינוּ, וְהוֹשִׁיעֵנוּ לְמַעַן שְׁמֶךָ: \n\n" +
			"יֶהֱמוּ נָא רַחֲמֶיךָ עָלֵינוּ, וְהוֹשִׁיעֵנוּ לְמַעַן שְׁמֶךָ: \n\n" +
			"חֲמֹל עַל עַמָּךְ. וְרַחֵם עַל נַחֲלָתָךְ. חוּסָה נָּא כְּרֹב רַחֲמֶיךָ. חָנֵּנוּ מַלְכֵּנוּ וַעֲנֵנוּ: \n\n" +
			"(יש מוסיפים/Some add:) \n\n" +
			"אָבִינוּ מַלְכֵּנוּ אָבִינוּ אַתָּה. אָבִינוּ מַלְכֵּנוּ אֵין לָנוּ אֶלָּא אַתָּה. אָבִינוּ מַלְכֵּנוּ רַחֵם עָלֵינוּ: אִם הֵטַבְנוּ פֹעַל. אָבִינוּ אַתָּה. וְאִם הֵרַעְנוּ מַעַל. אֵין לָנוּ אֶלָּא אַתָּה. אָבִינוּ מַלְכֵּנוּ רַחֵם עָלֵינוּ: אִם גָּבַר פִּשְׁעֵנוּ. אָבִינוּ אַתָּה. אַתָּה צוּר יִשְׁעֵנוּ. אֵין לָנוּ אֶלָּא אַתָּה. אָבִינוּ מַלְכֵּנוּ רַחֵם עָלֵינוּ: אִם הִרְבִּינוּ אֹמֶר. אָבִינוּ אַתָּה. זְכֹר כִּי אֲנַחְנוּ חֹמֶר. אֵין לָנוּ אֶלָּא אַתָּה. אָבִינוּ מַלְכֵּנוּ רַחֵם עָלֵינוּ: אִם לְךָ חָטָאנוּ. אָבִינוּ אַתָּה. אָדוֹן סְלַח לָנוּ. אֵין לָנוּ אֶלָּא אַתָּה. אָבִינוּ מַלְכֵּנוּ רַחֵם עָלֵינוּ: לְךָ יהוה קִוִּינוּ. אָבִינוּ אַתָּה. כִּי אַתָּה אָבִינוּ. אֵין לָנוּ אֶלָּא אַתָּה. אָבִינוּ מַלְכֵּנוּ רַחֵם עָלֵינוּ: לְךָ פֵּרַשְׂנוּ שַׁעַל. אָבִינוּ אַתָּה. הַמְצִיא לָנוּ תַּעַל. אֵין לָנוּ אֶלָּא אַתָּה. אָבִינוּ מַלְכֵּנוּ רַחֵם עָלֵינוּ: חוּשָׁה שְׁלַח מָשִׁיחַ. אָבִינוּ אַתָּה. וְצִיץ יֶשַׁע תַּפְרִיחַ. אֵין לָנוּ אֶלָּא אַתָּה. אָבִינוּ מַלְכֵּנוּ רַחֵם עָלֵינוּ: אָבִינוּ מַלְכֵּנוּ אָבִינוּ אַתָּה. אָבִינוּ מַלְכֵּנוּ אֵין לָנוּ מֶלֶךְ אֶלָּא אַתָּה. אָבִינוּ מַלְכֵּנוּ רַחֵם עָלֵינוּ: \n\n" +
			"אָבִינוּ מַלְכֵּנוּ, אָבִינוּ אָתָּה. אָבִינוּ מַלְכֵּנוּ אֵין לָנוּ מֶלֶךְ אֶלָּא אָתָּה. אָבִינוּ מַלְכֵּנוּ רַחֵם עָלֵינוּ: אָבִינוּ מַלְכֵּנוּ חָנֵּנוּ וַעֲנֵנוּ כִּי אֵין בָּנוּ מַעֲשִׂים. עֲשֵׂה עִמָּנוּ צְדָקָה וָחֶסֶד לְמַעַן שִׁמְךָ הַגָּדוֹל וְהוֹשִׁיעֵנוּ: וַאֲנַ֗חְנוּ לֹ֤א נֵדַע֙ מַֽה־נַּעֲשֶׂ֔ה כִּ֥י עָלֶ֖יךָ עֵינֵֽינוּ׃ זְכֹר־רַחֲמֶ֣יךָ יְ֭הֹוָה וַחֲסָדֶ֑יךָ כִּ֖י מֵעוֹלָ֣ם הֵֽמָּה: יְהִי־חַסְדְּךָ֣ יְהֹוָ֣ה עָלֵ֑ינוּ כַּ֝אֲשֶׁ֗ר יִחַ֥לְנוּ לָֽךְ׃ אַֽל־תִּזְכׇּר־לָנוּ֮ עֲוֺנֹ֢ת רִאשֹׁ֫נִ֥ים מַ֭הֵר יְקַדְּמ֣וּנוּ רַחֲמֶ֑יךָ כִּ֖י דַלּ֣וֹנוּ מְאֹֽד׃ עֶ֭זְרֵנוּ בְּשֵׁ֣ם יְהֹוָ֑ה עֹ֝שֵׂ֗ה שָׁמַ֥יִם וָאָֽרֶץ׃ חׇנֵּ֣נוּ יְהֹוָ֣ה חׇנֵּ֑נוּ כִּי־רַ֗֝ב שָׂבַ֥עְנוּ בֽוּז׃ בְּרֹגֶז רַחֵם תִּזְכּוֹר. בְּרֹגֶז אַהֲבָה תִּזְכּוֹר. בְּרֹגֶז עֲקֵדָה תִּזְכּוֹר. בְּרֹגֶז תְּמִימוּת תִּזְכּוֹר: יְהֹוָ֥ה הוֹשִׁ֑יעָה הַ֝מֶּ֗לֶךְ יַעֲנֵ֥נוּ בְיוֹם־קׇרְאֵֽנוּ׃ כִּי־ה֭וּא יָדַ֣ע יִצְרֵ֑נוּ זָ֝כ֗וּר כִּי־עָפָ֥ר אֲנָֽחְנוּ׃ עׇזְרֵ֤נוּ ׀ אֱלֹ֘הֵ֤י יִשְׁעֵ֗נוּ עַֽל־דְּבַ֥ר כְּבֽוֹד־שְׁמֶ֑ךָ וְהַצִּילֵ֥נוּ וְכַפֵּ֥ר עַל־חַ֝טֹּאתֵ֗ינוּ לְמַ֣עַן שְׁמֶֽךָ׃" +
			"שׁוֹמֵר יִשְׂרָאֵל. שְׁמֹר שְׁאֵרִית יִשְׂרָאֵל. וְאַל יֹאבַד יִשְׂרָאֵל. הָאוֹמְרִים בְּכָל יוֹם. שְׁמַע יִשְׂרָאֵל: \n\n" +
			"שׁוֹמֵר גּוֹי אֶחָד. שְׁמֹר שְׁאֵרִית גּוֹי אֶחָד. וְאַל יֹאבַד גּוֹי אֶחָד. הָאוֹמְרִים בְּכָל יוֹם. שְׁמַע יִשְׂרָאֵל. יהוה אלהינו. יהוה אֶחָד: \n\n" +
			"שׁוֹמֵר גּוֹי קָדוֹשׁ. שְׁמֹר שְׁאֵרִית גּוֹי קָדוֹשׁ. וְאַל יֹאבַד גּוֹי קָדוֹשׁ. הָאוֹמְרִים בְּכָל יוֹם. קָדוֹשׁ. קָדוֹשׁ. קָדוֹשׁ: \n\n" +
			"שׁוֹמֵר גּוֹי רַבָּא. שְׁמֹר שְׁאֵרִית גּוֹי רַבָּא. וְאַל יֹאבַד גּוֹי רַבָּא. הָאוֹמְרִים בְּכָל יוֹם. אָמֵן יְהֵא שְׁמֵיהּ רַבָּא: \n\n" +
			"(ואומר השליח ציבור קדיש:) (Chazzan says Kaddish)");

		addHalfKaddish(false);
		String[] uniqueEnding = {
			"תֵּעָנוּ וְתֵעָתְרוּ בְּרַחֲמִים מִן הַשָּׁמַיִם. תְּקֻבַּל צַעֲקַתְכֶם. תִּשָּׁמַע תְּפִלַּתְכֶם בְּרָצוֹן. וְיֵעָנֶה קוֹל עֲתִירַתְכֶם. וִיקַיֵּם בָּנוּ וּבָּכֶם מִקְרָא שֶׁכָּתוּב: יהוה אֱלֹהֵי אֲבוֹתֵכֶם יֹסֵף עֲלֵיכֶם כָּכֶם אֶלֶף פְּעָמִים. וִיבָרֵךְ אֶתְכֶם כַּאֲשֶׁר דִּבֶּר לָכֶם.",
			"וְיִכְתָּבְכֶם הָאֵל בְּסֵפֶר חַיִּים טוֹבִים",
			"וְכֵן יְהִי רָצוֹן וְנֹאמַר אָמֵן: [אָמֵן]: תִּתְקַבַּל צְלוֹתָנָא וּבָעוּתָנָא עִם צְלוֹתְהוֹן וּבָעוּתְהוֹן דְּכָל בֵּית יִשְׂרָאֵל. קֳדָם אֲבוּנָא דְבִשְׁמַיָּא וְאִמְרוּ אָמֵן: [אָמֵן]: יְהֵא שְׁלָמָא רַבָּא מִן שְׁמַיָּא. חַיִּים וְשָׂבָע וִישׁוּעָה וְנֶחָמָה וְשֵׁיזָבָא וּרְפוּאָה וּגְאֻלָּה וּסְלִיחָה וְכַפָּרָה וְרֶוַח וְהַצָּלָה. לָנוּ וּלְכָל עַמּוֹ יִשְׂרָאֵל וְאִמְרוּ אָמֵן. [אָמֵן]: עוֹשֶׂה שָׁלוֹם בִּמְרוֹמָיו. הוּא בְּרַחֲמָיו יַעֲשֶׂה שָׁלוֹם עָלֵינוּ. וְעַל כָּל עַמּוֹ יִשְׂרָאֵל וְאִמְרוּ אָמֵן. [אָמֵן]:"
		};
		if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()) {
			addToSiddur(uniqueEnding[0]);
			addToSiddurHighlighted(uniqueEnding[1]);
			addToSiddur(uniqueEnding[2]);
		} else {
			addToSiddur(uniqueEnding[0] + uniqueEnding[2]);
		}

		addToSiddur(
			"שִׁ֥יר הַֽמַּעֲל֑וֹת מִמַּעֲמַקִּ֖ים קְרָאתִ֣יךָ יְהֹוָֽה׃ אֲדֹנָי֮ שִׁמְעָ֢ה בְק֫וֹלִ֥י תִּהְיֶ֣ינָה אׇ֭זְנֶיךָ קַשֻּׁב֑וֹת לְ֝ק֗וֹל תַּחֲנוּנָֽי׃ אִם־עֲוֺנ֥וֹת תִּשְׁמׇר־יָ֑הּ אֲ֝דֹנָ֗י מִ֣י יַעֲמֹֽד׃ כִּֽי־עִמְּךָ֥ הַסְּלִיחָ֑ה לְ֝מַ֗עַן תִּוָּרֵֽא׃ קִוִּ֣יתִי יְ֭הֹוָה קִוְּתָ֣ה נַפְשִׁ֑י וְֽלִדְבָר֥וֹ הוֹחָֽלְתִּי׃ נַפְשִׁ֥י לַאדֹנָ֑י מִשֹּׁמְרִ֥ים לַ֝בֹּ֗קֶר שֹׁמְרִ֥ים לַבֹּֽקֶר׃ יַחֵ֥ל יִשְׂרָאֵ֗ל אֶל־יְהֹ֫וָ֥ה כִּֽי־עִם־יְהֹוָ֥ה הַחֶ֑סֶד וְהַרְבֵּ֖ה עִמּ֣וֹ פְדֽוּת׃ וְ֭הוּא יִפְדֶּ֣ה אֶת־יִשְׂרָאֵ֑ל מִ֝כֹּ֗ל עֲוֺנֹתָֽיו׃\n\n" +
			"(ואומרים קדיש יהא שלמא:)(Kaddish Yehe Shelama is said here)");
		addKaddishYeheShelama();

		return siddur;
	}

	private void addHotzahSeferTorah() {
		addCategoryToSiddur("הוצאת ספר תורה");
		if (jewishDateInfo.getJewishCalendar().isTishaBav()) {
			addToSiddurHighlighted(
				"עַל הֵיכָלִי אֶבְכֶּה יוֹמָם וָלַיְלָה וּלְתִפְאֶרֶת צִיּוֹן עִיר הַמְּהֻלָּלָה בְּכִי נַפְשִׁי עַל חָרְבַּן פַּעֲמַיִם אֶרֶץ צְבִי צְבִי יְרוּשָׁלַיִם וְעַל עַמָּהּ אֲשֶׁר הָלַךְ בַּגּוֹלָה, וּלְתִפְאֶרֶת צִיּוֹן עִיר הַמְּהֻלָּלָה\n\n" +
				"בֵּית תִּפְאַרְתִּי שָׂם אוֹיֵב לְשַׁמָּה הוֹשִׁיבַנִי בִּידֵי נְבָיוֹת וְשַׁמָּה עַל זֹאת אֶבְכֶּה תָמִיד בְּקוֹל יְלָלָה, וּלְתִפְאֶרֶת צִיּוֹן עִיר הַמְּהֻלָּלָה\n\n" +
				"סִפְדִי תוֹרָה כִּי חֻלְּלָה תִפְאַרְתֵּךְ נָפַל נִזְרֵךְ מִיּוֹם שֶׁנֶחְרַב בֵּיתֵךְ וּשְׂאִי קִינָה עַל אֲהֳלִיבָה וְאָהֳלָה סִפְדִי תוֹרָה עַל אֲהֳלִיבָה וְאָהֳלָה, וּלְתִפְאֶרֶת צִיּוֹן עִיר הַמְּהֻלָּלָה");
			addToSiddurHighlighted(
				"סִפְדִי וְהֵילִֽילִי תּוֹרַת יְקֽוּתִיאֵל, וְחִגְרִי שַׂק וְחֶֽבֶל עַל גּוֹלַת אֲרִיאֵל, הַשְּׁרוּיִם בְּצַֽעַר בֵּין אֱדוֹם וְיִשְׁמָעֵאל. בְּכִי עַל הֶֽרֶג עַם קָדוֹשׁ, עַם הָאֵל, כִּי אָֽכְלָה חֶֽרֶב שְׁאֵרִית יִשְׂרָאֵל: סִפְדִי וְהֵילִֽילִי תּוֹרָה הַקְּדוֹשָׁה לְאֶֽרֶץ יִשְׂרָאֵל, לְאַרְצוֹת רֹאשָׁהּ, וְרֻבֵּי הָֽעֲוֹנוֹת שָׂמֽוּהָ כְבוּשָׁה. בְּכִי עַל הַר קֹֽדֶשׁ וְשִׁמְמוֹת הַהַרְאֵל: סִפְדִי וְהֵילִֽילִי, תּוֹרָה הַתְּמִימָה, עַל בֵּית הַמִּקְדָּשׁ, בָּֽאוּ זָרִים שָֽׁמָּה. שִׁלְּחֽוּהוּ בָאֵשׁ בְּעֶבְרָה גַּם חֵמָה. בְּכִי עַל זֹאת בְּבִכְיָה, דֶּֽמַע בְּהוֹאֵל:");
			addToSiddurHighlighted(
				"קוּמִי וְסִפְדִי תּוֹרָה. וַעֲשִׂי קִינוֹת זְכִירָה. בְּתִשְׁעָה בְּאָב יוֹם צָרָה. וּמְהוּמָה וְיוֹם עֶבְרָה. בְּיוֹם אַף בִּי חָרָה. וְנֶחֱרַב דְּבִיר וַעֲזָרָה. צְעָקָה גְדוֹלָה וּמָרָה. זֹאת חֻקַּת הַתּוֹרָה: שַׁאֲלִי נָא בְּרוֹב מְגִינָּה. אַיֵּה מַחֲנֵה שְׁכִינָה. וּבֵית לְוִיָּה וְדוּכָנָהּ. וְאֵיפֹה אַנְשֵׁי אֱמוּנָה. וְאָנָה פָנָה אָנָה. הוֹד עִיר הַנֶּאֱמָנָה. אֵיכָה הָיְתָה לְזוֹנָה. מְקֻדֶּשֶׁת רִאשׁוֹנָה. לְזֹאת לִבֵּךְ מַר יִקְרָא. כְּמוֹ לֵב אִשָּׁה מְצֵרָה. צְעָקָה גְדוֹלָה וּמָרָה. זֹאת חֻקַּת הַתּוֹרָה: אַיֵּה רֹאשֵׁי יְשִׁיבוֹת וְאֵיפֹה סַנְהֶדְרַיִךְ. וְאָנָה הוֹלְכֵי נְתִיבוֹת. לְנוֹגַהּ זִיו זָהֳרַיִךְ. וְאֵיפֹה עוֹרְכֵי תְּשׁוּבוֹת. לְשׁוֹאֲלִים עַל סְתָרַיִךְ. וְלָאֲלָפִים וְרִבְבוֹת. דּוֹרְשֵׁי סְדָרַיִךְ. כֻּלָּם בְּגָלוּת עֲצוּרָה. הָלְכוּ בְיַד בְּנֵי צָרָה. צְעָקָה גְדוֹלָה וּמָרָה. זֹאת חֻקַּת הַתּוֹרָה: אַיֵּה עוֹשֵׂי זְבָחִים. וְאֵיפֹה עוֹשֵׂי שְׁמָנִים. וְאָנָה עוֹרְכֵי נְתָחִים. וְסוֹד לֶחֶם הַפָּנִים. בָּא רַב הַטַּבָּחִים. וְהָרַג אָבוֹת וּבָנִים. וְאָנוּ וְאָבְלוּ פְתָחִים. אֲשֶׁר אָז עָרְכוּ הַסְּגָנִים. כִּי אֵל חַרְבּוֹ קָרָא. וּחִצֵּי אַפּוֹ יָרָה. צְעָקָה גְדוֹלָה וּמָרָה. זֹאת חֻקַּת הַתּוֹרָה:");
			addToSiddurHighlighted(
				"בִּמְקוֹם אַשְׁרֵי הָעָם, אֵיכָה זָהָב יוּעַם: בִּמְקוֹם גַּדְּלוּ הֲמוֹנֵֽינוּ, נָֽפְלָה עֲטֶֽרֶת רֹאשֵֽׁנוּ: בִּמְקוֹם הָֽעֲטָרָה, רֹאשׁ פְּתָנִים וּמָרָה: בִּמְקוֹם מַפָּה יָפָה, וַחֲסַר צְעִיפָהּ: בִּמְקוֹם יִשְׂמְחוּ הַשָּׁמַֽיִם, יְקוֹנְנוּ מַר כִּפְלַֽיִם: וּבִמְקוֹם זֽוֹהַר חֲזוּתָם, שַׂק הוּשַׁת כְּסוּתָם: בִּמְקוֹם יִשְׂמְחוּ הַשָּׁמַֽיִם, שֹֽׁמּוּ עַל־זֹאת שָׁמַֽיִם: בִּמְקוֹם וְתָגֵל הָאָֽרֶץ, לִבִּי יִכְאַב וּבוֹ יָבֹא קָרֶץ: וּבִמְקוֹם יִשְׂמַח הַר צִיּוֹן, מְרִי שִׂיחִי וְיָדַי אַחֲזוּ רִפְיוֹן: וּבִמְקוֹם תָּגֵֽלְנָה בְּנוֹת יְהוּדָה, הַיּוֹם אָנוּד וְאֶתְנוֹדְדָה: וּבִמְקוֹם עַל הַכֹּל יִתְגַּדָּל, אֱגוֹז רֹאשִׁי וּמִבֶּֽכִי לֹא אֶחְדַּל: וּנְהִי אֲחַדֵּשׁ בִּמְקוֹם וְיִתְקַדָּשׁ, עַל שִׁמְמוֹת קֹֽדֶשׁ וּמִקְדָּשׁ: בְּיוֹם זֶה מִן סְעָרָה אֶקְרָא, בָּעוֹלָמוֹת שֶׁבָּרָא: וּלְחָרְבַּן בֵּית אֵל נוֹרָא, תִּשְׁתּוֹמֵם וְתָפוּג תּוֹרָה: וּלְמִפְקַד כֹּהֲנָיו וּנְבִיאָיו, שֶׁלֹא כִרְצוֹנוֹ וְכִרְצוֹן יְרֵאָיו: בְּיוֹם תְּקוֹנֵן הוֹי אֲרִיאֵל, שֶׁלֹא כִרְצוֹן עַמּוֹ בֵּית יִשְׂרָאֵל: וּמֵעַל אֲרוֹן דָּתֵֽנוּ, גָּלְתָה שְׁכִינָה לְחֶרְפָּתֵֽנוּ: לָכֵן תְּעוֹרֵר לִוְיָתָהּ, בִּמְקוֹם גִּיל בְּאַנְחָתָהּ: עַד יְשִׁיבֵֽנוּ אֶל גְּבוּלֵֽנוּ, תִּגָּלֶה וְתֵֽרָאֶה מַלְכוּתוֹ עָלֵֽינוּ:");
			return;
		}

		if (isTachanunSaidInTheMorning) {
			addToSiddur(
				"אֶל אֶרֶךְ אַפַּיִם וְרַב חֶסֶד וֶאֱמֶת, אֶל בְּאַפְּךָ תוֹכִיחֵנוּ, חוּסָה יְהֹוָה עַל יִשְׂרָאֵל עַמֶּךָ, וְהוֹשִׁיעֵנוּ מִכָּל רָע, חָטָאנוּ לְךָ, אָדוֹן סְלַח נָא, כְּרֹב רַחֲמֶיךָ אֶל: \n\n" +
				"אֶל אֶרֶךְ אַפַּיִם וּמַלֵּא רַחֲמִים, אֶל תַּסְתֵּר פָּנֶיךָ מִמֶּנּוּ, חוּסָה יְהֹוָה עַל שְׁאֵרִית יִשְׂרָאֵל עַמֶּךָ, וְהַצִּילֵנוּ מִכָּל רָע, חָטָאנוּ לְךָ, אֲדוֹן סְלַח נָא, כְּרֹב רַחֲמֶיךָ אֶל:");
		} else {
			addToSiddur(
				"יְהִ֨י יְהֹוָ֤ה אֱלֹהֵ֙ינוּ֙ עִמָּ֔נוּ כַּאֲשֶׁ֥ר הָיָ֖ה עִם־אֲבֹתֵ֑ינוּ אַל־יַעַזְבֵ֖נוּ וְאַֽל־יִטְּשֵֽׁנוּ׃ הוֹשִׁ֤יעָה ׀ אֶת־עַמֶּ֗ךָ וּבָרֵ֥ךְ אֶת־נַחֲלָתֶ֑ךָ וּֽרְעֵ֥ם וְ֝נַשְּׂאֵ֗ם עַד־הָעוֹלָֽם׃ בַּֽ֭עֲבוּר דָּוִ֣ד עַבְדֶּ֑ךָ אַל־תָּ֝שֵׁ֗ב פְּנֵ֣י מְשִׁיחֶֽךָ׃");
		}

		if (jewishDateInfo.getJewishCalendar().isRoshChodesh() || jewishDateInfo.getJewishCalendar().isCholHamoed()) {
			addToSiddurHighlighted(
				"פותחים ההיכל ואומרים (Ark is opened)\n\n" +
				"בְּרִיךְ שְׁמֵהּ שְׁמֵהּ דְּמָארֵי עָלְמָא, בְּרִיךְ כִּתְרָךְ וְאַתְרָךְ. יְהֵא רְעוּתָךְ, עִם עַמָּךְ יִשְׂרָאֵל לְעָלַם, וּפוּרְקַן יְמִינָךְ אַחְזֵי לְעַמָּךְ בְּבֵית מִקְדָּשָׁךְ, לְאַמְטוּיֵי לָנָא מִטּוּב נְהוֹרָךְ, וּלְקַבְּלָא צְלוֹתָנָא בְּרַחֲמֵי. יְהֵא רַעֲוָא קֳדָמָךְ דְּתוֹרִיךְ לָן חַיִּין בּטִיבוּ, וְלֶהֱוֵי אֲנָא עַבְדָּךְ פְּקִידָא בְּגוֹ צַדִּיקַיָּא, לְמִרְחַם עָלַי וּלְמִנְטַר יָתִי, וְיַת כּל דִּי לִי, וְדִי לְעַמָּךְ יִשְׂרָאֵל. אַנְתְּ הוּא זָן לְכֹלָא וּמְפַרְנֵס לְכֹלָא. אַנְתְּ הוּא שַׁלִּיט עַל כֹּלָא, אַנְתְּ הוּא דְשַׁלִּיט עַל מַלְכַיָּא, וּמַלְכוּתָא דִילָךְ הִיא. אֲנָא עַבְדָּא דְקֻדְשָׁא בְּרִיךְ הוּא, דְסָגִידְנָא קַמֵּהּ מִקַמֵּי דִּיקַר אוֹרַיְתֵהּ בְּכל עִידָּן וְעִידָּן. לָא עַל אֱנָשׁ רָחִיצְנָא, וְלָא עַל בַּר אֱלָהִין סְמִיכְנָא, אֶלָּא בֵאלָהָא דִשְׁמַיָּא, דְּהוּא אֱלָהָא דִקְשׁוֹט, וְאוֹרַיְתֵהּ קְשׁוֹט, וּנְבִיאוֹהִי קְשׁוֹט, וּמַסְגֵּי לְמֶעְבַּד טַבְוָן וּקְשׁוֹט, בֵּהּ אֲנָא רְחִיץ וְלִשְׁמֵהּ יַקִּירָא קַדִּישָׁא אֲנָא אֵמַר תֻּשְׁבְּחָן. יְהֵא רַעֲוָא קֳדָמָךְ דְּתִפְתַּח לִבִּי בְּאוֹרַיְתָךְ, (וְתִיהַב לִי בְּנִין דִּכְרִין דְּעַבְדִּין רְעוּתָךְ) וְתַשְׁלִים מִשְׁאֲלִין דְּלִבָּאי וְלִבָּא דכל עַמָּךְ יִשְׂרָאֵל לְטַב וּלְחַיִּין וְלִשְׁלָם אָמֵן:");
		}

		addToSiddur(
			"שמוציאים ספר תורה אומרים (When they take out the sefer torah) \n\n" +
			"בָּרוּךְ הַמָּקוֹם שֶׁנָּתַן תּוֹרָה לְעַמּוֹ יִשְׂרָאֵל, בָּרוּךְ הוּא: אַשְׁרֵ֣י הָ֭עָם שֶׁכָּ֣כָה לּ֑וֹ אַֽשְׁרֵ֥י הָ֝עָ֗ם שֱׁיְהֹוָ֥ה אֱלֹהָֽיו׃ גַּדְּל֣וּ לַיהֹוָ֣ה אִתִּ֑י וּנְרוֹמְמָ֖ה שְׁמ֣וֹ יַחְדָּֽו׃ רוֹמְמ֡וּ יְהֹ֘וָ֤ה אֱלֹהֵ֗ינוּ וְֽ֭הִשְׁתַּחֲווּ לַהֲדֹ֥ם רַגְלָ֗יו קָד֥וֹשׁ הֽוּא׃ רוֹמְמ֡וּ יְהֹ֘וָ֤ה אֱלֹהֵ֗ינוּ וְֽ֭הִשְׁתַּחֲווּ לְהַ֣ר קׇדְשׁ֑וֹ כִּי־קָ֝ד֗וֹשׁ יְהֹוָ֥ה אֱלֹהֵֽינוּ׃ אֵין־קָד֥וֹשׁ כַּיהֹוָ֖ה כִּ֣י אֵ֣ין בִּלְתֶּ֑ךָ וְאֵ֥ין צ֖וּר כֵּאלֹהֵֽינוּ׃ כִּ֤י מִ֣י אֱ֭לוֹהַּ מִבַּלְעֲדֵ֣י יְהֹוָ֑ה וּמִ֥י צ֝֗וּר זוּלָתִ֥י אֱלֹהֵֽינוּ׃ תּוֹרָ֥ה צִוָּה־לָ֖נוּ מֹשֶׁ֑ה מוֹרָשָׁ֖ה קְהִלַּ֥ת יַעֲקֹֽב׃ עֵץ־חַיִּ֣ים הִ֭יא לַמַּחֲזִיקִ֣ים בָּ֑הּ וְֽתֹמְכֶ֥יהָ מְאֻשָּֽׁר׃ דְּרָכֶ֥יהָ דַרְכֵי־נֹ֑עַם וְֽכׇל־נְתִ֖יבוֹתֶ֣יהָ שָׁלֽוֹם׃ שָׁל֣וֹם רָ֭ב לְאֹהֲבֵ֣י תוֹרָתֶ֑ךָ וְאֵֽין־לָ֥מוֹ מִכְשֽׁוֹל׃ יְֽהֹוָ֗ה עֹ֭ז לְעַמּ֣וֹ יִתֵּ֑ן יְהֹוָ֓ה ׀ יְבָרֵ֖ךְ אֶת־עַמּ֣וֹ בַשָּׁלֽוֹם׃");
	}

	public ArrayList<HighlightString> getShacharitPrayers() {
		siddur = new ArrayList<>();// reset
		if (jewishDateInfo.getJewishCalendar().isAssurBemelacha()) {
			addToSiddur("Shabbat and Yom Tov are currently not supported/שבת ויום טוב כרגע אינם נתמכים");
			addToSiddurHighlighted("Open Sefaria Siddur/פתח את סידור ספריה");
			return siddur;
		}
		addCategoryToSiddur("ברכות השחר");
		addToSiddur(
			"מוֹדֶה (האשה אומרת/women say: מוֹדָה) אֲנִי לְפָנֶיךָ מֶלֶךְ חַי וְקַיָּם שֶהֶחֱזַרְתָּ בִּי נִשְׁמָתִי בְחֶמְלָה, רַבָּה אֱמוּנָתֶךָ:\n\nבָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ עַל נְטִילַת יָדָיִם:\n\n" +
			"בָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, אֲשֶׁר יָצַר אֶת הָאָדָם בְּחָכְמָה, וּבָרָא בוֹ נְקָבִים נְקָבִים, חֲלוּלִים חֲלוּלִים, גָּלוּי וְיָדוּעַ לִפְנֵי כִסֵּא כְבוֹדֶךָ, שֶׁאִם יִסָּתֵם אֶחָד מֵהֶם, אוֹ אִם יִפָּתֵח אֶחָד מֵהֶם, אֵי אֶפְשָׁר לְהִתְקַיֵּם אַפִלּוּ שָׁעָה אֶחָת. בָּרוּךְ אַתָּה יְהֹוָה, רוֹפֵא כָל־בָּשָׂר וּמַפְלִיא לַעֲשׂוֹת:\n\nאֱלֹהַי, נְשָׁמָה שֶׁנָּתַתָּ בִּי טְהוֹרָה, אַתָּה בְרָאתָהּ, אַתָּה יְצַרְתָּהּ, אַתָּה נְפַחְתָּהּ בִּי, וְאַתָּה מְשַׁמְּרָהּ בְּקִרְבִּי, וְאַתָּה עָתִיד לִטְּלָהּ מִמֶּנִּי, וּלְהַחֲזִירָהּ בִּי לֶעָתִיד לָבוֹא, כָּל־זְמַן שֶׁהַנְּשָׁמָה בְקִרְבִּי, מוֹדֶה (האשה אומרת/women say מוֹדָה) אֲנִי לְפָנֶיךָ יְהֹוָה אֱלֹהַי וֵאלֹהֵי אֲבוֹתַי, רִבּוֹן כָּל־הַמַּעֲשִׂים אֲדוֹן כָּל־הַנְּשָׁמוֹת. בָּרוּךְ אַתָּה יְהֹוָה, הַמַּחֲזִיר נְשָׁמוֹת לִפְגָרִים מֵתִים:\n\n" +
			"בָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, הַנוֹתֵן לַשֶּׂכְוִי בִינָה, לְהַבְחִין בֵּין יוֹם וּבֵין לָיְלָה: \n" +
			"בָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, פּוֹקֵחַ עִוְרִים: \n" +
			"בָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, מַתִּיר אֲסוּרִים: \n" +
			"בָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, זוֹקֵף כְּפוּפִים: \n" +
			"בָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, מַלְבִּישׁ עֲרֻמִּים: \n" +
			"בָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, הַנּוֹתֵן לַיָּעֵף כֹּחַ: \n" +
			"בָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, רוֹקַע הָאָרֶץ עַל הַמָּיִם: \n" +
			"בָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, הַמֵּכִין מִצְעֲדֵי גָבֶר: \n" +
			"בָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, שֶׁעָשָׂה לִי כָּל־צָרְכִּי: \n" +
			"בָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, אוֹזֵר יִשְׂרָאֵל בִּגְבוּרָה: \n" +
			"בָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, עוֹטֵר יִשְׂרָאֵל בְּתִפְאָרָה: \n" +
			"בָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, שֶׁלֹּא עָשַׂנִי גוֹי: האשה אומרת (women say): גּוֹיָה \n" +
			"בָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, שֶׁלֹּא עָשַׂנִי עָבֶד: האשה אומרת (women say): שִׁפְחָה \n" +
			"האיש מברך (men say) \n" +
			"בָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, שֶׁלֹּא עָשַׂנִי אִשָּׁה: \n" +
			"האשה מברכת בלי שם ומלכות (women say) \n" +
			"בָּרוּךְ שֶׁעָשַׂנִי כִּרְצוֹנוֹ: \n\n" +
			"בָּרוּךְ אַתָּה יְהוָֹה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, הַמַּעֲבִיר חֶבְלֵי שֵׁנָה מֵעֵינָי וּתְנוּמָה מֵעַפְעַפָּי. וִיהִי רָצוֹן מִלְפָנֶיךָ יְהֹוָה, אֱלֹהַי וֵאלֹהֵי אֲבוֹתַי, שֶׁתַרְגִּילֵנִי בְּתוֹרָתֶךָ, וְתַדְבִּיקֵנִי בְּמִצְוֹתֶיךָ, וְאַל תְּבִיאֵנִי לִידֵי חֵטְא, וְלֹא לִידֵי עָוֹן, וְלֹא לִידֵי נִסָיוֹן, וְלֹא לִידֵי בִזָּיוֹן, וְתַרְחִיקֵנִי מִיֵּצֶר הָרָע, וְתַדְבִּיקֵנִי בְּיֵצֶר הַטּוֹב, וְכוֹף אֶת־יִצְרִי לְהִשְׁתַּעְבֶּד לָּךְ, וּתְנֵנִי הַיּוֹם וּבְכָל־יוֹם לְחֵן וּלְחֶסֶד וּלְרַחֲמִים בְּעֵינֶיךָ וּבְעֵינֵי כָל־רוֹאַי, וְגָמְלֵנִי חֲסָדִים טוֹבִים. בָּרוּךְ אַתָּה יְהֹוָה, גּוֹמֵל חֲסָדִים טוֹבִים לְעַמּוֹ יִשְׂרָאֵל: \n\n" +
			"יְהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה, אֱלֹהַי וֵאלֹהֵי אֲבוֹתַי, שֶׁתַּצִּילֵנִי הַיּוֹם וּבְכָל יוֹם וָיוֹם, מֵעַזֵּי פָנִים, וּמֵעַזּוּת פָּנִים, מֵאָדָם רָע, מִיֵּצֶר רָע, מֵחָבֵר רָע, מִשָּׁכֵן רָע, מִפֶּגַע רָע, מֵעַיִן הָרָע, וּמִלָּשׁוֹן הָרָע, מִדִּין קָשֶׁה, וּמִבַּעַל דִּין קָשֶׁה, בֵּין שֶׁהוּא בֶן־בְּרִית, וּבֵין שֶׁאֵינוֹ בֶן־בְּרִית: \n\n" +
			"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ עַל דִּבְרֵי תוֹרָה: \n\n" +
			"וְהַעֲרֵב נָא, יְהֹוָה אֱלֹהֵֽינוּ, אֶת־דִּבְרֵי תוֹרָתְךָ בְּפִינוּ וּבְפִיפִיּוֹת עַמְּךָ בֵּית יִשְׂרָאֵל, וְנִהְיֶה אֲנַחְנוּ וְצֶאֱצָאֵינוּ, וְצֶאֱצָאֵי צֶאֱצָאֵינוּ, וְצֶאֱצָאֵי עַמְּךָ בֵּית יִשְׂרָאֵל, כֻּלָּנוּ יוֹדְעֵי שְׁמֶךָ, וְלוֹמְדֵי תוֹרָתְךָ לִשְׁמָהּ. בָּרוּךְ אַתָּה יְהֹוָה, הַמְלַמֵּד תּוֹרָה לְעַמּוֹ יִשְׂרָאֵל: \n\n" +
			"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, אֲשֶׁר בָּחַר בָּנוּ מִכָּל־הָעַמִּים וְנָתַן לָנוּ אֶת־תּוֹרָתוֹ. בָּרוּךְ אַתָּה יְהֹוָה נוֹתֵן הַתּוֹרָה: \n\n" +
			"וַיְדַבֵּ֥ר יְהֹוָ֖ה אֶל־מֹשֶׁ֥ה לֵּאמֹֽר׃ דַּבֵּ֤ר אֶֽל־אַהֲרֹן֙ וְאֶל־בָּנָ֣יו לֵאמֹ֔ר כֹּ֥ה תְבָרְכ֖וּ אֶת־בְּנֵ֣י יִשְׂרָאֵ֑ל אָמ֖וֹר לָהֶֽם׃ יְבָרֶכְךָ֥ יְהֹוָ֖ה וְיִשְׁמְרֶֽךָ׃ יָאֵ֨ר יְהֹוָ֧ה פָּנָ֛יו אֵלֶ֖יךָ וִֽיחֻנֶּֽךָּ׃ יִשָּׂ֨א יְהֹוָ֤ה פָּנָיו֙ אֵלֶ֔יךָ וְיָשֵׂ֥ם לְךָ֖ שָׁלֽוֹם׃ וְשָׂמ֥וּ אֶת־שְׁמִ֖י עַל־בְּנֵ֣י יִשְׂרָאֵ֑ל וַאֲנִ֖י אֲבָרְכֵֽם׃");
		// Morning Brachot

		if (jewishDateInfo.getJewishCalendar().isCholHamoed()) {
			addCategoryToSiddur("סדר ציצית");

			addToSiddur("בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ לְהִתְעַטֵּף בְּצִיצִית:");
		} else {
			addCategoryToSiddur("סדר ציצית ותפילין");

			addToSiddur(
				"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ לְהִתְעַטֵּף בְּצִיצִית:\n\nבָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו, וְצִוָּנוּ לְהָנִיחַ תְּפִלִּין:\n\n" +
				WeeklyParashaReadings.tefilinParashatBo[0] +
				WeeklyParashaReadings.tefilinParashatBo[1] +
				"\n\n" +
				WeeklyParashaReadings.tefilinParashatBo[2]);
		} // Talit/Tefilin
		
		addPatachEliyahu();

		addCategoryToSiddur("שחרית");

		addToSiddur(
			"אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, זָכְרֵנוּ בְּזִכְרוֹן טוֹב מִלְּפָנֶיךָ, וּפָקְדֵנוּ בִּפְקֻדַת יְשׁוּעָה וְרַחֲמִים מִשְּׁמֵי שְׁמֵי קֶדֶם, וּזְכֹר־לָנוּ יְהֹוָה אֱלֹהֵינוּ אַהֲבַת הַקַּדְמוֹנִים אַבְרָהָם יִצְחָק וְיִשְׂרָאֵל עֲבָדֶיךָ, אֶת הַבְּרִית וְאֶת הַחֶסֶד וְאֶת הַשְּׁבוּעָה שֶׁנִּשְׁבַּעְתָּ לְאַבְרָהָם אָבִינוּ בְּהַר הַמּוֹרִיָּה, וְאֶת הָעֲקֵדָה שֶׁעָקַד אֶת יִצְחָק בְּנוֹ עַל־גַּבֵּי הַמִּזְבֵּחַ כַּכָּתוּב בְּתוֹרָתָךְ: \n\n" +
			"וַיְהִ֗י אַחַר֙ הַדְּבָרִ֣ים הָאֵ֔לֶּה וְהָ֣אֱלֹהִ֔ים נִסָּ֖ה אֶת־אַבְרָהָ֑ם וַיֹּ֣אמֶר אֵלָ֔יו אַבְרָהָ֖ם וַיֹּ֥אמֶר הִנֵּֽנִי׃ וַיֹּ֡אמֶר קַח־נָ֠א אֶת־בִּנְךָ֨ אֶת־יְחִֽידְךָ֤ אֲשֶׁר־אָהַ֙בְתָּ֙ אֶת־יִצְחָ֔ק וְלֶ֨ךְ־לְךָ֔ אֶל־אֶ֖רֶץ הַמֹּרִיָּ֑ה וְהַעֲלֵ֤הוּ שָׁם֙ לְעֹלָ֔ה עַ֚ל אַחַ֣ד הֶֽהָרִ֔ים אֲשֶׁ֖ר אֹמַ֥ר אֵלֶֽיךָ׃ וַיַּשְׁכֵּ֨ם אַבְרָהָ֜ם בַּבֹּ֗קֶר וַֽיַּחֲבֹשׁ֙ אֶת־חֲמֹר֔וֹ וַיִּקַּ֞ח אֶת־שְׁנֵ֤י נְעָרָיו֙ אִתּ֔וֹ וְאֵ֖ת יִצְחָ֣ק בְּנ֑וֹ וַיְבַקַּע֙ עֲצֵ֣י עֹלָ֔ה וַיָּ֣קׇם וַיֵּ֔לֶךְ אֶל־הַמָּק֖וֹם אֲשֶׁר־אָֽמַר־ל֥וֹ הָאֱלֹהִֽים׃ בַּיּ֣וֹם הַשְּׁלִישִׁ֗י וַיִּשָּׂ֨א אַבְרָהָ֧ם אֶת־עֵינָ֛יו וַיַּ֥רְא אֶת־הַמָּק֖וֹם מֵרָחֹֽק׃ וַיֹּ֨אמֶר אַבְרָהָ֜ם אֶל־נְעָרָ֗יו שְׁבוּ־לָכֶ֥ם פֹּה֙ עִֽם־הַחֲמ֔וֹר וַאֲנִ֣י וְהַנַּ֔עַר נֵלְכָ֖ה עַד־כֹּ֑ה וְנִֽשְׁתַּחֲוֶ֖ה וְנָשׁ֥וּבָה אֲלֵיכֶֽם׃ וַיִּקַּ֨ח אַבְרָהָ֜ם אֶת־עֲצֵ֣י הָעֹלָ֗ה וַיָּ֙שֶׂם֙ עַל־יִצְחָ֣ק בְּנ֔וֹ וַיִּקַּ֣ח בְּיָד֔וֹ אֶת־הָאֵ֖שׁ וְאֶת־הַֽמַּאֲכֶ֑לֶת וַיֵּלְכ֥וּ שְׁנֵיהֶ֖ם יַחְדָּֽו׃ וַיֹּ֨אמֶר יִצְחָ֜ק אֶל־אַבְרָהָ֤ם אָבִיו֙ וַיֹּ֣אמֶר אָבִ֔י וַיֹּ֖אמֶר הִנֶּ֣נִּֽי בְנִ֑י וַיֹּ֗אמֶר הִנֵּ֤ה הָאֵשׁ֙ וְהָ֣עֵצִ֔ים וְאַיֵּ֥ה הַשֶּׂ֖ה לְעֹלָֽה׃ וַיֹּ֙אמֶר֙ אַבְרָהָ֔ם אֱלֹהִ֞ים יִרְאֶה־לּ֥וֹ הַשֶּׂ֛ה לְעֹלָ֖ה בְּנִ֑י וַיֵּלְכ֥וּ שְׁנֵיהֶ֖ם יַחְדָּֽו׃ וַיָּבֹ֗אוּ אֶֽל־הַמָּקוֹם֮ אֲשֶׁ֣ר אָֽמַר־ל֣וֹ הָאֱלֹהִים֒ וַיִּ֨בֶן שָׁ֤ם אַבְרָהָם֙ אֶת־הַמִּזְבֵּ֔חַ וַֽיַּעֲרֹ֖ךְ אֶת־הָעֵצִ֑ים וַֽיַּעֲקֹד֙ אֶת־יִצְחָ֣ק בְּנ֔וֹ וַיָּ֤שֶׂם אֹתוֹ֙ עַל־הַמִּזְבֵּ֔חַ מִמַּ֖עַל לָעֵצִֽים׃ וַיִּשְׁלַ֤ח אַבְרָהָם֙ אֶת־יָד֔וֹ וַיִּקַּ֖ח אֶת־הַֽמַּאֲכֶ֑לֶת לִשְׁחֹ֖ט אֶת־בְּנֽוֹ׃ וַיִּקְרָ֨א אֵלָ֜יו מַלְאַ֤ךְ יְהֹוָה֙ מִן־הַשָּׁמַ֔יִם וַיֹּ֖אמֶר אַבְרָהָ֣ם ׀ אַבְרָהָ֑ם וַיֹּ֖אמֶר הִנֵּֽנִי׃ וַיֹּ֗אמֶר אַל־תִּשְׁלַ֤ח יָֽדְךָ֙ אֶל־הַנַּ֔עַר וְאַל־תַּ֥עַשׂ ל֖וֹ מְא֑וּמָה כִּ֣י ׀ עַתָּ֣ה יָדַ֗עְתִּי כִּֽי־יְרֵ֤א אֱלֹהִים֙ אַ֔תָּה וְלֹ֥א חָשַׂ֛כְתָּ אֶת־בִּנְךָ֥ אֶת־יְחִידְךָ֖ מִמֶּֽנִּי׃ וַיִּשָּׂ֨א אַבְרָהָ֜ם אֶת־עֵינָ֗יו וַיַּרְא֙ וְהִנֵּה־אַ֔יִל אַחַ֕ר נֶאֱחַ֥ז בַּסְּבַ֖ךְ בְּקַרְנָ֑יו וַיֵּ֤לֶךְ אַבְרָהָם֙ וַיִּקַּ֣ח אֶת־הָאַ֔יִל וַיַּעֲלֵ֥הוּ לְעֹלָ֖ה תַּ֥חַת בְּנֽוֹ׃ וַיִּקְרָ֧א אַבְרָהָ֛ם שֵֽׁם־הַמָּק֥וֹם הַה֖וּא יְהֹוָ֣ה ׀ יִרְאֶ֑ה אֲשֶׁר֙ יֵאָמֵ֣ר הַיּ֔וֹם בְּהַ֥ר יְהֹוָ֖ה יֵרָאֶֽה׃ וַיִּקְרָ֛א מַלְאַ֥ךְ יְהֹוָ֖ה אֶל־אַבְרָהָ֑ם שֵׁנִ֖ית מִן־הַשָּׁמָֽיִם׃ וַיֹּ֕אמֶר בִּ֥י נִשְׁבַּ֖עְתִּי נְאֻם־יְהֹוָ֑ה כִּ֗י יַ֚עַן אֲשֶׁ֤ר עָשִׂ֙יתָ֙ אֶת־הַדָּבָ֣ר הַזֶּ֔ה וְלֹ֥א חָשַׂ֖כְתָּ אֶת־בִּנְךָ֥ אֶת־יְחִידֶֽךָ׃ כִּֽי־בָרֵ֣ךְ אֲבָרֶכְךָ֗ וְהַרְבָּ֨ה אַרְבֶּ֤ה אֶֽת־זַרְעֲךָ֙ כְּכוֹכְבֵ֣י הַשָּׁמַ֔יִם וְכַח֕וֹל אֲשֶׁ֖ר עַל־שְׂפַ֣ת הַיָּ֑ם וְיִרַ֣שׁ זַרְעֲךָ֔ אֵ֖ת שַׁ֥עַר אֹיְבָֽיו׃ וְהִתְבָּרְכ֣וּ בְזַרְעֲךָ֔ כֹּ֖ל גּוֹיֵ֣י הָאָ֑רֶץ עֵ֕קֶב אֲשֶׁ֥ר שָׁמַ֖עְתָּ בְּקֹלִֽי׃ וַיָּ֤שׇׁב אַבְרָהָם֙ אֶל־נְעָרָ֔יו וַיָּקֻ֛מוּ וַיֵּלְכ֥וּ יַחְדָּ֖ו אֶל־בְּאֵ֣ר שָׁ֑בַע וַיֵּ֥שֶׁב אַבְרָהָ֖ם בִּבְאֵ֥ר שָֽׁבַע׃ \n\n" +
			"וְשָׁחַ֨ט אֹת֜וֹ עַ֣ל יֶ֧רֶךְ הַמִּזְבֵּ֛חַ צָפֹ֖נָה לִפְנֵ֣י יְהֹוָ֑ה וְזָרְק֡וּ בְּנֵי֩ אַהֲרֹ֨ן הַכֹּהֲנִ֧ים אֶת־דָּמ֛וֹ עַל־הַמִּזְבֵּ֖חַ סָבִֽיב: \n\n" +
			"יְהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, שֶׁתִּתְמַלֵּא רַחֲמִים עָלֵינוּ, וּבְכֵן בְּרוֹב רַחֲמֶיךָ תִּזְכּוֹר לָנוּ עֲקֵדָתוֹ שֶׁל יִצְחָק אָבִינוּ בֶּן אַבְרָהָם אָבִינוּ עָלָיו הַשָּׁלוֹם, כְּאִלּוּ אֶפְרוֹ צָבוּר וּמֻנָּח עַל גַּבֵּי הַמִּזְבֵּחַ, וְתַבִּיט בְּאֶפְרוֹ לְרַחֵם עָלֵינוּ, וּלְבַטֵּל מֵעָלֵינוּ כָּל־גְּזֵירוֹת קָשׁוֹת וְרָעוֹת, וּתְזַכֵּנוּ לָשׁוּב בִּתְשׁוּבָה שְׁלֵמָה לְפָנֶיךָ, וְתַצִּילֵנוּ מִיֵּצֶר הָרָע וּמִכָּל חֵטְא וְעָוֹן, וְתַאֲרִיךְ יָמֵינוּ בַּטּוֹב וּשְׁנוֹתֵינוּ בַּנְּעִימִים: \n\n" +
			"רִבּוֹנוֹ שֶׁל עוֹלָם, כְּמוֹ שֶׁכָּבַשׁ אַבְרָהָם אָבִינוּ אֶת רַחֲמָיו לַעֲשׂוֹת רְצוֹנְךָ בְּלֵבָב שָׁלֵם, כֵּן יִכְבְּשׁוּ רַחֲמֶיךָ אֶת כַּעַסֶֽךָ, וְיִּגֹּלוּ רַחֲמֶיךָ עַל מִדּוֹתֶיךָ, וְתִתְנַהֵג עִמָּנוּ יְהֹוָה אֱלֹהֵינוּ בְּמִדַּת הַחֶסֶד וּבְמִדַּת הָרַחֲמִים, וְתִכָּנֵס לָנוּ לִפְנִים מִשּׁוּרַת הַדִּין, וּבְטוּבְךָ הַגָּדוֹל יָשׁוּב חֲרוֹן אַפָּךְ, מֵעַמָּךְ וּמֵעִירָךְ וּמֵאַרְצָךְ וּמִנַּחֲלָתָךְ, וְקַיֵם לָנוּ יְהֹוָה אֱלֹהֵינוּ אֶת הַדָּבָר שֶׁהִבְטַחְתָּנוּ בְּתוֹרָתָךְ עַל יְדֵי מֹשֶׁה עַבְדָּךְ כָּאָמוּר: וְזָכַרְתִּ֖י אֶת־בְּרִיתִ֣י יַעֲק֑וֹב וְאַף֩ אֶת־בְּרִיתִ֨י יִצְחָ֜ק וְאַ֨ף אֶת־בְּרִיתִ֧י אַבְרָהָ֛ם אֶזְכֹּ֖ר וְהָאָ֥רֶץ אֶזְכֹּֽר: וְנֶאֱמַר: וְאַף־גַּם־זֹ֠את בִּֽהְיוֹתָ֞ם בְּאֶ֣רֶץ אֹֽיְבֵיהֶ֗ם לֹֽא־מְאַסְתִּ֤ים וְלֹֽא־גְעַלְתִּים֙ לְכַלֹּתָ֔ם לְהָפֵ֥ר בְּרִיתִ֖י אִתָּ֑ם כִּ֛י אֲנִ֥י יְהֹוָ֖ה אֱלֹהֵיהֶֽם: וְזָכַרְתִּ֥י לָהֶ֖ם בְּרִ֣ית רִאשֹׁנִ֑ים אֲשֶׁ֣ר הוֹצֵֽאתִי־אֹתָם֩ מֵאֶ֨רֶץ מִצְרַ֜יִם לְעֵינֵ֣י הַגּוֹיִ֗ם לִהְי֥וֹת לָהֶ֛ם לֵאלֹהִ֖ים אֲנִ֥י יְהֹוָֽה: וְנֶאֱמַר: וְשָׁ֨ב יְהֹוָ֧ה אֱלֹהֶ֛יךָ אֶת־שְׁבוּתְךָ֖ וְרִחֲמֶ֑ךָ וְשָׁ֗ב וְקִבֶּצְךָ֙ מִכׇּל־הָ֣עַמִּ֔ים אֲשֶׁ֧ר הֱפִֽיצְךָ֛ יְהֹוָ֥ה אֱלֹהֶ֖יךָ שָֽׁמָּה: אִם־יִהְיֶ֥ה נִֽדַּחֲךָ֖ בִּקְצֵ֣ה הַשָּׁמָ֑יִם מִשָּׁ֗ם יְקַבֶּצְךָ֙ יְהֹוָ֣ה אֱלֹהֶ֔יךָ וּמִשָּׁ֖ם יִקָּחֶֽךָ: וֶהֱבִיאֲךָ֞ יְהֹוָ֣ה אֱלֹהֶ֗יךָ אֶל־הָאָ֛רֶץ אֲשֶׁר־יָרְשׁ֥וּ אֲבֹתֶ֖יךָ וִֽירִשְׁתָּ֑הּ וְהֵיטִֽבְךָ֥ וְהִרְבְּךָ֖ מֵאֲבֹתֶֽיךָ: וְנֶאֱמַר עַל יְדֵי נְבִיאֶךָ: יְהֹוָ֥ה חׇנֵּ֖נוּ לְךָ֣ קִוִּ֑ינוּ הֱיֵ֤ה זְרֹעָם֙ לַבְּקָרִ֔ים אַף־יְשׁוּעָתֵ֖נוּ בְּעֵ֥ת צָרָֽה: וְנֶאֱמַר: וְעֵֽת־צָרָ֥ה הִיא֙ לְיַֽעֲקֹ֔ב וּמִמֶּ֖נָּה יִוָּשֵֽׁעַ: וְנֶאֱמַר: בְּֽכׇל־צָרָתָ֣ם ׀ ל֣וֹ צָ֗ר וּמַלְאַ֤ךְ פָּנָיו֙ הוֹשִׁיעָ֔ם בְּאַהֲבָת֥וֹ וּבְחֶמְלָת֖וֹ ה֣וּא גְאָלָ֑ם וַֽיְנַטְּלֵ֥ם וַֽיְנַשְּׂאֵ֖ם כׇּל־יְמֵ֥י עוֹלָֽם: וְנֶאֱמַר: (יכוין לי\"ג מדות/have intention for the thirteen attributes) מִי־אֵ֣ל כָּמ֗וֹךָ (אל) נֹשֵׂ֤א עָוֺן֙ (רחום) וְעֹבֵ֣ר עַל־פֶּ֔שַׁע (וחנון) לִשְׁאֵרִ֖ית נַחֲלָת֑וֹ (ארך) לֹֽא־הֶחֱזִ֤יק לָעַד֙ אַפּ֔וֹ (אפים) כִּֽי־חָפֵ֥ץ חֶ֖סֶד הֽוּא (ורב חסד): יָשׁ֣וּב יְרַחֲמֵ֔נוּ (ואמת) יִכְבֹּ֖שׁ עֲוֺנֹתֵ֑ינוּ (נצר חסד) וְתַשְׁלִ֛יךְ בִּמְצֻל֥וֹת יָ֖ם כׇּל־חַטֹּאותָֽם (לאלפים): תִּתֵּ֤ן אֱמֶת֙ לְיַֽעֲקֹ֔ב (נושא עון) חֶ֖סֶד לְאַבְרָהָ֑ם ופשע אֲשֶׁר־נִשְׁבַּ֥עְתָּ לַאֲבֹתֵ֖ינוּ (וחטאה) מִ֥ימֵי קֶֽדֶם (ונקה): וְנֶאֱמַר: וַהֲבִיאוֹתִ֞ים אֶל־הַ֣ר קׇדְשִׁ֗י וְשִׂמַּחְתִּים֙ בְּבֵ֣ית תְּפִלָּתִ֔י עוֹלֹתֵיהֶ֧ם וְזִבְחֵיהֶ֛ם לְרָצ֖וֹן עַֽל־מִזְבְּחִ֑י כִּ֣י בֵיתִ֔י בֵּית־תְּפִלָּ֥ה יִקָּרֵ֖א לְכׇל־הָעַמִּֽים: \n\n" +
			"אֵלּוּ דְבָרִים שֶׁאֵין לָהֶם שִׁעוּר: הַפֵּאָה, וְהַבִּכּוּרִים, וְהָרֵאָיוֹן, וּגְמִילוּת חֲסָדִים, וְתַלְמוּד תּוֹרָה: אֵלּוּ דְבָרִים שֶׁאָדָם עוֹשֶׂה אוֹתָם וְאוֹכֵל פֵּרוֹתֵיהֶם בָּעוֹלָם הַזֶּה, וְהַקֶּרֶן קַיֶּמֶת לָעוֹלָם הַבָּא: וְאֵלּוּ הֵן: כִּבּוּד אָב וָאֵם, וּגְמִילוּת חֲסָדִים, וּבִקּוּר חוֹלִים, וְהַכְנָסַת אוֹרְחִים, וְהַשְׁכָּמַת בֵּית הַכְּנֶסֶת, וַהֲבָאַת שָׁלוֹם בֵּין אָדָם לַחֲבֵרוֹ וּבֵין אִישׁ לְאִשְׁתוֹ וְתַלְמוּד תּוֹרָה כְּנֶגֶד כֻּלָּם. \n\n" +
			"לְעוֹלָם יְהֵא אָדָם יְרֵא שָׁמַיִם בַּסֵּתֶר כְּבַגָּלוּי, וּמוֹדֶה עַל הָאֱמֶת, וְדוֹבֵר אֱמֶת בִּלְבָבוֹ, וְיַשְׁכִּים וְיֹאמַר: רִבּוֹן הָעוֹלָמִים וַאֲדוֹנֵי הָאֲדוֹנִים, לֹא עַל צִּדְקוֹתֵינוּ אֲנַחְנוּ מַפִּילִים תַּחֲנוּנֵינוּ לְפָנֶיךָ כִּי עַל רַחֲמֶיךָ הָרַבִּים: אֲדֹנָ֤י ׀ שְׁמָ֙עָה֙ אֲדֹנָ֣י ׀ סְלָ֔חָה אֲדֹנָ֛י הַֽקְשִׁ֥יבָה וַעֲשֵׂ֖ה אַל־תְּאַחַ֑ר לְמַֽעַנְךָ֣ אֱלֹהַ֔י כִּֽי־שִׁמְךָ֣ נִקְרָ֔א עַל־עִירְךָ֖ וְעַל־עַמֶּֽךָ׃ מָה אֲנַחְנוּ, מַה חַיֵּינוּ, מַה חַסְדֵנוּ, מַה־צִּדְקוֹתֵינוּ, מַה־כֹּחֵנוּ, מַה־גְּבוּרָתֵנוּ. מַה נֹּאמַר לְפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, הֲלֹא כָּל־הַגִבּוֹרִים כְּאַיִן לְפָנֶיךָ, וְאַנְשֵׁי הַשֵּׁם כְּלֹא הָיוּ, וַחֲכָמִים כִּבְלִי מַדָּע, וּנְבוֹנִים כִּבְלִי הַשְׂכֵּל, כִּי כָל־מַעֲשֵֽׂינוּ תֹֽהוּ, וִימֵי חַיֵּינוּ הֶבֶֶל לְפָנֶיךָ, וּמוֹתַ֨ר הָאָדָ֤ם מִן־הַבְּהֵמָה֙ אָ֔יִן כִּ֥י הַכֹּ֖ל הָֽבֶל׃ לְבַד הַנְּשָׁמָה הַטְּהוֹרָה שֶׁהִיא עֲתִידָה לִתֵּן דִּין וְחֶשְׁבּוֹן לִפְנֵי כִסֵּא כְבוֹדֶךָ. וְכָל־הַגּוֹיִם כְּאַיִן נֶגְדֶּךָ, שֶׁנֶּאֱמַר: הֵ֤ן גּוֹיִם֙ כְּמַ֣ר מִדְּלִ֔י וּכְשַׁ֥חַק מֹאזְנַ֖יִם נֶחְשָׁ֑בוּ הֵ֥ן אִיִּ֖ים כַּדַּ֥ק יִטּֽוֹל׃ אֲבָל אֲנַחְנוּ עַמְּךָ בְּנֵי בְרִיתֶךָ, בְּנֵי אַבְרָהָם אֹהֲבֶךָ שֶׁנִּשְׁבַּעְתָּ־לוֹ בְּהַר הַמּוֹרִיָּה, זֶרַע יִצְחָק עֲקֵדֶךָ שֶׁנֶּעֱקַד עַל־גַּבֵּי הַמִּזְבֵּחַ, עֲדַת יַעֲקֹב בִּנְךָ בְכוֹרֶךָ, שֶׁמֵּאַהֲבָתְךָ שֶׁאָהַבְתָּ אוֹתוֹ, וּמִשִּׂמְחָתְךָ שֶׁשָּׂמַחְתָּ־בּוֹ, קָרָאתָ שֶׁמוֹ יִשְׂרָאֵל וִישֻׁרוּן: \n\n" +
			"לְפִיכָךְ אֲנַחְנוּ חַיָּבִים לְהוֹדוֹת לָךְ, וּלְשַׁבְּחָךְ וּלְפָאֲרָךְ וּלְרוֹמְמָךְ, וְלִתֵּן שִׁיר שֶׁבַח וְהוֹדָאָה לְשִׁמְךָ הַגָּדוֹל בְּכָל יוֹם תָּמִיד. אַשְׁרֵינוּ, מַה טוֹב חֶלְקֵינוּ, וּמַה נָעִים גּוֹרָלֵנוּ, וּמַה יָפָה מְאוֹד יְרוּשָׁתֵינוּ, אַשְׁרֵינוּ שֶׁאֲנַחְנוּ מַשְׁכִּימִים וּמַעֲרִיבִים בְּבָתֵּי כְּנֵסִיּוֹת וּבְבָתֵּי מִדְרָשׁוֹת וּמְיַחֲדִים שִׁמְךָ בְּכָל יוֹם תָּמִיד אוֹמְרִים פַּעֲמַיִם בְּאַהֲבָה:\n\nשְׁמַ֖ע יִשְׂרָאֵ֑ל יְהֹוָ֥ה אֱלֹהֵ֖ינוּ יְהֹוָ֥ה ׀ אֶחָֽד׃ \n\n" +
			"ואומר בלחש (say quietly) בָּרוּךְ, שֵׁם כְּבוֹד מַלְכוּתוֹ, לְעוֹלָם וָעֶד:");

		addInfoToSiddur("כשיגיע לקריאת שמע קודם פרשת התמיד יזהר לומר פסוקים שמע ישראל וברוך בכונה גדולה כמו קריאת שמע דיוצר (בא\"ח מקץ ה\"ז), ואם רואה שזמן קריאת שמע עובר יאמר כאן קריאת שמע כולה/One who is concerned that the time of Shema will pass by the time they will reach it with the blessing, it is proper for them to say Keriat Shema in full before Hodu, so that they will fulfill the obligation in its time",
                "\n\n" +
                        "נכון שיעשה תנאי, ויאמר: אם יעבור זמן קריאת שמע כשאגיע לקריאת שמע שלאחר ברכת אהבת עולם, אני מכוין לצאת ידי חובה בקריאת שמע שאני קורא עתה, ואם לא יעבור זמן קריאת שמע עד אז, תהיה קריאתי עתה כקורא בתורה, ואיני רוצה לצאת ידי חובה אלא בקריאת שמע שאקרא על סדר הברכות." +
                        "\n\n" + shema +
                        "יְהֹוָה אֱלֹהֵיכֶם אֱמֶת.");

		addToSiddur(
			"אַתָּה הוּא אֶחָד קוֹדֵם שֶׁבָּרָאתָ הָעוֹלָם, וְאַתָּה הוּא אֶחָד לְאַחַר שֶׁבָּרָאתָ הָעוֹלָם, אַתָּה הוּא אֵל בָּעוֹלָם הַזֶּה, וְאַתָּה הוּא אֵל בָּעוֹלָם הַבָּא, וְאַתָּה־ה֑וּא וּ֝שְׁנוֹתֶ֗יךָ לֹ֣א יִתָּֽמּוּ׃ קַדֵּשׁ שְׁמָךְ בְּעוֹלָמָךְ עַל־עַם מְקַדְּשֵׁי שְׁמֶךָ, וּבִישׁוּעָתְךָ מַלְכֵּנוּ תָּרוּם וְתַגְבִּיהַּ קַרְנֵנוּ, וְתוֹשִׁיעֵנוּ בְּקָרוֹב לְמַעַן שְׁמֶךָ, בָּרוּךְ הַמְקַדֵּשׁ שְׁמוֹ בָּרַבִּים: \n\n" +
			"אַתָּה הוּא יְהֹוָה הָאֱלֹהִים בַּשָּׁמַיִם מִמַּעַל וְעַל־הָאָרֶץ מִתַּחַת, בִּשְׁמֵי הַשָּׁמַיִם הָעֶלְיוֹנִים וְהַתַּחְתּוֹנִים, אַתָּה הוּא רִאשׁוֹן וְאַתָּה הוּא אַחֲרוֹן וּמִבַּלְעָדֶיךָ אֵין אֱלֹהִים. קַבֵּץ נְפוּצוֹת קֹוֶיךָ מֵאַרְבַּע כַּנְפוֹת הָאָרֶץ. יַכִּירוּ וְיֵדְעוּ כָּל בָּאֵי עוֹלָם כִּי אַתָּה הוּא הָאֱלֹהִים לְבַדְּךָ לְכָל מַמְלְכוֹת הָאָרֶץ, אַתָּה עָשִׂיתָ אֶת הַשָּׁמַיִם וְאֶת הָאָרֶץ, אֶת הַיָּם וְאֶת כָּל אֲשֶׁר בָּם, וּמִי בְּכָל מַעֲשֵׂה יָדֶיךָ בָּעֶלְיוֹנִים וּבַתַּחְתּוֹנִים שֶׁיֹּאמַר לָךְ מַה־תַּעֲשֶׂה וּמַה־תִּפְעָל. אָבִינוּ שֶׁבַּשָּׁמַיִם חַי וְקַיָּם, עֲשֵׂה עִמָּנוּ חֶסֶד בַּעֲבוּר כְּבוֹד שִׁמְךָ הַגָּדוֹל הַגִּבּוֹר וְהַנּוֹרָא שֶׁנִּקְרָא עָלֵינוּ, וְקַיֵּם לָנוּ יְהֹוָה אֱלֹהֵינוּ אֶת הַדָּבָר שֶׁהִבְטַחְתָּנוּ עַל יְדֵי צְפַנְיָה חוֹזָךְ כָּאָמוּר: בָּעֵ֤ת הַהִיא֙ אָבִ֣יא אֶתְכֶ֔ם וּבָעֵ֖ת קַבְּצִ֣י אֶתְכֶ֑ם כִּֽי־אֶתֵּ֨ן אֶתְכֶ֜ם לְשֵׁ֣ם וְלִתְהִלָּ֗ה בְּכֹל֙ עַמֵּ֣י הָאָ֔רֶץ בְּשׁוּבִ֧י אֶת־שְׁבוּתֵיכֶ֛ם לְעֵינֵיכֶ֖ם אָמַ֥ר יְהֹוָֽה: \n\n" +
			"יְהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ שֶׁתְּרַחֵם עָלֵינוּ, וְתִמְחוֹל לָנוּ אֶת כָּל חַטְּאוֹתֵינוּ, וּתְכַפֵּר לָנוּ אֶת־כָּל־עֲוֹנוֹתֵינוּ, וְתִמְחוֹל וְתִסְלַח לְכָל פְּשָׁעֵינוּ, וְתִּבְנֶה בֵּית הַמִּקְדָּשׁ בִּמְהֵרָה בְיָמֵינוּ, וְנַקְרִיב לְפָנֶיךָ קָרְבַּן הַתָּמִיד שֶׁיְּכַפֵּר בַּעֲדֵינוּ, כְּמוֹ שֶׁכָּתַבְתָּ עָלֵינוּ בְּתוֹרָתָךְ עַל יְדֵי מֹשֶׁה עַבְדָּךְ כָּאָמוּר: \n\n" +
			"וַיְדַבֵּ֥ר יְהֹוָ֖ה אֶל־מֹשֶׁ֥ה לֵּאמֹֽר׃ צַ֚ו אֶת־בְּנֵ֣י יִשְׂרָאֵ֔ל וְאָמַרְתָּ֖ אֲלֵהֶ֑ם אֶת־קׇרְבָּנִ֨י לַחְמִ֜י לְאִשַּׁ֗י רֵ֚יחַ נִֽיחֹחִ֔י תִּשְׁמְר֕וּ לְהַקְרִ֥יב לִ֖י בְּמוֹעֲדֽוֹ׃ וְאָמַרְתָּ֣ לָהֶ֔ם זֶ֚ה הָֽאִשֶּׁ֔ה אֲשֶׁ֥ר תַּקְרִ֖יבוּ לַיהֹוָ֑ה כְּבָשִׂ֨ים בְּנֵֽי־שָׁנָ֧ה תְמִימִ֛ם שְׁנַ֥יִם לַיּ֖וֹם עֹלָ֥ה תָמִֽיד׃ אֶת־הַכֶּ֥בֶשׂ אֶחָ֖ד תַּעֲשֶׂ֣ה בַבֹּ֑קֶר וְאֵת֙ הַכֶּ֣בֶשׂ הַשֵּׁנִ֔י תַּעֲשֶׂ֖ה בֵּ֥ין הָֽעַרְבָּֽיִם׃ וַעֲשִׂירִ֧ית הָאֵיפָ֛ה סֹ֖לֶת לְמִנְחָ֑ה בְּלוּלָ֛ה בְּשֶׁ֥מֶן כָּתִ֖ית רְבִיעִ֥ת הַהִֽין׃ עֹלַ֖ת תָּמִ֑יד הָעֲשֻׂיָה֙ בְּהַ֣ר סִינַ֔י לְרֵ֣יחַ נִיחֹ֔חַ אִשֶּׁ֖ה לַֽיהֹוָֽה׃ וְנִסְכּוֹ֙ רְבִיעִ֣ת הַהִ֔ין לַכֶּ֖בֶשׂ הָאֶחָ֑ד בַּקֹּ֗דֶשׁ הַסֵּ֛ךְ נֶ֥סֶךְ שֵׁכָ֖ר לַיהֹוָֽה׃ וְאֵת֙ הַכֶּ֣בֶשׂ הַשֵּׁנִ֔י תַּעֲשֶׂ֖ה בֵּ֣ין הָֽעַרְבָּ֑יִם כְּמִנְחַ֨ת הַבֹּ֤קֶר וּכְנִסְכּוֹ֙ תַּעֲשֶׂ֔ה אִשֵּׁ֛ה רֵ֥יחַ נִיחֹ֖חַ לַיהֹוָֽה׃");
		addPitumHaketoret();
		addToSiddur(
			"אַבַּיֵּי (יפסיק מעט/break) הֲוָה מְסַדֵּר סֵדֶר הַמַּעֲרָכָה מִשְּׁמָא דִגְמָרָא, וְאַלִבָּא דְאַבָּא שָׁאוּל. מַעֲרָכָה גְּדוֹלָה קוֹדֶמֶת לְמַעֲרָכָה שְׁנִיָּה שֶׁל קְטֹרֶת, וּמַעֲרָכָה שְׁנִיָּה שֶׁל קְטֹרֶת קוֹדֶמֶת לְסִדּוּר שְׁנֵי גְזִירֵי עֵצִים, וְסִדּוּר שְׁנֵי גְזִירֵי עֵצִים קוֹדֵם לְדִישּׁוּן מִזְבַּח הַפְּנִימִי, וְדִישּׁוּן מִזְבַּח הַפְּנִימִי קוֹדֵם לַהֲטָבַת חָמֵשׁ נֵרוֹת, וַהֲטָבַת חָמֵשׁ נֵרוֹת קוֹדֶמֶת לְדַם הַתָּמִיד, וְדַם הַתָּמִיד קוֹדֵם לַהֲטָבַת שְׁתֵּי נֵרוֹת, וַהֲטָבַת שְׁתֵּי נֵרוֹת קוֹדֶמֶת לִקְטֹרֶת, וּקְטֹרֶת לְאֵבָרִים, וְאֵבָרִים לְמִנְחָה, וּמִנְחָה לַחֲבִיתִּין, וַחֲבִיתִּין לִנְסָכִין, וּנְסָכִין לְמוּסָפִין, וּמוּסָפִין לְבָזִיכִין, וּבָזִיכִין קוֹדְמִין לְתָמִיד שֶׁל בֵּין הָעַרְבָּיִם, שֶׁנֶּאֱמַר: וְעָרַ֤ךְ עָלֶ֙יהָ֙ הָֽעֹלָ֔ה וְהִקְטִ֥יר עָלֶ֖יהָ חֶלְבֵ֥י הַשְּׁלָמִֽים: עָלֶיהָ הַשְׁלֵם כָּל הַקָּרְבָּנוֹת כֻּלָּם:");

		for (String singleAnah : anaBekoach) {
			addToSiddur(singleAnah);
		}

		addToSiddur(
			"בָּרוּךְ, שֵׁם כְּבוֹד מַלְכוּתוֹ, לְעוֹלָם וָעֶד: \n\n" +
			"רִבּוֹן הָעוֹלָמִים, אַתָּה צִוִיתָנוּ לְהַקְרִיב קָרְבַּן הַתָּמִיד בְּמוֹעֲדוֹ, וְלִהְיוֹת כֹּהֲנִים בַּעֲבוֹדָתָם, וּלְוִיִּם בְּדוּכָנָם, וְיִשְׂרָאֵל בְּמַעֲמָדָם. וְעַתָּה בַּעֲווֹנוֹתֵינוּ חָרַב בֵּית הַמִּקְדָּשׁ וּבֻטַּל הַתָּמִיד, וְאֵין לָנוּ לֹא כֹּהֵן בַּעֲבוֹדָתוֹ וְלֹא לֵוִי בְּדוּכָנוֹ, וְלֹא יִשְׂרָאֵל בְּמַעֲמָדוֹ, וְאַתָּה אָמַרְתָּ: וּֽנְשַׁלְּמָ֥ה פָרִ֖ים שְׂפָתֵֽינוּ: \n\n" +
			"לָכֵן יְהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, שֶׁיְּהֵא שִׂיחַ שִׂפְתוֹתֵינוּ זֶה חָשׁוּב וּמְקֻבָּל וּמְרוּצֶה לְפָנֶיךָ כְּאִילוּ הִקְרַבְנוּ קָרְבַּן הַתָּמִיד בְּמוֹעֲדוֹ וְעָמַדְנוּ עַל מַעֲמָדוֹ, כְּמוֹ שֶׁנֶּאֱמַר: וּֽנְשַׁלְּמָ֥ה פָרִ֖ים שְׂפָתֵֽינוּ׃ וְנֶאֱמַר: וְשָׁחַ֨ט אֹת֜וֹ עַ֣ל יֶ֧רֶךְ הַמִּזְבֵּ֛חַ צָפֹ֖נָה לִפְנֵ֣י יְהֹוָ֑ה וְזָרְק֡וּ בְּנֵי֩ אַהֲרֹ֨ן הַכֹּהֲנִ֧ים אֶת־דָּמ֛וֹ עַל־הַמִּזְבֵּ֖חַ סָבִֽיב: וְנֶאֱמַר: זֹ֣את הַתּוֹרָ֗ה לָֽעֹלָה֙ לַמִּנְחָ֔ה וְלַֽחַטָּ֖את וְלָאָשָׁ֑ם וְלַ֨מִּלּוּאִ֔ים וּלְזֶ֖בַח הַשְּׁלָמִֽים: \n\n" +
			"אֵיזֶהוּ מְקוֹמָן שֶׁל זְבָחִים, קָדְשֵׁי קָדָשִׁים שְׁחִיטָתָן בַּצָּפוֹן, פַּר וְשָׂעִיר שֶׁל יוֹם הַכִּפּוּרִים שְׁחִיטָתָן בַּצָּפון, וְקִבּוּל דָּמָן בִּכְלֵי שָׁרֵת בַּצָּפוֹן, וְדָמָן טָעוּן הַזָּיָה עַל בֵּין הַבַּדִּים וְעַל הַפָּרֹכֶת וְעַל מִזְבַּח הַזָּהָב. מַתָּנָה אַחַת מֵהֶן מְעַכֶּבֶת. שִׁיְּירֵי הַדָּם הָיָה שׁוֹפֵךְ עַל יְסוֹד מַעֲרָבִי שֶׁל מִזְבֵּחַ הַחִיצוֹן. אִם לֹא נָתַן, לֹא עִכֵּב: \n\n" +
			"פָּרִים הַנִּשְׂרָפִים וּשְׂעִירִים הַנִּשְׂרָפִים שְׁחִיטָתָן בַּצָּפוֹן, וְקִבּוּל דָּמָן בִּכְלֵי שָׁרֵת בַּצָּפוֹן, וְדָמָן טָעוּן הַזָּיָה עַל הַפָּרֹכֶת וְעַל מִזְבַּח הַזָּהָב. מַתָּנָה אַחַת מֵהֶן מְעַכֶּבֶת. שִׁיְרֵי הַדָּם הָיָה שׁוֹפֵךְ עַל יְסוֹד מַעֲרָבִי שֶׁל מִזְבַּח הַחִיצוֹן. אִם לֹא נָתַן, לֹא עִכֵּב. אֵלּוּ וְאֵלּוּ נִשְׂרָפִין בְּבֵית הַדָּשֶׁן: \n\n" +
			"חַטֹּאת הַצִּבּוּר וְהַיָּחִיד. אֵלּוּ הֵן חַטֹּאת הַצִּבּוּר, שְׂעִירֵי רָאשֵׁי חֳדָשִׁים וְשֶׁל מוֹעֲדוֹת, שְׁחִיטָתָן בַּצָּפוֹן, וְקִבּוּל דָּמָן בִּכְלֵי שָׁרֵת בַּצָּפוֹן, וְדָמָן טָעוּן אַרְבַּע מַתָּנוֹת עַל אַרְבַּע קְרָנוֹת, כֵּיצַד, עָלָה בַכֶּבֶשׁ וּפָנָה לַסּוֹבֵב, וּבָא לוֹ לְקֶרֶן דְּרוֹמִית מִזְרָחִית, מִזְרָחִית צְפוֹנִית, צְפוֹנִית מַעֲרָבִית, מַעֲרָבִית דְּרוֹמִית. שְׁיָרֵי הַדָּם הָיָה שׁוֹפֵךְ עַל יְסוֹד דְרוֹמִי, וְנֶאֱכָלִין לִפָנִים מִן הַקְּלָעִים לְזִכְרֵי כְהֻנָּה בְּכָל מַאֲכָל לְיוֹם וָלַיְלָה עַד חֲצוֹת: \n\n" +
			"הָעוֹלָה, קֹדֶשׁ קָדָשִׁים, שְׁחִיטָתָהּ בַּצָּפוֹן, וְקִבּוּל דָּמָהּ בִּכְלֵי שָׁרֵת בַּצָּפוֹן, וְדָמָהּ טָעוּן שְׁתֵּי מַתָּנוֹת שֶׁהֵן אַרְבַּע, וּטְעוּנָה הֶפְשֵׁט וְנִתּוּחַ וְכָלִיל לָאִשִּׁים: \n\n" +
			"זִבְחֵי שַׁלְמֵי צִבּוּר וַאֲשָׁמוֹת. אֵלּוּ הֵן אֲשָׁמוֹת, אָשָׁם גְּזֵלוֹת, אָשָׁם מְעִילוֹת, אָשָׁם שִׁפְחָה חֲרוּפָה, אָשָׁם נָזִיר, אָשָׁם מְצוֹרָע, אָשָׁם תָּלוּי, שְׁחִיטָתָן בַּצָּפוֹן, וְקִבּוּל דָּמָן בִּכְלִי שָׁרֵת בַּצָּפוֹן, וְדָמָן טָעוּן שְׁתֵּי מַתָּנוֹת שֶׁהֵן אַרְבַּע, וְנֶאֱכָלִין לְפָנִים מִן הַקְּלָעִים לְזִכְרֵי כְהֻנָּה בְּכָל מַאֲכָל לְיוֹם וָלַיְלָה עַד חֲצוֹת: \n\n" +
			"הַתּוֹדָה וְאֵיל נָזִיר, קָדָשִׁים קַלִּים, שְׁחִיטָתָן בְּכָל מָקוֹם בָּעֲזָרָה, וְדָמָן טָעוּן שְׁתֵּי מַתָּנוֹת שֶׁהֵן אַרְבַּע, וְנֶאֱכָלִין בְּכָל הָעִיר, לְכָל אָדָם, בְּכָל מַאֲכָל, לְיוֹם וָלַיְלָה עַד חֲצוֹת. הַמּוּרָם מֵהֶם כַּיּוֹצֵא בָהֶם, אֶלָּא שֶׁהַמּוּרָם נֶאֱכָל לַכֹּהֲנִים לִנְשֵׁיהֶם וְלִבְנֵיהֶם וּלְעַבְדֵיהֶם: \n\n" +
			"שְׁלָמִים, קָדָשִׁים קַלִּים, שְׁחִיטָתָן בְּכָל מָקוֹם בָּעֲזָרָה, וְדָמָן טָעוּן שְׁתֵּי מַתָּנוֹת שֶׁהֵן אַרְבַּע, וְנֶאֱכָלִין בְּכָל הָעִיר לְכָל אָדָם בְּכָל מַאֲכָל לִשְׁנֵי יָמִים וָלַיְלָה אֶחָד. הַמּוּרָם מֵהֶם כַּיּוֹצֵא בָּהֶם, אֶלָּא שֶׁהַמּוּרָם נֶאֱכָל לַכֹּהֲנִים, לִנְשֵׁיהֶם וְלִבְנֵיהֶם וּלְעַבְדֵיהֶם: \n\n" +
			"הַבְּכוֹר וְהַמַּעֲשֵׂר וְהַפֶּסַח, קָדָשִׁים קַלִּים, שְׁחִיטָתָן בְּכָל מָקוֹם בָּעֲזָרָה, וְדָמָן טָעוּן מַתָּנָה אַחַת, וּבִלְבָד שֶׁיִּתֵּן כְּנֶגֶד הַיְסוֹד. שִׁנָּה בַאֲכִילָתָן, הַבְּכוֹר נֶאֱכָל לַכֹּהֲנִים, וְהַמַּעֲשֵׂר לְכָל אָדָם, וְנֶאֱכָלִין בְּכָל הָעִיר לְכָל אָדָם בְּכָל מַאֲכָל לִשְׁנֵי יָמִים וָלַיְלָה אֶחָד. הַפֶּסַח אֵינוֹ נֶאֱכָל אֶלָּא בַלַּיְלָה, וְאֵינוֹ נֶאֱכָל אֶלָּא עַד חֲצוֹת, וְאֵינוֹ נֶאֱכָל אֶלָּא לִמְנוּיָו, וְאֵינוֹ נֶאֱכָל אֶלָּא צָלִי: \n\n" +
			"רִבִּי יִשְׁמָעֵאל אוֹמֵר: בִּשְׁלֹשׁ עֶשְׂרֵה מִדּוֹת הַתּוֹרָה נִדְרֶשֶׁת: מִקַּל וָחוֹמֶר, מִגְּזֵרָה שָׁוֶה, מִבִּנְיַן אָב וְכָתוּב אֶחָד, וּמִבִּנְיַן אָב וּשְׁנֵי כְתוּבִים, מִכְּלָל וּפְרָט, מִפְּרָט וּכְלָל, כְּלָל וּפְרָט וּכְלָל, אֵי אַתָּה דָן אֶלָּא כְּעֵין הַפְּרָט, מִכְּלָל שֶׁהוּא צָרִיךְ לִפְרָט, וּמִפְּרָט שֶׁהוּא צָרִיךְ לִכְלַל, וְכָל דָּבָר שֶׁהָיָה בִכְלָל וְיָצָא מִן הַכְּלָל לְלַמֵּד, לֹא לְלַמֵּד עַל עַצְמוֹ יָצָא, אֶלָּא לְלַמֵּד עַל הַכְּלָל כֻּלּוֹ יָצָא, וְכָל דָּבָר שֶׁהָיָה בִכְלָל, וְיָצָא לִטְעוֹן טָעוּן אַחֵר שֶׁהוּא כְעִנְיָנוֹ, יָצָא לְהָקֵל וְלֹא לְהַחְמִיר, וְכָל דָּבָר שֶׁהָיָה בִּכְלָל, וְיָצָא לִטְעֹן טָעוּן אַחֵר שֶׁלֹּא כְעִנְיָנוֹ, יָצָא לְהָקֵל וּלְהַחְמִיר, וְכָל דָּבָר שֶׁהָיָה בִּכְלָל, וְיָצָא לִדּוֹן בְּדָבָר חָדָשׁ, אֵי אַתָּה יָכוֹל לְהַחֲזִירוֹ לִכְלָלוֹ עַד שֶׁיַּחֲזִירֶנּוּ הַכָּתוּב לִכְלָלוֹ בְפֵירוּשׁ, וְדָבָר הַלָּמֵד מֵעִנְיָנוֹ, וְדָבָר הַלָּמֵד מִסּוֹפוֹ, וְכַן שְׁנֵי כְתוּבִים הַמַּכְחִישִׁים זֶה אֶת זֶה, עַד שֶׁיָּבֹא הַכָּתוּב הַשְּׁלִישִׁי וְיַכְרִיעַ בְּנֵיהֶם: \n\n" +
			"יְהוּדָה בֶּן תֵּימָא אוֹמֵר, הֱוֵי עַז כַּנָּמֵר, וְקַל כַּנֶּשֶׁר, וְרָץ כַּצְּבִי, וְגִבּוֹר כַּאֲרִי לַעֲשׂוֹת רְצוֹן אָבִיךָ שֶׁבַּשָּׁמַיִם. הוּא הָיָה אוֹמֵר, עַז פָּנִים לַגֵּיהִנָּם, וּבוֹשֶׁת פָּנִים לְגַן עֵדֶן: \n\n" +
			"יְהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, שֶׁתִּבְנֶה בֵּית הַמִּקְדָּשׁ בִּמְהֵרָה בְיָמֵינוּ, וְתֵן חֶלְקֵנוּ בְּתוֹרָתָךְ, לַעֲשׂוֹת חֻקֵּי רְצוֹנָךְ, וּלְעָבְדָךְ בְּלֵבָב שָׁלֵם: \n\n" +
			"ואומרים כאן קדיש \"על ישראל\" (Kaddish Al Yisrael is said here)"); // Ketoret
		addKaddishAlYisrael();

		addCategoryToSiddur("הודו");

		addToSiddur(
			"הוֹד֤וּ לַֽיהֹוָה֙ קִרְא֣וּ בִשְׁמ֔וֹ הוֹדִ֥יעוּ בָעַמִּ֖ים עֲלִילֹתָֽיו׃ שִׁ֤ירוּ לוֹ֙ זַמְּרוּ־ל֔וֹ שִׂ֖יחוּ בְּכׇל־נִפְלְאֹתָֽיו׃ הִֽתְהַלְלוּ֙ בְּשֵׁ֣ם קׇדְשׁ֔וֹ יִשְׂמַ֕ח לֵ֖ב מְבַקְשֵׁ֥י יְהֹוָֽה׃ דִּרְשׁ֤וּ יְהֹוָה֙ וְעֻזּ֔וֹ בַּקְּשׁ֥וּ פָנָ֖יו תָּמִֽיד׃ זִכְר֗וּ נִפְלְאֹתָיו֙ אֲשֶׁ֣ר עָשָׂ֔ה מֹפְתָ֖יו וּמִשְׁפְּטֵי־פִֽיהוּ׃ זֶ֚רַע יִשְׂרָאֵ֣ל עַבְדּ֔וֹ בְּנֵ֥י יַעֲקֹ֖ב בְּחִירָֽיו: ה֚וּא יְהֹוָ֣ה אֱלֹהֵ֔ינוּ בְּכׇל־הָאָ֖רֶץ מִשְׁפָּטָֽיו׃ זִכְר֤וּ לְעוֹלָם֙ בְּרִית֔וֹ דָּבָ֥ר צִוָּ֖ה לְאֶ֥לֶף דּֽוֹר׃ אֲשֶׁ֤ר כָּרַת֙ אֶת־אַבְרָהָ֔ם וּשְׁבוּעָת֖וֹ לְיִצְחָֽק׃ וַיַּעֲמִידֶ֤הָ לְיַֽעֲקֹב֙ לְחֹ֔ק לְיִשְׂרָאֵ֖ל בְּרִ֥ית עוֹלָֽם׃ לֵאמֹ֗ר לְךָ֙ אֶתֵּ֣ן אֶֽרֶץ־כְּנָ֔עַן חֶ֖בֶל נַחֲלַתְכֶֽם׃ בִּהְיֽוֹתְכֶם֙ מְתֵ֣י מִסְפָּ֔ר כִּמְעַ֖ט וְגָרִ֥ים בָּֽהּ׃ וַיִּֽתְהַלְּכוּ֙ מִגּ֣וֹי אֶל־גּ֔וֹי וּמִמַּמְלָכָ֖ה אֶל־עַ֥ם אַחֵֽר׃ לֹֽא־הִנִּ֤יחַ לְאִישׁ֙ לְעׇשְׁקָ֔ם וַיּ֥וֹכַח עֲלֵיהֶ֖ם מְלָכִֽים׃ אַֽל־תִּגְּעוּ֙ בִּמְשִׁיחָ֔י וּבִנְבִיאַ֖י אַל־תָּרֵֽעוּ׃ \n\n" +
			"שִׁ֤ירוּ לַֽיהֹוָה֙ כׇּל־הָאָ֔רֶץ בַּשְּׂר֥וּ מִיּֽוֹם־אֶל־י֖וֹם יְשׁוּעָתֽוֹ׃ סַפְּר֤וּ בַגּוֹיִם֙ אֶת־כְּבוֹד֔וֹ בְּכׇל־הָעַמִּ֖ים נִפְלְאֹתָֽיו׃ כִּי֩ גָד֨וֹל יְהֹוָ֤ה וּמְהֻלָּל֙ מְאֹ֔ד וְנוֹרָ֥א ה֖וּא עַל־כׇּל־אֱלֹהִֽים׃ כִּ֠י כׇּל־אֱלֹהֵ֤י הָֽעַמִּים֙ אֱלִילִ֔ים (יפסיק מעט/break) וַיהֹוָ֖ה שָׁמַ֥יִם עָשָֽׂה׃ ה֤וֹד וְהָדָר֙ לְפָנָ֔יו עֹ֥ז וְחֶדְוָ֖ה בִּמְקֹמֽוֹ׃ הָב֤וּ לַֽיהֹוָה֙ מִשְׁפְּח֣וֹת עַמִּ֔ים הָב֥וּ לַיהֹוָ֖ה כָּב֥וֹד וָעֹֽז׃ הָב֥וּ לַֽיהֹוָ֖ה כְּב֣וֹד שְׁמ֑וֹ שְׂא֤וּ מִנְחָה֙ וּבֹ֣אוּ לְפָנָ֔יו הִשְׁתַּחֲו֥וּ לַֽיהֹוָ֖ה בְּהַדְרַת־קֹֽדֶשׁ׃ חִ֤ילוּ מִלְּפָנָיו֙ כׇּל־הָאָ֔רֶץ אַף־תִּכּ֥וֹן תֵּבֵ֖ל בַּל־תִּמּֽוֹט׃ יִשְׂמְח֤וּ הַשָּׁמַ֙יִם֙ וְתָגֵ֣ל הָאָ֔רֶץ וְיֹאמְר֥וּ בַגּוֹיִ֖ם יְהֹוָ֥ה מָלָֽךְ׃ יִרְעַ֤ם הַיָּם֙ וּמְלוֹא֔וֹ יַעֲלֹ֥ץ הַשָּׂדֶ֖ה וְכׇל־אֲשֶׁר־בּֽוֹ׃ אָ֥ז יְרַנְּנ֖וּ עֲצֵ֣י הַיָּ֑עַר מִלִּפְנֵ֣י יְהֹוָ֔ה כִּי־בָ֖א לִשְׁפּ֥וֹט אֶת־הָאָֽרֶץ׃ הוֹד֤וּ לַֽיהֹוָה֙ כִּ֣י ט֔וֹב כִּ֥י לְעוֹלָ֖ם חַסְדּֽוֹ׃ וְאִמְר֕וּ הוֹשִׁיעֵ֙נוּ֙ אֱלֹהֵ֣י יִשְׁעֵ֔נוּ וְקַבְּצֵ֥נוּ וְהַצִּילֵ֖נוּ מִן־הַגּוֹיִ֑ם לְהֹדוֹת֙ לְשֵׁ֣ם קׇדְשֶׁ֔ךָ לְהִשְׁתַּבֵּ֖חַ בִּתְהִלָּתֶֽךָ׃ בָּר֤וּךְ יְהֹוָה֙ אֱלֹהֵ֣י יִשְׂרָאֵ֔ל מִן־הָעוֹלָ֖ם וְעַ֣ד הָעֹלָ֑ם וַיֹּאמְר֤וּ כׇל־הָעָם֙ אָמֵ֔ן וְהַלֵּ֖ל לַיהֹוָֽה׃ \n\n" +
			"רוֹמְמ֡וּ יְהֹ֘וָ֤ה אֱלֹהֵ֗ינוּ וְֽ֭הִשְׁתַּחֲווּ לַהֲדֹ֥ם רַגְלָ֗יו קָד֥וֹשׁ הֽוּא: רוֹמְמ֡וּ יְהֹ֘וָ֤ה אֱלֹהֵ֗ינוּ וְֽ֭הִשְׁתַּחֲווּ לְהַ֣ר קׇדְשׁ֑וֹ כִּי־קָ֝ד֗וֹשׁ יְהֹוָ֥ה אֱלֹהֵֽינוּ: וְהוּא רַחוּם יְכַפֵּר עָוֹן וְלֹא יַשְׁחִית וְהִרְבָּה לְהָשִׁיב אַפּוֹ וְלֹא יָעִיר כָּל חֲמָתוֹ: אַתָּ֤ה יְהֹוָ֗ה לֹֽא־תִכְלָ֣א רַחֲמֶ֣יךָ מִמֶּ֑נִּי חַסְדְּךָ֥ וַ֝אֲמִתְּךָ֗ תָּמִ֥יד יִצְּרֽוּנִי: זְכֹר־רַחֲמֶ֣יךָ יְ֭הֹוָה וַחֲסָדֶ֑יךָ כִּ֖י מֵעוֹלָ֣ם הֵֽמָּה: תְּנ֥וּ עֹ֗ז לֵאלֹ֫הִ֥ים עַֽל־יִשְׂרָאֵ֥ל גַּאֲוָת֑וֹ וְ֝עֻזּ֗וֹ בַּשְּׁחָקִֽים: נ֤וֹרָ֥א אֱלֹהִ֗ים מִֽמִּקְדָּ֫שֶׁ֥יךָ אֵ֤ל יִשְׂרָאֵ֗ל ה֤וּא נֹתֵ֨ן ׀ עֹ֖ז וְתַעֲצֻמ֥וֹת לָעָ֗ם בָּר֥וּךְ אֱלֹהִֽים: \n\n" +
			"אֵל־נְקָמ֥וֹת יְהֹוָ֑ה אֵ֖ל נְקָמ֣וֹת הוֹפִֽיעַ: הִ֭נָּשֵׂא שֹׁפֵ֣ט הָאָ֑רֶץ הָשֵׁ֥ב גְּ֝מ֗וּל עַל־גֵּאִֽים: לַֽיהֹוָ֥ה הַיְשׁוּעָ֑ה עַֽל־עַמְּךָ֖ בִרְכָתֶ֣ךָ סֶּֽלָה: יְהֹוָ֣ה צְבָא֣וֹת עִמָּ֑נוּ מִשְׂגָּֽב־לָ֨נוּ אֱלֹהֵ֖י יַֽעֲקֹ֣ב סֶֽלָה׃ יְהֹוָ֥ה צְבָא֑וֹת אַֽשְׁרֵ֥י אָ֝דָ֗ם בֹּטֵ֥חַ בָּֽךְ׃ יְהֹוָ֥ה הוֹשִׁ֑יעָה הַ֝מֶּ֗לֶךְ יַעֲנֵ֥נוּ בְיוֹם־קׇרְאֵֽנוּ: הוֹשִׁ֤יעָה ׀ אֶת־עַמֶּ֗ךָ וּבָרֵ֥ךְ אֶת־נַחֲלָתֶ֑ךָ וּֽרְעֵ֥ם וְ֝נַשְּׂאֵ֗ם עַד־הָעוֹלָֽם: נַ֭פְשֵׁנוּ חִכְּתָ֣ה לַֽיהֹוָ֑ה עֶזְרֵ֖נוּ וּמָגִנֵּ֣נוּ הֽוּא: כִּי־ב֭וֹ יִשְׂמַ֣ח לִבֵּ֑נוּ כִּ֤י בְשֵׁ֖ם קׇדְשׁ֣וֹ בָטָֽחְנוּ: יְהִי־חַסְדְּךָ֣ יְהֹוָ֣ה עָלֵ֑ינוּ כַּ֝אֲשֶׁ֗ר יִחַ֥לְנוּ לָֽךְ: הַרְאֵ֣נוּ יְהֹוָ֣ה חַסְדֶּ֑ךָ וְ֝יֶשְׁעֲךָ֗ תִּתֶּן־לָֽנוּ: ק֭וּמָֽה עֶזְרָ֣תָה לָּ֑נוּ וּ֝פְדֵ֗נוּ לְמַ֣עַן חַסְדֶּֽךָ: אָֽנֹכִ֨י ׀ יְהֹ֘וָ֤ה אֱלֹהֶ֗יךָ הַֽ֭מַּעַלְךָ מֵאֶ֣רֶץ מִצְרָ֑יִם הַרְחֶב־פִּ֗֝יךָ וַאֲמַלְאֵֽהוּ: אַשְׁרֵ֣י הָ֭עָם שֶׁכָּ֣כָה לּ֑וֹ אַֽשְׁרֵ֥י הָ֝עָ֗ם שֱׁיְהֹוָ֥ה אֱלֹהָֽיו: וַאֲנִ֤י ׀ בְּחַסְדְּךָ֣ בָטַחְתִּי֮ יָ֤גֵ֥ל לִבִּ֗י בִּֽישׁוּעָ֫תֶ֥ךָ אָשִׁ֥ירָה לַֽיהֹוָ֑ה כִּ֖י גָמַ֣ל עָלָֽי: \n\n" +
			"אֲרוֹמִמְךָ֣ יְ֭הֹוָה כִּ֣י דִלִּיתָ֑נִי וְלֹֽא־שִׂמַּ֖חְתָּ אֹיְבַ֣י לִֽי׃ יְהֹוָ֥ה אֱלֹהָ֑י שִׁוַּ֥עְתִּי אֵ֝לֶ֗יךָ וַתִּרְפָּאֵֽנִי׃ יְֽהֹוָ֗ה הֶעֱלִ֣יתָ מִן־שְׁא֣וֹל נַפְשִׁ֑י חִ֝יִּיתַ֗נִי מִיׇּֽרְדִי־בֽוֹר׃ זַמְּר֣וּ לַיהֹוָ֣ה חֲסִידָ֑יו וְ֝הוֹד֗וּ לְזֵ֣כֶר קׇדְשֽׁוֹ׃ כִּ֤י רֶ֨גַע ׀ בְּאַפּוֹ֮ חַיִּ֢ים בִּרְצ֫וֹנ֥וֹ בָּ֭עֶרֶב יָלִ֥ין בֶּ֗כִי וְלַבֹּ֥קֶר רִנָּֽה׃ וַ֭אֲנִי אָמַ֣רְתִּי בְשַׁלְוִ֑י בַּל־אֶמּ֥וֹט לְעוֹלָֽם׃ יְֽהֹוָ֗ה בִּרְצוֹנְךָ֮ הֶעֱמַ֢דְתָּה לְֽהַרְרִ֫י עֹ֥ז הִסְתַּ֥רְתָּ פָנֶ֗יךָ הָיִ֥יתִי נִבְהָֽל׃ אֵלֶ֣יךָ יְהֹוָ֣ה אֶקְרָ֑א וְאֶל־אֲ֝דֹנָ֗י אֶתְחַנָּֽן׃ מַה־בֶּ֥צַע בְּדָמִי֮ בְּרִדְתִּ֢י אֶ֫ל שָׁ֥חַת הֲיוֹדְךָ֥ עָפָ֑ר הֲיַגִּ֥יד אֲמִתֶּֽךָ׃ שְׁמַע־יְהֹוָ֥ה וְחׇנֵּ֑נִי יְ֝הֹוָ֗ה הֱֽיֵה־עֹזֵ֥ר לִֽי׃ הָפַ֣כְתָּ מִסְפְּדִי֮ לְמָח֢וֹל לִ֥י פִּתַּ֥חְתָּ שַׂקִּ֑י וַֽתְּאַזְּרֵ֥נִי שִׂמְחָֽה׃ לְמַ֤עַן ׀ יְזַמֶּרְךָ֣ כָ֭בוֹד וְלֹ֣א יִדֹּ֑ם (יפסיק מעט/break) יְהֹוָ֥ה אֱ֝לֹהַ֗י לְעוֹלָ֥ם אוֹדֶֽךָּ:");// Hodu

		if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()
		 || jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
			addToSiddurHighlighted(
				"בעשרת ימי תשובה והושענא רבה אומרים \n\n" +
				"יְהֹוָה֙ ה֣וּא הָאֱלֹהִ֔ים יְהֹוָ֖ה ה֥וּא הָאֱלֹהִֽים׃ שתי פעמים/twice  ");
		}

		addToSiddur(
			"עומדים ואומרים  (Stand and say)\n\n" +
			"יְהֹוָה מֶֽלֶךְ, יְהֹוָה מָלָֽךְ יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד:  שתי פעמים/(twice) \n\n" +
			"וְהָיָ֧ה יְהֹוָ֛ה לְמֶ֖לֶךְ עַל־כׇּל־הָאָ֑רֶץ בַּיּ֣וֹם הַה֗וּא יִהְיֶ֧ה יְהֹוָ֛ה אֶחָ֖ד וּשְׁמ֥וֹ אֶחָֽד: \n\n" +
			"הוֹשִׁיעֵ֨נוּ ׀ יְהֹ֘וָ֤ה אֱלֹהֵ֗ינוּ וְקַבְּצֵנוּ֮ מִֽן־הַגּ֫וֹיִ֥ם לְ֭הֹדוֹת לְשֵׁ֣ם קׇדְשֶׁ֑ךָ לְ֝הִשְׁתַּבֵּ֗חַ בִּתְהִלָּתֶֽךָ: בָּ֤רֽוּךְ יְהֹוָ֨ה אֱלֹהֵ֪י יִשְׂרָאֵ֡ל מִן־הָ֤עוֹלָ֨ם ׀ וְעַ֬ד הָעוֹלָ֗ם וְאָמַ֖ר כׇּל־הָעָ֥ם אָמֵ֗ן הַֽלְלוּיָֽהּ: כֹּ֣ל הַ֭נְּשָׁמָה תְּהַלֵּ֥ל יָ֗הּ הַֽלְלוּיָֽהּ:\n\n" +
			menorah);

		addCategoryToSiddur("פסוקי דזמרה");

		addToSiddur(
			"בָּרוּךְ שֶׁאָמַר וְהָיָה הָעוֹלָם, בָּרוּךְ הוּא, בָּרוּךְ אוֹמֵר וְעוֹשֶׂה, בָּרוּךְ גּוֹזֵר וּמְקַיֵּם, בָּרוּךְ עוֹשֶׂה בְרֵאשִׁית, בָּרוּךְ מְרַחֵם עַל הָאָרֶץ, בָּרוּךְ מְרַחֵם עַל הַבְּרִיּוֹת, בָּרוּךְ מְשַׁלֵּם שָׂכָר טוֹב לִירֵאָיו, בָּרוּךְ חַי לָעַד וְקַיָּם לָנֶצַח, בָּרוּךְ פּוֹדֶה וּמַצִּיל, בָּרוּךְ שְׁמוֹ. בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, הָאֵל, אָב הָרַחֲמָן, הַמְהֻלָּל בְּפֶה עַמּוֹ, מְשֻׁבָּח וּמְפֹאָר בִּלְשׁוֹן חֲסִידָיו וַעֲבָדָיו, וּבְשִׁירֵי דָּוִד עַבְדָּךְ נְהַלְלָךְ יְהֹוָה אֱלֹהֵינוּ בִּשְׁבָחוֹת וּבִזְמִירוֹת, וּנְגַדְּלָךְ וּנְשַׁבְּחָךְ וּנְפָאֲרָךְ וְנַמְלִיכָךְ, וְנַזְכִּיר שִׁמְךָ מַלְכֵּנוּ אֱלֹהֵינוּ, יָחִיד חַי הָעוֹלָמִים, מֶלֶךְ מְשֻׁבָּח וּמְפֹאָר עֲדֵי עַד שְׁמוֹ הַגָּדוֹל. בָּרוּךְ אַתָּה יְהֹוָה, מֶלֶךְ מְהֻלָּל בַּתִּשְׁבָּחוֹת:\n\nמִזְמ֥וֹר לְתוֹדָ֑ה הָרִ֥יעוּ לַ֝יהֹוָ֗ה כׇּל־הָאָֽרֶץ׃ עִבְד֣וּ אֶת־יְהֹוָ֣ה בְּשִׂמְחָ֑ה בֹּ֥אוּ לְ֝פָנָ֗יו בִּרְנָנָֽה׃ דְּע֗וּ כִּֽי־יְהֹוָה֮ ה֤וּא אֱלֹ֫הִ֥ים הֽוּא־עָ֭שָׂנוּ וְל֣וֹ אֲנַ֑חְנוּ עַ֝מּ֗וֹ וְצֹ֣אן מַרְעִיתֽוֹ׃ בֹּ֤אוּ שְׁעָרָ֨יו ׀ בְּתוֹדָ֗ה חֲצֵרֹתָ֥יו בִּתְהִלָּ֑ה הוֹדוּ־ל֗֝וֹ בָּרְכ֥וּ שְׁמֽוֹ׃ כִּי־ט֣וֹב יְ֭הֹוָה לְעוֹלָ֣ם חַסְדּ֑וֹ וְעַד־דֹּ֥ר וָ֝דֹ֗ר אֱמוּנָתֽוֹ׃\n\nיְהִ֤י כְב֣וֹד יְהֹוָ֣ה לְעוֹלָ֑ם יִשְׂמַ֖ח יְהֹוָ֣ה בְּמַעֲשָֽׂיו: יְהִ֤י שֵׁ֣ם יְהֹוָ֣ה מְבֹרָ֑ךְ מֵ֝עַתָּ֗ה וְעַד־עוֹלָֽם: מִמִּזְרַח־שֶׁ֥מֶשׁ עַד־מְבוֹא֑וֹ מְ֝הֻלָּ֗ל שֵׁ֣ם יְהֹוָֽה: רָ֖ם עַל־כָּל־גּוֹיִ֥ם ׀ יְהֹוָ֑ה עַ֖ל הַשָּׁמַ֣יִם כְּבוֹדֽוֹ:  יְ֭הֹוָה שִׁמְךָ֣ לְעוֹלָ֑ם יְ֝הֹוָ֗ה זִכְרְךָ֥ לְדֹר־וָדֹֽר: יְֽהֹוָ֗ה בַּ֭שָּׁמַיִם הֵכִ֣ין כִּסְא֑וֹ וּ֝מַלְכוּת֗וֹ בַּכֹּ֥ל מָשָֽׁלָה: יִשְׂמְח֤וּ הַשָּׁמַ֙יִם֙ וְתָגֵ֣ל הָאָ֔רֶץ וְיֹאמְר֥וּ בַגּוֹיִ֖ם יְהֹוָ֥ה מָלָֽךְ: יְהֹוָה מֶֽלֶךְ, יְהֹוָה מָלָֽךְ, יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד: יְהֹוָ֣ה מֶ֭לֶךְ עוֹלָ֣ם וָעֶ֑ד אָבְד֥וּ ג֝וֹיִ֗ם מֵאַרְצֽוֹ: יְֽהֹוָ֗ה הֵפִ֥יר עֲצַת־גּוֹיִ֑ם הֵ֝נִ֗יא מַחְשְׁב֥וֹת עַמִּֽים: רַבּ֣וֹת מַחֲשָׁב֣וֹת בְּלֶב־אִ֑ישׁ וַעֲצַ֥ת יְ֝הֹוָ֗ה הִ֣יא תָקֽוּם: עֲצַ֣ת יְ֭הֹוָה לְעוֹלָ֣ם תַּעֲמֹ֑ד מַחְשְׁב֥וֹת לִ֝בּ֗וֹ לְדֹ֣ר וָדֹֽר: כִּ֤י ה֣וּא אָמַ֣ר וַיֶּ֑הִי הֽוּא־צִ֝וָּ֗ה וַֽיַּעֲמֹֽד: כִּי־בָחַ֣ר יְהֹוָ֣ה בְּצִיּ֑וֹן אִ֝וָּ֗הּ לְמוֹשָׁ֥ב לֽוֹ: כִּֽי־יַעֲקֹ֗ב בָּחַ֣ר ל֣וֹ יָ֑הּ יִ֝שְׂרָאֵ֗ל לִסְגֻלָּתֽוֹ: כִּ֤י ׀ לֹא־יִטֹּ֣שׁ יְהֹוָ֣ה עַמּ֑וֹ וְ֝נַחֲלָת֗וֹ לֹ֣א יַעֲזֹֽב: וְה֤וּא רַח֨וּם ׀ יְכַפֵּ֥ר עָוֺן֮ וְֽלֹא־יַֽ֫שְׁחִ֥ית וְ֭הִרְבָּה לְהָשִׁ֣יב אַפּ֑וֹ וְלֹא־יָ֝עִ֗יר כׇּל־חֲמָתֽוֹ: יְהֹוָ֥ה הוֹשִׁ֑יעָה הַ֝מֶּ֗לֶךְ יַעֲנֵ֥נוּ בְיוֹם־קׇרְאֵֽנוּ: \n\n" +
			"אַ֭שְׁרֵי יוֹשְׁבֵ֣י בֵיתֶ֑ךָ ע֝֗וֹד יְֽהַלְל֥וּךָ סֶּֽלָה: אַשְׁרֵ֣י הָ֭עָם שֶׁכָּ֣כָה לּ֑וֹ אַֽשְׁרֵ֥י הָ֝עָ֗ם שֱׁיְהֹוָ֥ה אֱלֹהָֽיו: \n\n" +
			"תְּהִלָּ֗ה לְדָ֫וִ֥ד אֲרוֹמִמְךָ֣ אֱלוֹהַ֣י הַמֶּ֑לֶךְ וַאֲבָרְכָ֥ה שִׁ֝מְךָ֗ לְעוֹלָ֥ם וָעֶֽד׃ בְּכָל־י֥וֹם אֲבָֽרְכֶ֑ךָּ וַאֲהַֽלְלָ֥ה שִׁ֝מְךָ֗ לְעוֹלָ֥ם וָעֶֽד׃ גָּ֘ד֤וֹל יְהֹוָ֣ה וּמְהֻלָּ֣ל מְאֹ֑ד וְ֝לִגְדֻלָּת֗וֹ אֵ֣ין חֵֽקֶר׃ דּ֣וֹר לְ֭דוֹר יְשַׁבַּ֣ח מַעֲשֶׂ֑יךָ וּגְב֖וּרֹתֶ֣יךָ יַגִּֽידוּ׃ הֲ֭דַר כְּב֣וֹד הוֹדֶ֑ךָ וְדִבְרֵ֖י נִפְלְאֹתֶ֣יךָ אָשִֽׂיחָה׃ וֶעֱז֣וּז נֽוֹרְאֹתֶ֣יךָ יֹאמֵ֑רוּ וּגְדֻלָּתְךָ֥ אֲסַפְּרֶֽנָּה׃ זֵ֣כֶר רַב־טוּבְךָ֣ יַבִּ֑יעוּ וְצִדְקָתְךָ֥ יְרַנֵּֽנוּ׃ חַנּ֣וּן וְרַח֣וּם יְהֹוָ֑ה אֶ֥רֶךְ אַ֝פַּ֗יִם וּגְדׇל־חָֽסֶד׃ טוֹב־יְהֹוָ֥ה לַכֹּ֑ל וְ֝רַחֲמָ֗יו עַל־כׇּל־מַעֲשָֽׂיו׃ יוֹד֣וּךָ יְ֭הֹוָה כׇּל־מַעֲשֶׂ֑יךָ וַ֝חֲסִידֶ֗יךָ יְבָרְכֽוּכָה׃ כְּב֣וֹד מַלְכוּתְךָ֣ יֹאמֵ֑רוּ וּגְבוּרָתְךָ֥ יְדַבֵּֽרוּ׃ לְהוֹדִ֤יעַ ׀ לִבְנֵ֣י הָ֭אָדָם גְּבוּרֹתָ֑יו וּ֝כְב֗וֹד הֲדַ֣ר מַלְכוּתֽוֹ׃ מַֽלְכוּתְךָ֗ מַלְכ֥וּת כׇּל־עֹלָמִ֑ים וּ֝מֶֽמְשַׁלְתְּךָ֗ בְּכׇל־דּ֥וֹר וָדֹֽר׃ סוֹמֵ֣ךְ יְ֭הֹוָה לְכׇל־הַנֹּפְלִ֑ים וְ֝זוֹקֵ֗ף לְכׇל־הַכְּפוּפִֽים׃ עֵֽינֵי־כֹ֭ל אֵלֶ֣יךָ יְשַׂבֵּ֑רוּ וְאַתָּ֤ה נֽוֹתֵן־לָהֶ֖ם אֶת־אׇכְלָ֣ם בְּעִתּֽוֹ׃ פּוֹתֵ֥חַ אֶת־יָדֶ֑ךָ וּמַשְׂבִּ֖יעַ לְכׇל־חַ֣י רָצֽוֹן׃ צַדִּ֣יק יְ֭הֹוָה בְּכׇל־דְּרָכָ֑יו וְ֝חָסִ֗יד בְּכׇל־מַעֲשָֽׂיו׃ קָר֣וֹב יְ֭הֹוָה לְכׇל־קֹרְאָ֑יו לְכֹ֤ל אֲשֶׁ֖ר יִקְרָאֻ֣הוּ בֶֽאֱמֶֽת׃ רְצוֹן־יְרֵאָ֥יו יַעֲשֶׂ֑ה וְֽאֶת־שַׁוְעָתָ֥ם יִ֝שְׁמַ֗ע וְיוֹשִׁיעֵֽם׃ שׁוֹמֵ֣ר יְ֭הֹוָה אֶת־כׇּל־אֹהֲבָ֑יו וְאֵ֖ת כׇּל־הָרְשָׁעִ֣ים יַשְׁמִֽיד׃ תְּהִלַּ֥ת יְהֹוָ֗ה יְֽדַבֶּ֫ר פִּ֥י וִיבָרֵ֣ךְ כׇּל־בָּ֭שָׂר שֵׁ֥ם קׇדְשׁ֗וֹ לְעוֹלָ֥ם וָעֶֽד׃ וַאֲנַ֤חְנוּ ׀ נְבָ֘רֵ֤ךְ יָ֗הּ מֵעַתָּ֥ה וְעַד־עוֹלָ֗ם הַֽלְלוּיָֽהּ׃ \n\n" +
			"הַֽלְלוּיָ֡הּ הַֽלְלִ֥י נַ֝פְשִׁ֗י אֶת־יְהֹוָֽה׃ אֲהַלְלָ֣ה יְהֹוָ֣ה בְּחַיָּ֑י אֲזַמְּרָ֖ה לֵאלֹהַ֣י בְּעוֹדִֽי׃ אַל־תִּבְטְח֥וּ בִנְדִיבִ֑ים בְּבֶן־אָדָ֓ם ׀ שֶׁ֤אֵ֖ין ל֥וֹ תְשׁוּעָֽה׃ תֵּצֵ֣א ר֭וּחוֹ יָשֻׁ֣ב לְאַדְמָת֑וֹ בַּיּ֥וֹם הַ֝ה֗וּא אָבְד֥וּ עֶשְׁתֹּֽנֹתָֽיו׃ אַשְׁרֵ֗י שֶׁ֤אֵ֣ל יַעֲקֹ֣ב בְּעֶזְר֑וֹ שִׂ֝בְר֗וֹ עַל־יְהֹוָ֥ה אֱלֹהָֽיו׃ עֹשֶׂ֤ה ׀ שָׁ֘מַ֤יִם וָאָ֗רֶץ אֶת־הַיָּ֥ם וְאֶת־כׇּל־אֲשֶׁר־בָּ֑ם הַשֹּׁמֵ֖ר אֱמֶ֣ת לְעוֹלָֽם׃ עֹשֶׂ֤ה מִשְׁפָּ֨ט ׀ לָעֲשׁוּקִ֗ים נֹתֵ֣ן לֶ֭חֶם לָרְעֵבִ֑ים יְ֝הֹוָ֗ה מַתִּ֥יר אֲסוּרִֽים׃ יְהֹוָ֤ה ׀ פֹּ֘קֵ֤חַ עִוְרִ֗ים יְ֭הֹוָה זֹקֵ֣ף כְּפוּפִ֑ים יְ֝הֹוָ֗ה אֹהֵ֥ב צַדִּיקִֽים׃ יְהֹוָ֤ה ׀ שֹׁ֘מֵ֤ר אֶת־גֵּרִ֗ים יָת֣וֹם וְאַלְמָנָ֣ה יְעוֹדֵ֑ד וְדֶ֖רֶךְ רְשָׁעִ֣ים יְעַוֵּֽת׃ יִמְלֹ֤ךְ יְהֹוָ֨ה ׀ לְעוֹלָ֗ם אֱלֹהַ֣יִךְ צִ֭יּוֹן לְדֹ֥ר וָדֹ֗ר הַֽלְלוּיָֽהּ׃ \n\n" +
			"הַ֥לְלוּיָ֨הּ ׀ כִּי־ט֭וֹב זַמְּרָ֣ה אֱלֹהֵ֑ינוּ כִּי־נָ֝עִ֗ים נָאוָ֥ה תְהִלָּֽה׃ בּוֹנֵ֣ה יְרוּשָׁלַיִם יְהֹוָ֑ה נִדְחֵ֖י יִשְׂרָאֵ֣ל יְכַנֵּֽס׃ הָ֭רֹפֵא לִשְׁב֣וּרֵי לֵ֑ב וּ֝מְחַבֵּ֗שׁ לְעַצְּבוֹתָֽם׃ מוֹנֶ֣ה מִ֭סְפָּר לַכּוֹכָבִ֑ים לְ֝כֻלָּ֗ם שֵׁמ֥וֹת יִקְרָֽא׃ גָּד֣וֹל אֲדוֹנֵ֣ינוּ וְרַב־כֹּ֑חַ לִ֝תְבוּנָת֗וֹ אֵ֣ין מִסְפָּֽר׃ מְעוֹדֵ֣ד עֲנָוִ֣ים יְהֹוָ֑ה מַשְׁפִּ֖יל רְשָׁעִ֣ים עֲדֵי־אָֽרֶץ׃ עֱנ֣וּ לַֽיהֹוָ֣ה בְּתוֹדָ֑ה זַמְּר֖וּ לֵאלֹהֵ֣ינוּ בְכִנּֽוֹר׃ הַֽמְכַסֶּ֬ה שָׁמַ֨יִם ׀ בְּעָבִ֗ים הַמֵּכִ֣ין לָאָ֣רֶץ מָטָ֑ר הַמַּצְמִ֖יחַ הָרִ֣ים חָצִֽיר׃ נוֹתֵ֣ן לִבְהֵמָ֣ה לַחְמָ֑הּ לִבְנֵ֥י עֹ֝רֵ֗ב אֲשֶׁ֣ר יִקְרָֽאוּ׃ לֹ֤א בִגְבוּרַ֣ת הַסּ֣וּס יֶחְפָּ֑ץ לֹא־בְשׁוֹקֵ֖י הָאִ֣ישׁ יִרְצֶֽה׃ רוֹצֶ֣ה יְ֭הֹוָה אֶת־יְרֵאָ֑יו אֶת־הַֽמְיַחֲלִ֥ים לְחַסְדּֽוֹ׃ שַׁבְּחִ֣י יְרוּשָׁלַיִם אֶת־יְהֹוָ֑ה הַֽלְלִ֖י אֱלֹהַ֣יִךְ צִיּֽוֹן׃ כִּֽי־חִ֭זַּק בְּרִיחֵ֣י שְׁעָרָ֑יִךְ בֵּרַ֖ךְ בָּנַ֣יִךְ בְּקִרְבֵּֽךְ׃ הַשָּׂם־גְּבוּלֵ֥ךְ שָׁל֑וֹם חֵ֥לֶב חִ֝טִּ֗ים יַשְׂבִּיעֵֽךְ׃ הַשֹּׁלֵ֣חַ אִמְרָת֣וֹ אָ֑רֶץ עַד־מְ֝הֵרָ֗ה יָר֥וּץ דְּבָרֽוֹ׃ הַנֹּתֵ֣ן שֶׁ֣לֶג כַּצָּ֑מֶר כְּ֝פ֗וֹר כָּאֵ֥פֶר יְפַזֵּֽר׃ מַשְׁלִ֣יךְ קַֽרְח֣וֹ כְפִתִּ֑ים לִפְנֵ֥י קָ֝רָת֗וֹ מִ֣י יַעֲמֹֽד׃ יִשְׁלַ֣ח דְּבָר֣וֹ וְיַמְסֵ֑ם יַשֵּׁ֥ב ר֝וּח֗וֹ יִזְּלוּ־מָֽיִם׃ מַגִּ֣יד דְּבָרָ֣ו לְיַעֲקֹ֑ב חֻקָּ֥יו וּ֝מִשְׁפָּטָ֗יו לְיִשְׂרָאֵֽל׃ לֹ֘א עָ֤שָׂה כֵ֨ן ׀ לְכׇל־גּ֗וֹי וּמִשְׁפָּטִ֥ים בַּל־יְדָע֗וּם הַֽלְלוּיָֽהּ׃ \n\n" +
			"הַ֥לְלוּיָ֨הּ ׀ הַֽלְל֣וּ אֶת־יְ֭הֹוָה מִן־הַשָּׁמַ֑יִם הַֽ֝לְל֗וּהוּ בַּמְּרוֹמִֽים׃ הַֽלְל֥וּהוּ כׇל־מַלְאָכָ֑יו הַ֝לְל֗וּהוּ כׇּל־צְבָאָֽו׃ הַֽ֭לְלוּהוּ שֶׁ֣מֶשׁ וְיָרֵ֑חַ הַֽ֝לְל֗וּהוּ כׇּל־כּ֥וֹכְבֵי אֽוֹר׃ הַֽ֭לְלוּהוּ שְׁמֵ֣י הַשָּׁמָ֑יִם וְ֝הַמַּ֗יִם אֲשֶׁ֤ר ׀ מֵעַ֬ל הַשָּׁמָֽיִם׃ יְֽ֭הַלְלוּ אֶת־שֵׁ֣ם יְהֹוָ֑ה כִּ֤י ה֖וּא צִוָּ֣ה וְנִבְרָֽאוּ׃ וַיַּעֲמִידֵ֣ם לָעַ֣ד לְעוֹלָ֑ם חׇק־נָ֝תַ֗ן וְלֹ֣א יַעֲבֽוֹר׃ הַֽלְל֣וּ אֶת־יְ֭הֹוָה מִן־הָאָ֑רֶץ תַּ֝נִּינִ֗ים וְכׇל־תְּהֹמֽוֹת׃ אֵ֣שׁ וּ֭בָרָד שֶׁ֣לֶג וְקִיט֑וֹר ר֥וּחַ סְ֝עָרָ֗ה עֹשָׂ֥ה דְבָרֽוֹ׃ הֶהָרִ֥ים וְכׇל־גְּבָע֑וֹת עֵ֥ץ פְּ֝רִ֗י וְכׇל־אֲרָזִֽים׃ הַחַיָּ֥ה וְכׇל־בְּהֵמָ֑ה רֶ֗֝מֶשׂ וְצִפּ֥וֹר כָּנָֽף׃ מַלְכֵי־אֶ֭רֶץ וְכׇל־לְאֻמִּ֑ים שָׂ֝רִ֗ים וְכׇל־שֹׁ֥פְטֵי אָֽרֶץ׃ בַּחוּרִ֥ים וְגַם־בְּתוּל֑וֹת זְ֝קֵנִ֗ים עִם־נְעָרִֽים׃ יְהַלְל֤וּ ׀ אֶת־שֵׁ֬ם יְהֹוָ֗ה כִּֽי־נִשְׂגָּ֣ב שְׁמ֣וֹ לְבַדּ֑וֹ ה֝וֹד֗וֹ עַל־אֶ֥רֶץ וְשָׁמָֽיִם׃ וַיָּ֤רֶם קֶ֨רֶן ׀ לְעַמּ֡וֹ תְּהִלָּ֤ה לְֽכׇל־חֲסִידָ֗יו לִבְנֵ֣י יִ֭שְׂרָאֵל עַ֥ם קְרֹב֗וֹ הַֽלְלוּיָֽהּ׃ \n\n" +
			"הַ֥לְלוּיָ֨הּ ׀ שִׁ֣ירוּ לַֽ֭יהֹוָה שִׁ֣יר חָדָ֑שׁ תְּ֝הִלָּת֗וֹ בִּקְהַ֥ל חֲסִידִֽים׃ יִשְׂמַ֣ח יִשְׂרָאֵ֣ל בְּעֹשָׂ֑יו בְּנֵֽי־צִ֝יּ֗וֹן יָגִ֥ילוּ בְמַלְכָּֽם׃ יְהַלְל֣וּ שְׁמ֣וֹ בְמָח֑וֹל בְּתֹ֥ף וְ֝כִנּ֗וֹר יְזַמְּרוּ־לֽוֹ׃ כִּֽי־רוֹצֶ֣ה יְהֹוָ֣ה בְּעַמּ֑וֹ יְפָאֵ֥ר עֲ֝נָוִ֗ים בִּישׁוּעָֽה׃ יַעְלְז֣וּ חֲסִידִ֣ים בְּכָב֑וֹד יְ֝רַנְּנ֗וּ עַל־מִשְׁכְּבוֹתָֽם׃ רוֹמְמ֣וֹת אֵ֭ל בִּגְרוֹנָ֑ם וְחֶ֖רֶב פִּיפִיּ֣וֹת בְּיָדָֽם׃ לַעֲשׂ֣וֹת נְ֭קָמָה בַּגּוֹיִ֑ם תּ֝וֹכֵח֗וֹת בַּלְאֻמִּֽים׃ לֶאְסֹ֣ר מַלְכֵיהֶ֣ם בְּזִקִּ֑ים וְ֝נִכְבְּדֵיהֶ֗ם בְּכַבְלֵ֥י בַרְזֶֽל׃ לַעֲשׂ֤וֹת בָּהֶ֨ם ׀ מִשְׁפָּ֬ט כָּת֗וּב הָדָ֣ר ה֭וּא לְכׇל־חֲסִידָ֗יו הַֽלְלוּיָֽהּ׃ \n\n" +
			"הַ֥לְלוּיָ֨הּ ׀ הַֽלְלוּ־אֵ֥ל בְּקָדְשׁ֑וֹ הַֽ֝לְל֗וּהוּ בִּרְקִ֥יעַ עֻזּֽוֹ׃ הַלְל֥וּהוּ בִגְבוּרֹתָ֑יו הַ֝לְל֗וּהוּ כְּרֹ֣ב גֻּדְלֽוֹ׃ הַ֭לְלוּהוּ בְּתֵ֣קַע שׁוֹפָ֑ר הַ֝לְל֗וּהוּ בְּנֵ֣בֶל וְכִנּֽוֹר׃ הַ֭לְלוּהוּ בְּתֹ֣ף וּמָח֑וֹל הַֽ֝לְל֗וּהוּ בְּמִנִּ֥ים וְעֻגָֽב׃ הַלְל֥וּהוּ בְצִלְצְלֵי־שָׁ֑מַע הַֽ֝לְל֗וּהוּ בְּֽצִלְצְלֵ֥י תְרוּעָֽה׃ כֹּ֣ל הַ֭נְּשָׁמָה תְּהַלֵּ֥ל יָ֗הּ הַֽלְלוּיָֽהּ׃ כֹּ֣ל הַ֭נְּשָׁמָה תְּהַלֵּ֥ל יָ֗הּ הַֽלְלוּיָֽהּ׃ \n\n" +
			"בָּר֖וּךְ יְהֹוָ֥ה לְ֝עוֹלָ֗ם אָ֘מֵ֥ן ׀ וְאָמֵֽן: בָּ֘ר֤וּךְ יְהֹוָ֨ה ׀ מִצִּיּ֗וֹן שֹׁ֘כֵ֤ן יְרוּשָׁלַיִם הַֽלְלוּיָֽהּ: בָּר֤וּךְ ׀ יְהֹוָ֣ה אֱ֭לֹהִים אֱלֹהֵ֣י יִשְׂרָאֵ֑ל עֹשֵׂ֖ה נִפְלָא֣וֹת לְבַדּֽוֹ: וּבָר֤וּךְ ׀ שֵׁ֥ם כְּבוֹד֗וֹ לְע֫וֹלָ֥ם וְיִמָּלֵ֣א כְ֭בוֹדוֹ אֶת־כֹּ֥ל הָאָ֗רֶץ אָ֘מֵ֥ן ׀ וְאָמֵֽן: \n\n" +
			"יאמר מעומד (Stand) \n\n" +
			"וַיְבָ֤רֶךְ דָּוִיד֙ אֶת־יְהֹוָ֔ה לְעֵינֵ֖י כׇּל־הַקָּהָ֑ל וַיֹּ֣אמֶר דָּוִ֗יד בָּר֨וּךְ אַתָּ֤ה יְהֹוָה֙ אֱלֹהֵי֙ יִשְׂרָאֵ֣ל אָבִ֔ינוּ מֵעוֹלָ֖ם וְעַד־עוֹלָֽם׃ לְךָ֣ יְ֠הֹוָ֠ה הַגְּדֻלָּ֨ה וְהַגְּבוּרָ֤ה וְהַתִּפְאֶ֙רֶת֙ וְהַנֵּ֣צַח וְהַה֔וֹד כִּי־כֹ֖ל בַּשָּׁמַ֣יִם וּבָאָ֑רֶץ לְךָ֤ יְהֹוָה֙ הַמַּמְלָכָ֔ה וְהַמִּתְנַשֵּׂ֖א לְכֹ֥ל ׀ לְרֹֽאשׁ׃ וְהָעֹ֤שֶׁר וְהַכָּבוֹד֙ מִלְּפָנֶ֔יךָ וְאַתָּה֙ מוֹשֵׁ֣ל בַּכֹּ֔ל וּבְיָדְךָ֖ כֹּ֣חַ וּגְבוּרָ֑ה וּבְיָ֣דְךָ֔ לְגַדֵּ֥ל וּלְחַזֵּ֖ק לַכֹּֽל׃ וְעַתָּ֣ה אֱלֹהֵ֔ינוּ מוֹדִ֥ים אֲנַ֖חְנוּ לָ֑ךְ וּֽמְהַלְלִ֖ים לְשֵׁ֥ם תִּפְאַרְתֶּֽךָ׃ וִיבָֽרְכוּ֙ שֵׁ֣ם כְּבֹדֶ֔ךָ וּמְרוֹמַ֥ם עַל־כׇּל־בְּרָכָ֖ה וּתְהִלָּֽה׃ אַתָּה־ה֣וּא יְהֹוָה֮ לְבַדֶּ֒ךָ֒ אַתָּ֣ה עָשִׂ֡יתָ אֶֽת־הַשָּׁמַ֩יִם֩ שְׁמֵ֨י הַשָּׁמַ֜יִם וְכׇל־צְבָאָ֗ם הָאָ֜רֶץ וְכׇל־אֲשֶׁ֤ר עָלֶ֙יהָ֙ הַיַּמִּים֙ וְכׇל־אֲשֶׁ֣ר בָּהֶ֔ם וְאַתָּ֖ה מְחַיֶּ֣ה אֶת־כֻּלָּ֑ם וּצְבָ֥א הַשָּׁמַ֖יִם לְךָ֥ מִשְׁתַּחֲוִֽים׃ אַתָּה־הוּא֙ יְהֹוָ֣ה הָאֱלֹהִ֔ים. (עד כאן מעומד/Sit here) אֲשֶׁ֤ר בָּחַ֙רְתָּ֙ בְּאַבְרָ֔ם וְהוֹצֵאת֖וֹ מֵא֣וּר כַּשְׂדִּ֑ים וְשַׂ֥מְתָּ שְּׁמ֖וֹ אַבְרָהָֽם׃ וּמָצָ֣אתָ אֶת־לְבָבוֹ֮ נֶאֱמָ֣ן לְפָנֶ֒יךָ֒ וְכָר֨וֹת עִמּ֜וֹ הַבְּרִ֗ית לָתֵ֡ת אֶת־אֶ֩רֶץ֩ הַכְּנַעֲנִ֨י הַחִתִּ֜י הָאֱמֹרִ֧י וְהַפְּרִזִּ֛י וְהַיְבוּסִ֥י וְהַגִּרְגָּשִׁ֖י לָתֵ֣ת לְזַרְע֑וֹ וַתָּ֙קֶם֙ אֶת־דְּבָרֶ֔יךָ כִּ֥י צַדִּ֖יק אָֽתָּה׃ וַתֵּ֛רֶא אֶת־עֳנִ֥י אֲבֹתֵ֖ינוּ בְּמִצְרָ֑יִם וְאֶת־זַעֲקָתָ֥ם שָׁמַ֖עְתָּ עַל־יַם־סֽוּף׃ וַ֠תִּתֵּ֠ן אֹתֹ֨ת וּמֹֽפְתִ֜ים בְּפַרְעֹ֤ה וּבְכׇל־עֲבָדָיו֙ וּבְכׇל־עַ֣ם אַרְצ֔וֹ כִּ֣י יָדַ֔עְתָּ כִּ֥י הֵזִ֖ידוּ עֲלֵיהֶ֑ם וַתַּֽעַשׂ־לְךָ֥ שֵׁ֖ם כְּהַיּ֥וֹם הַזֶּֽה׃ וְהַיָּם֙ בָּקַ֣עְתָּ לִפְנֵיהֶ֔ם וַיַּֽעַבְר֥וּ בְתוֹךְ־הַיָּ֖ם בַּיַּבָּשָׁ֑ה וְֽאֶת־רֹ֨דְפֵיהֶ֜ם הִשְׁלַ֧כְתָּ בִמְצוֹלֹ֛ת כְּמוֹ־אֶ֖בֶן בְּמַ֥יִם עַזִּֽים׃ \n\n" +
			"וַיּ֨וֹשַׁע יְהֹוָ֜ה בַּיּ֥וֹם הַה֛וּא אֶת־יִשְׂרָאֵ֖ל מִיַּ֣ד מִצְרָ֑יִם וַיַּ֤רְא יִשְׂרָאֵל֙ אֶת־מִצְרַ֔יִם מֵ֖ת עַל־שְׂפַ֥ת הַיָּֽם׃ וַיַּ֨רְא יִשְׂרָאֵ֜ל אֶת־הַיָּ֣ד הַגְּדֹלָ֗ה אֲשֶׁ֨ר עָשָׂ֤ה יְהֹוָה֙ בְּמִצְרַ֔יִם וַיִּֽירְא֥וּ הָעָ֖ם אֶת־יְהֹוָ֑ה וַיַּֽאֲמִ֙ינוּ֙ בַּֽיהֹוָ֔ה וּבְמֹשֶׁ֖ה עַבְדּֽוֹ׃ \n\n" +
			"אָ֣ז יָשִֽׁיר־מֹשֶׁה֩ וּבְנֵ֨י יִשְׂרָאֵ֜ל אֶת־הַשִּׁירָ֤ה הַזֹּאת֙ לַֽיהֹוָ֔ה וַיֹּאמְר֖וּ לֵאמֹ֑ר אָשִׁ֤ירָה לַֽיהֹוָה֙ כִּֽי־גָאֹ֣ה גָּאָ֔ה ס֥וּס וְרֹכְב֖וֹ רָמָ֥ה בַיָּֽם׃ עָזִּ֤י וְזִמְרָת֙ יָ֔הּ וַֽיְהִי־לִ֖י לִֽישׁוּעָ֑ה זֶ֤ה אֵלִי֙ וְאַנְוֵ֔הוּ אֱלֹהֵ֥י אָבִ֖י וַאֲרֹמְמֶֽנְהוּ׃ יְהֹוָ֖ה אִ֣ישׁ מִלְחָמָ֑ה יְהֹוָ֖ה שְׁמֽוֹ׃ מַרְכְּבֹ֥ת פַּרְעֹ֛ה וְחֵיל֖וֹ יָרָ֣ה בַיָּ֑ם וּמִבְחַ֥ר שָֽׁלִשָׁ֖יו טֻבְּע֥וּ בְיַם־סֽוּף׃ תְּהֹמֹ֖ת יְכַסְיֻ֑מוּ יָרְד֥וּ בִמְצוֹלֹ֖ת כְּמוֹ־אָֽבֶן׃ יְמִֽינְךָ֣ יְהֹוָ֔ה נֶאְדָּרִ֖י בַּכֹּ֑חַ יְמִֽינְךָ֥ יְהֹוָ֖ה תִּרְעַ֥ץ אוֹיֵֽב׃ וּבְרֹ֥ב גְּאוֹנְךָ֖ תַּהֲרֹ֣ס קָמֶ֑יךָ תְּשַׁלַּח֙ חֲרֹ֣נְךָ֔ יֹאכְלֵ֖מוֹ כַּקַּֽשׁ׃ וּבְר֤וּחַ אַפֶּ֙יךָ֙ נֶ֣עֶרְמוּ מַ֔יִם נִצְּב֥וּ כְמוֹ־נֵ֖ד נֹזְלִ֑ים קָֽפְא֥וּ תְהֹמֹ֖ת בְּלֶב־יָֽם׃ אָמַ֥ר אוֹיֵ֛ב אֶרְדֹּ֥ף אַשִּׂ֖יג אֲחַלֵּ֣ק שָׁלָ֑ל תִּמְלָאֵ֣מוֹ נַפְשִׁ֔י אָרִ֣יק חַרְבִּ֔י תּוֹרִישֵׁ֖מוֹ יָדִֽי׃ נָשַׁ֥פְתָּ בְרוּחֲךָ֖ כִּסָּ֣מוֹ יָ֑ם צָֽלְלוּ֙ כַּֽעוֹפֶ֔רֶת בְּמַ֖יִם (הפסק/pause) אַדִּירִֽים׃ מִֽי־כָמֹ֤כָה בָּֽאֵלִם֙ יְהֹוָ֔ה מִ֥י כָּמֹ֖כָה נֶאְדָּ֣ר בַּקֹּ֑דֶשׁ נוֹרָ֥א תְהִלֹּ֖ת עֹ֥שֵׂה פֶֽלֶא׃ נָטִ֙יתָ֙ יְמִ֣ינְךָ֔ תִּבְלָעֵ֖מוֹ אָֽרֶץ׃ נָחִ֥יתָ בְחַסְדְּךָ֖ עַם־ז֣וּ גָּאָ֑לְתָּ נֵהַ֥לְתָּ בְעׇזְּךָ֖ אֶל־נְוֵ֥ה קׇדְשֶֽׁךָ׃ שָֽׁמְע֥וּ עַמִּ֖ים יִרְגָּז֑וּן חִ֣יל אָחַ֔ז יֹשְׁבֵ֖י פְּלָֽשֶׁת׃ אָ֤ז נִבְהֲלוּ֙ אַלּוּפֵ֣י אֱד֔וֹם אֵילֵ֣י מוֹאָ֔ב יֹֽאחֲזֵ֖מוֹ רָ֑עַד נָמֹ֕גוּ כֹּ֖ל יֹשְׁבֵ֥י כְנָֽעַן׃ תִּפֹּ֨ל עֲלֵיהֶ֤ם אֵימָ֙תָה֙ וָפַ֔חַד בִּגְדֹ֥ל זְרוֹעֲךָ֖ יִדְּמ֣וּ כָּאָ֑בֶן עַד־יַעֲבֹ֤ר עַמְּךָ֙ יְהֹוָ֔ה עַֽד־יַעֲבֹ֖ר עַם־ז֥וּ קָנִֽיתָ׃ תְּבִאֵ֗מוֹ וְתִטָּעֵ֙מוֹ֙ בְּהַ֣ר נַחֲלָֽתְךָ֔ מָכ֧וֹן לְשִׁבְתְּךָ֛ פָּעַ֖לְתָּ יְהֹוָ֑ה מִקְּדָ֕שׁ אֲדֹנָ֖י כּוֹנְנ֥וּ יָדֶֽיךָ׃ יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד׃ יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד׃ יְהֹוָה מַלְכוּתֵהּ קָאִים לְעָלַם וּלְעָלְמֵי עָלְמַיָּא: כִּ֣י בָא֩ ס֨וּס פַּרְעֹ֜ה בְּרִכְבּ֤וֹ וּבְפָרָשָׁיו֙ בַּיָּ֔ם וַיָּ֧שֶׁב יְהֹוָ֛ה עֲלֵהֶ֖ם אֶת־מֵ֣י הַיָּ֑ם וּבְנֵ֧י יִשְׂרָאֵ֛ל הָלְכ֥וּ בַיַּבָּשָׁ֖ה בְּת֥וֹךְ הַיָּֽם׃ \n\n" +
			"כִּ֣י לַ֭יהֹוָה הַמְּלוּכָ֑ה וּ֝מֹשֵׁ֗ל בַּגּוֹיִֽם׃ וְעָל֤וּ מֽוֹשִׁעִים֙ בְּהַ֣ר צִיּ֔וֹן לִשְׁפֹּ֖ט אֶת־הַ֣ר עֵשָׂ֑ו וְהָיְתָ֥ה לַֽיהֹוָ֖ה הַמְּלוּכָֽה׃ וְהָיָ֧ה יְהֹוָ֛ה לְמֶ֖לֶךְ עַל־כׇּל־הָאָ֑רֶץ בַּיּ֣וֹם הַה֗וּא יִהְיֶ֧ה יְהֹוָ֛ה אֶחָ֖ד וּשְׁמ֥וֹ אֶחָֽד׃ \n\n" +
			"יִשְׁתַּבַּח שִׁמְךָ לָעַד מַלְכֵּֽנוּ, הָאֵל הַמֶּֽלֶךְ הַגָּדוֹל וְהַקָּדוֹשׁ, בַּשָּׁמַֽיִם וּבָאָֽרֶץ. כִּי לְךָ נָאֶה יְהֹוָה אֱלֹהֵֽינוּ וֵאלֹהֵי אֲבוֹתֵֽינוּ לְעוֹלָם וָעֶד. שִׁיר, וּשְׁבָחָה, הַלֵּל, וְזִמְרָה, עֹז, וּמֶמְשָׁלָה, נֶֽצַח, גְּדֻלָּה, וּגְבוּרָה, תְּהִלָּה, וְתִפְאֶֽרֶת, קְדֻשָּׁה, וּמַלְכוּת. בְּרָכוֹת וְהוֹדָאוֹת, לְשִׁמְךָ הַגָּדוֹל וְהַקָּדוֹשׁ, וּמֵעוֹלָם וְעַד עוֹלָם אַתָּה אֵל. בָּרוּךְ אַתָּה יְהֹוָה, מֶֽלֶךְ גָּדוֹל וּמְהֻלָּל בַּתִּשְׁבָּחוֹת, אֵל הַהוֹדָאוֹת, אֲדוֹן הַנִּפְלָאוֹת, בּוֹרֵא כָּל־הַנְּשָׁמוֹת, רִבּוֹן כָּל־הַמַּעֲשִׂים, הַבּוֹחֵר בְּשִׁירֵי זִמְרָה, מֶֽלֶךְ אֶל חַי הָעולָמִים, אָמֵן:");

		if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()
			|| jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
		addToSiddurHighlighted(
			"שִׁ֥יר הַֽמַּעֲל֑וֹת מִמַּעֲמַקִּ֖ים קְרָאתִ֣יךָ יְהֹוָֽה׃ אֲדֹנָי֮ שִׁמְעָ֢ה בְק֫וֹלִ֥י תִּהְיֶ֣ינָה אׇ֭זְנֶיךָ קַשֻּׁב֑וֹת לְ֝ק֗וֹל תַּחֲנוּנָֽי׃ אִם־עֲוֺנ֥וֹת תִּשְׁמׇר־יָ֑הּ אֲ֝דֹנָ֗י מִ֣י יַעֲמֹֽד׃ כִּֽי־עִמְּךָ֥ הַסְּלִיחָ֑ה לְ֝מַ֗עַן תִּוָּרֵֽא׃ קִוִּ֣יתִי יְ֭הֹוָה קִוְּתָ֣ה נַפְשִׁ֑י וְֽלִדְבָר֥וֹ הוֹחָֽלְתִּי׃ נַפְשִׁ֥י לַאדֹנָ֑י מִשֹּׁמְרִ֥ים לַ֝בֹּ֗קֶר שֹׁמְרִ֥ים לַבֹּֽקֶר׃ יַחֵ֥ל יִשְׂרָאֵ֗ל אֶל־יְהֹ֫וָ֥ה כִּֽי־עִם־יְהֹוָ֥ה הַחֶ֑סֶד וְהַרְבֵּ֖ה עִמּ֣וֹ פְדֽוּת׃ וְ֭הוּא יִפְדֶּ֣ה אֶת־יִשְׂרָאֵ֑ל מִ֝כֹּ֗ל עֲוֺנֹתָֽיו׃");
		} // Pisukei D'Zimra

		addHalfKaddish(false);
		addBarchu(false);

		addCategoryToSiddur("ק\"ש וברכותיה");

		addToSiddur(
			"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, יוֹצֵר אוֹר וּבוֹרֵא חֹשֶׁךְ עֹשֵׂה שָׁלוֹם וּבוֹרֵא אֶת הַכֹּל. הַמֵּאִיר לָאָרֶץ וְלַדָּרִים עָלֶיהָ בְּרַחֲמִים, וּבְטוּבוֹ מְחַדֵּשׁ בְּכָל יוֹם תָּמִיד מַעֲשֵׂה בְּרֵאשִׁית. מָה־רַבּ֬וּ מַעֲשֶׂ֨יךָ ׀ יְֽהֹוָ֗ה כֻּ֭לָּם בְּחׇכְמָ֣ה עָשִׂ֑יתָ מָלְאָ֥ה הָ֝אָ֗רֶץ קִנְיָנֶֽךָ׃ הַמֶּלֶךְ הַמְּרוֹמָם לְבַדּוֹ מֵאָז, הַמְּשֻׁבָּח וְהַמְּפוֹאָר וְהַמִּתְנַשֵּׂא מִימוֹת עוֹלָם. אֱלֹהַי עוֹלָם, בְּרַחֲמֶיךָ הָרַבִּים רַחֵם עָלֵינוּ, אֲדוֹן עוּזֵּנוּ, צוּר מִשְׂגַּבֵּנוּ, מָגֵן יִשְׁעֵנוּ, מִשְׂגָּב בַּעֲדֵנוּ. אֵל בָּרוּךְ גְּדוֹל דֵּעָה, הֵכִין וּפָעַל זָהֳרֵי חַמָּה. טוֹב יָצַר כָּבוֹד לִשְׁמוֹ, מְאוֹרוֹת נָתַן סְבִיבוֹת עֻזּוֹ. פִּינוֹת צִבְאוֹת קְדוֹשִׁים, רוֹמְמֵי שַׁדַּי, תָּמִיד מְסַפְּרִים כְּבוֹד אֵל וּקְדוּשָׁתוֹ. תִּתְבָּרַךְ יְהֹוָה אֱלֹהֵינוּ בַּשָּׁמַיִם מִמַּעַל וְעַל־הָאָרֶץ מִתַּחַת עַל־כָּל־שֶׁבַח מַעֲשֵׂה יָדֶיךָ וְעַל מְאוֹרֵי אוֹר שֶׁיָּצַרְתָּ הֵמָּה יְפָאֲרוּךָ סֶּלָה: \n\n" +
			"תִּתְבָּרַךְ לָנֶצַח צוּרֵנוּ מַלְכֵּנוּ וְגוֹאֲלֵנוּ בּוֹרֵא קְדוֹשִׁים, יִשְׁתַּבַּח שִׁמְךָ לָעַד מַלְכֵּנוּ יוֹצֵר מְשָׁרְתִים, וַאֲשֶׁר מְשָׁרְתָיו כֻּלָּם עוֹמְדִים בְּרוּם עוֹלָם וּמַשְׁמִיעִים בְּיִרְאָה יַחַד בְּקוֹל דִּבְרֵי אֱלֹהִים חַיִּים וּמֶלֶךְ עוֹלָם. כֻּלָּם אֲהוּבִים, כֻּלָּם בְּרוּרִים, כֻּלָּם גִּבּוֹרִים, כֻּלָּם קְדוֹשִׁים, כֻּלָּם עוֹשִׂים בְּאֵימָה וּבְיִרְאָה רָצוֹן קוֹנֵיהֶם, וְכֻלָּם פּוֹתְחִים אֶת פִּיהֶם בִּקְדוּשָׁה וּבְטָהֳרָה, בְּשִׁירָה וּבְזִמְרָה, וּמְבָרְכִין וּמְשַׁבְּחִין וּמְפָאֲרִין וּמַקְדִּישִׁין וּמַעֲרִיצִין וּמַמְלִיכִין אֶת שֵׁם הָאֵל הַמֶּלֶךְ הַגָּדוֹל הַגִּבּוֹר וְהַנּוֹרָא קָדוֹשׁ הוּא. וְכֻלָּם מְקַבְּלִים עֲלֵיהֶם עֹל מַלְכוּת שָׁמַיִם זֶה מִזֶּה, וְנוֹתְנִים רְשׁוּת זֶה לָזֶה לְהַקְדִּישׁ לְיוֹצְרָם בְּנַחַת רוּחַ בְּשָׂפָה בְּרוּרָה וּבִנְעִימָה קְדוּשָׁה, כֻּלָּם כְּאֶחָד עוֹנִים בְּאֵימָה, וְאוֹמְרִים בְּיִרְאָה: \n\n" +
			"קָד֧וֹשׁ ׀ קָד֛וֹשׁ קָד֖וֹשׁ יְהֹוָ֣ה צְבָא֑וֹת מְלֹ֥א כׇל־הָאָ֖רֶץ כְּבוֹדֽוֹ:\n\nוְהָאוֹפַנִּים וְחַיּוֹת הַקֹדֶשׁ בְּרַעַשׁ גָּדוֹל מִתְנַשְּׂאִים לְעֻמַּת הַשְׂרָפִים, לְעֻמָּתָם מְשַׁבְּחִים וְאוֹמְרִים: \n\nבָּר֥וּךְ כְּבוֹד־יְהֹוָ֖ה מִמְּקוֹמֽוֹ: \n\n" +
			"לָאֵל בָּרוּךְ, נְעִימוֹת יִתֵּנוּ, לַמֶּלֶךְ אֵל חַי וְקַיָּם, זְמִירוֹת יֹאמְרוּ וְתִשְׁבָּחוֹת יַשְׁמִיעוּ, כִּי הוּא לְבַדּוֹ מָרוֹם וְקָדוֹשׁ, פּוֹעֵל גְּבוּרוֹת, עוֹשֶׂה חֲדָשׁוֹת, בַּעַל מִלְחָמוֹת, זוֹרֵעַ צְדָקוֹת, מַצְמִיחַ יְשׁוּעוֹת, בּוֹרֵא רְפוּאוֹת, נוֹרָא תְהִלּוֹת, אֲדוֹן הַנִּפְלָאוֹת, הַמְחַדֵּשׁ בְּטוּבוֹ בְּכָל יוֹם תָּמִיד מַעֲשֵׂה בְרֵאשִׁית כָּאָמוּר: לְ֭עֹשֵׂה אוֹרִ֣ים גְּדֹלִ֑ים כִּ֖י לְעוֹלָ֣ם חַסְדּֽוֹ׃ בָּרוּךְ אַתָּה יְהֹוָה יוֹצֵר הַמְּאוֹרוֹת: \n\n" +
			"אַהֲבַת עוֹלָם אֲהַבְתָּנוּ יְהֹוָה אֱלֹהֵינוּ, חֶמְלָה גְּדוֹלָה וִיתֵרָה חָמַלְתָּ עָלֵינוּ. אָבִינוּ מַלְכֵּנוּ, בַּעֲבוּר שִׁמְךָ הַגָּדוֹל וּבַעֲבוּר אֲבוֹתֵינוּ שֶׁבָּטְחוּ בָּךְ וַתְּלַמְּדֵמוֹ חֻקֵּי חַיִּים לַעֲשׂוֹת רְצוֹנְךָ בְּלֵבָב שָׁלֵם, כֵּן תְּחָנֵּנוּ אָבִינוּ, אָב הָרַחֲמָן הַמְרַחֵם, רַחֵם נָא עָלֵינוּ, וְתֵן בְּלִבֵּנוּ בִינָה לְהָבִין, לְהַשְׂכִּיל, לִשְׁמֹעַ, לִלְמֹד וּלְלַמֵּד, לִשְׁמֹר וְלַעֲשׂוֹת וּלְקַיֵּם אֶת־כָּל־דִּבְרֵי תַּלְמוּד תוֹרָתְךָ בְּאַהֲבָה: \n\n" +
			"וְהָאֵר עֵינֵינוּ בְּתוֹרָתֶךָ וְדַבֵּק לִבֵּנוּ בְמִצְוֹתֶיךָ, וְיַחֵד לְבָבֵנוּ לְאַהֲבָה וּלְיִרְאָה אֶת־שְׁמֶךָ. וְלֹא נֵבוֹשׁ וְלֹא נִכָּלֵם וְלֹא נִכָּשֵׁל לְעוֹלָם וָעֶד. כִּי בְשֵׁם קָדְשְׁךָ הַגָּדוֹל הַגִּבּוֹר וְהַנּוֹרָא בָּטָחְנוּ, נָגִילָה וְנִשְׂמְחָה בִּישׁוּעָתֶךָ, וְרַחֲמֶיךָ יְהֹוָה אֱלֹהֵינוּ וַחֲסָדֶיךָ הָרַבִּים, אַל יַעַזְבוּנוּ נֶצַח סֶלָה וָעֶד: \n\n" +
			"מַהֵר וְהָבֵא עָלֵינוּ בְּרָכָה וְשָׁלוֹם מְהֵרָה מֵאַרְבַּע כַּנְפוֹת הָאָרֶץ, וּשְׁבֹר עֹל הַגּוֹיִם מֵעַל צַוָּארֵנוּ, וְהוֹלִיכֵנוּ מְהֵרָה קוֹמְמִיּוּת לְאַרְצֵנוּ, כִּי אֵל פּוֹעֵל יְשׁוּעוֹת אַתָּה, וּבָנוּ בָחַרְתָּ מִכָּל עַם וְלָשׁוֹן, וְקֵרַבְתָּנוּ מַלְכֵּנוּ לְשִׁמְךָ הַגָּדוֹל בְּאַהֲבָה, לְהוֹדוֹת לָךְ וּלְיַחֶדְךָ לְיִרְאָה וּלְאַהֲבָה אֶת־שִׁמְךָ, בָּרוּךְ אַתָּה יְהֹוָה, הַבּוֹחֵר בְּעַמּוֹ יִשְׂרָאֵל בְּאַהֲבָה: \n\n" +
			"שְׁמַ֖ע יִשְׂרָאֵ֑ל יְהֹוָ֥ה אֱלֹהֵ֖ינוּ יְהֹוָ֥ה ׀ אֶחָֽד׃ \n\n" +
			"בלחש/say quietly: בָּרוּךְ, שֵּׁם כְּבוֹד מַלְכוּתוֹ, לְעוֹלָם וָעֶד: \n\n" +
			shema +
			"וחוזר החזן: יְהֹוָה אֱלֹהֵיכֶם אֱמֶת: \n\n" +
			"וְיַצִּיב, וְנָכוֹן, וְקַיָּם, וְיָשָׁר, וְנֶאֱמָן, וְאָהוּב, וְחָבִיב, וְנֶחְמָד, וְנָעִים, וְנוֹרָא, וְאַדִּיר, וּמְתוּקָן, וּמְקֻבָּל, וְטוֹב, וְיָפֶה, הַדָּבָר הַזֶּה עָלֵינוּ לְעוֹלָם וָעֶד. \n\n" +
			"אֱמֶת, אֱלֹהֵי עוֹלָם מַלְכֵּנוּ צוּר יַעֲקֹב מָגֵן יִשְׁעֵנוּ, לְדוֹר וָדוֹר הוּא קַיָּם, וּשְׁמוֹ קַיָּם, וְכִסְאוֹ נָכוֹן, וּמַלְכוּתוֹ וֶאֱמוּנָתוֹ לָעַד קַיֶּמֶת, וּדְבָרָיו חַיִּים וְקַיָּמִים, וְנֶאֱמָנִים וְנֶחֱמָדִים לָעַד וּלְעוֹלְמֵי עוֹלָמִים. עַל אֲבוֹתֵינוּ, עָלֵינוּ וְעַל בָּנֵינוּ וְעַל דּוֹרוֹתֵינוּ וְעַל כָּל דּוֹרוֹת זֶרַע יִשְׂרָאֵל עֲבָדֶיךָ. עַל הָרִאשׁוֹנִים וְעַל הָאַחֲרוֹנִים דָּבָר טוֹב וְקַיָּם בֶּאֱמֶת וֶאֱמוּנָה חוֹק וְלֹא יַעֲבוֹר. אֱמֶת שֶׁאַתָּה הוּא יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ. מַלְכֵּנוּ מֶלֶךְ אֲבוֹתֵינוּ. גּוֹאֲלֵנוּ גּוֹאֵל אֲבוֹתֵינוּ. יוֹצְרֵנוּ צוּר יְשׁוּעָתֵנוּ. פּוֹדֵנוּ וּמַצִּילֵנוּ מֵעוֹלָם הוּא שְׁמֶךָ, וְאֵין לָנוּ עוֹד אֱלֹהִים זוּלָתְךָ סֶלָה: \n\n" +
			"עֶזְרַת אֲבוֹתֵינוּ אַתָּה הוּא מֵעוֹלָם, מָגֵן וּמוֹשִׁיעַ לָהֶם וְלִבְנֵיהֶם אַחֲרֵיהֶם בְּכָל דּוֹר וָדוֹר, בְּרוּם עוֹלָם מוֹשָׁבֶךָ, וּמִשְׁפָּטֶיךָ, וְצִדְקָתְךָ עַד אַפְסֵי אָרֶץ, אֱמֶת אַשְׁרֵי אִישׁ שֶׁיִּשְׁמַע לְמִצְוֹתֶיךָ וְתוֹרָתְךָ וּדְבָרְךָ יָשִׂים עַל לִבּוֹ. אֱמֶת שֶׁאַתָּה הוּא אֲדוֹן לְעַמֶּךָ וּמֶלֶךְ גִּבּוֹר לָרִיב רִיבָם לְאָבוֹת וּבָנִים, אֱמֶת אַתָּה הוּא רִאשׁוֹן וְאַתָּה הוּא אַחֲרוֹן וּמִבַּלְעָדֶיךָ אֵין לָנוּ מֶלֶךְ גּוֹאֵל וּמוֹשִׁיעַ. אֱמֶת מִמִּצְרַיִם גְּאַלְתָּנוּ יְהֹוָה אֱלֹהֵינוּ, מִבֵּית עֲבָדִים פְּדִיתָנוּ, כָּל בְּכוֹרֵיהֶם הָרַגְתָּ, וּבְכוֹרְךָ יִשְׂרָאֵל גָּאַלְתָּ, וְיַם־סוּף לָהֶם בָּקַעְתָּ, וְזֵדִים טִבַּעְתָּ, וִידִידִים עָבְרוּ יָם. וַיְכַסּוּ מַיִם צָרֵיהֶם אֶחָד מֵהֶם לֹא נוֹתַר. עַל זֹאת שִׁבְּחוּ אֲהוּבִים, וְרוֹמְמוּ לָאֵל, וְנָתְנוּ יְדִידִים זְמִירוֹת שִׁירוֹת וְתִשְׁבָּחוֹת בְּרָכוֹת וְהוֹדָאוֹת לַמֶּלֶךְ אֶל חַי וְקַיָּם, רָם וְנִשָּׂא, גָּדוֹל וְנוֹרָא, מַשְׁפִּיל גֵּאִים עֲדֵי אָרֶץ, מַגְבִּיהַּ שְׁפָלִים עַד מָרוֹם, מוֹצִיא אֲסִירִים, פּוֹדֶה עֲנָוִים, עוֹזֵר דַּלִּים, הָעוֹנֶה לְעַמּוֹ יִשְׂרָאֵל בְּעֵת שַׁוְּעָם אֵלָיו. \n\n" +
			"תְהִילוֹת לָאֵל עֶלְיוֹן גּוֹאֲלָם, בָּרוּךְ הוּא וּמְבוֹרָךְ, מֹשֶׁה וּבְנֵי יִשְׂרָאֵל לְךָ עָנוּ שִׁירָה בְשִׂמְחָה רַבָּה, וְאָמְרוּ כֻלָּם: מִֽי־כָמֹ֤כָה בָּֽאֵלִם֙ יְהֹוָ֔ה מִ֥י כָּמֹ֖כָה נֶאְדָּ֣ר בַּקֹּ֑דֶשׁ נוֹרָ֥א תְהִלֹּ֖ת עֹ֥שֵׂה פֶֽלֶא׃ שִׁירָה חֲדָשָׁה שִׁבְּחוּ גְאוּלִים לְשִׁמְךָ הַגָּדוֹל עַל שְׂפַת הַיָּם, יַחַד כֻלָּם הוֹדוּ וְהִמְלִיכוּ וְאָמְרוּ: יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד׃ וְנֶאֱמַר: גֹּאֲלֵ֕נוּ יְהֹוָ֥ה צְבָא֖וֹת שְׁמ֑וֹ קְד֖וֹשׁ יִשְׂרָאֵֽל׃ בָּרוּךְ אַתָּה יְהֹוָה גָּאַל יִשְׂרָאֵל:");// Berachot Shema

		addAmidahToSiddur(false, false);

		addAvinuMalkeinu(isTachanunSaidInTheMorning);
		if (jewishDateInfo.getJewishCalendar().isRoshChodesh()
				|| jewishDateInfo.getJewishCalendar().isCholHamoed()
				|| jewishDateInfo.getJewishCalendar().isChanukah()) {
			addHallel();

			if (jewishDateInfo.getJewishCalendar().isCholHamoedSuccos()) {
				addHotzahSeferTorah();
				addHoshanot();
			}

			if (jewishDateInfo.getJewishCalendar().isChanukah()
					&& !jewishDateInfo.getJewishCalendar().isRoshChodesh()) {
				addHalfKaddish(true);
			} else {
				addKaddishTitkabal(true);
			}
		} else {

			if (jewishDateInfo.getIsTachanunSaid().equals("Some say Tachanun today")
					|| jewishDateInfo.getIsTachanunSaid().equals("יש אומרים תחנון")) {
				addToSiddur("[" + jewishDateInfo.getIsTachanunSaid() + "]");
			}

			if (isTachanunSaidInTheMorning) {
				addTachanun();
				if (jewishDateInfo.getJewishCalendar().isTaanis()
				 || jewishDateInfo.getJewishCalendar().getDayOfWeek() == 2
				 || jewishDateInfo.getJewishCalendar().getDayOfWeek() == 5) {
					addToSiddurHighlighted(
						"Someone who prays alone or by Ashkenazim just says from \"אֶל מֶלֶך\" to \"וְכֵן כָּתוּב בְּתוֹרָתָךְ\" then continues/מי שמתפלל ביחיד או עם אשכנזים יאמר \"אל מלך יושב\" עד \"וכן כתוב בתורתך\". אז ידלג את הי\"ג מדות וימשיך לאחריו");
					addFastSelichot();

					addToSiddur(
						"אֶל מֶלֶךְ יוֹשֵׁב עַל כִּסֵּא רַחֲמִים וּמִתְנַהֵג בַּחֲסִידוּת, מוֹחֵל עֲוֹנוֹת עַמּוֹ, מַעֲבִיר רִאשׁוֹן רִאשׁוֹן. מַרְבֶּה מְחִילָה לַחַטָּאִים, וּסְלִיחָה לַפּוֹשְׁעִים, עוֹשֶׂה צְדָקוֹת עִם כָּל בָּשָׂר וְרוּחַ, לֹא כְרָעָתָם לָהֶם גּוֹמֵל, אֶל, הוֹרֵתָנוּ לוֹמַר מִדּוֹת שְׁלֹשׁ עֶשְׂרֵה, זְכוֹר לָנוּ הַיּוֹם בְּרִית שְׁלֹשׁ עֶשְׂרֵה כְּמוֹ שֶׁהוֹדַעְתָּ לֶעָנָו מִקֶּדֶם, וְכֵן כָּתוּב בְּתוֹרָתָךְ וַיֵּ֤רֶד יְהֹוָה֙ בֶּֽעָנָ֔ן וַיִּתְיַצֵּ֥ב עִמּ֖וֹ שָׁ֑ם וַיִּקְרָ֥א בְשֵׁ֖ם יְהֹוָֽה: וְשָׁם נֶאֱמַר: \n\n" +
						vayavor + "\n\n" +
						"אַנְשֵׁי אֱמוּנָה אָבָדוּ, בָּאִים בְּכֹחַ מַעֲשֵׂיהֶם: גִּבּוֹרִים לַעֲמֹד בַּפֶּרֶץ, דּוֹחִים אֶת הַגְּזֵרוֹת: הָיוּ לָנוּ לְחוֹמָה, וּלְמַחְסֶה בְּיוֹם זָעַם: זוֹעֲכִים אַף בְּלַחֲשָׁם, חֵמָה עָצְרוּ בְּשַׁוְעָם: טֶרֶם קְרָאוּךָ עֲנִיתָם, יוֹדְעִים לַעֲתֹר וּלְרַצּוֹת: כְּאָב רִחַמְתָּ לְמַעֲנָם, לֹא הֱשִׁיבוֹתָ פְנֵיהֶם רֵיקָם: מֵרֹב עֲוֹנֵינוּ אֲבַדְנוּם, נֶאֶסְפוּ מֶנּוּ בַּחֲטָאֵינוּ: סָעוּ הֵמָּה לִמְנוּחוֹת, עָזְבוּ אוֹתָנוּ לַאֲנָחוֹת: פַּסּוּ גוֹדְרֵי גָדֵר, צֻמְּתוּ מְשִׁיבֵי חֵמָה: קָמִים בַּפֶּרֶץ אַיִן, רְאוּיִים לרַצּוֹתְךָ אָפֵסוּ: שׁוֹטַטְנוּ בְּאַרְבַּע פִּנּוֹת, תְּרוּפָה לֹא מָצָאנוּ: שַׁבְנוּ אֵלֶיךָ בּבֹשֶׁת פָּנֵינוּ, לְשַׁחֲרָךְ אֵל בְּעֵת צָרוֹתֵינוּ: \n\n" +
						"אֶל מֶלֶךְ יוֹשֵׁב עַל כִּסֵּא רַחֲמִים וּמִתְנַהֵג בַּחֲסִידוּת, מוֹחֵל עֲוֹנוֹת עַמּוֹ, מַעֲבִיר רִאשׁוֹן רִאשׁוֹן. מַרְבֶּה מְחִילָה לַחַטָּאִים, וּסְלִיחָה לַפּוֹשְׁעִים, עוֹשֶׂה צְדָקוֹת עִם כָּל בָּשָׂר וְרוּחַ, לֹא כְרָעָתָם לָהֶם גּוֹמֵל, אֶל, הוֹרֵתָנוּ לוֹמַר מִדּוֹת שְׁלֹשׁ עֶשְׂרֵה, זְכוֹר לָנוּ הַיּוֹם בְּרִית שְׁלֹשׁ עֶשְׂרֵה כְּמוֹ שֶׁהוֹדַעְתָּ לֶעָנָו מִקֶּדֶם, וְכֵן כָּתוּב בְּתוֹרָתָךְ וַיֵּ֤רֶד יְהֹוָה֙ בֶּֽעָנָ֔ן וַיִּתְיַצֵּ֥ב עִמּ֖וֹ שָׁ֑ם וַיִּקְרָ֥א בְשֵׁ֖ם יְהֹוָֽה: וְשָׁם נֶאֱמַר: \n\n" +
						vayavor + "\n\n" +
						"תָּמַהְנוּ מֵרָעוֹת. תָּשַׁשׁ כֹּחֵנוּ מִצָּרוֹת. שַׁחְנוּ עַד לִמְאֹד, שָׁפַלְנוּ עַד עָפָר. רַחוּם כָּךְ הִיא מִדָּתֵנוּ, קְשֵׁי עֹרֶף וּמַמְרִים אֲנָחְנוּ. צָעַקְנוּ בְּפִינוּ חָטָאנוּ, פְּתַלְתּוֹל וְעִקֵּשׁ לִבֵּנוּ. עֶלְיוֹן, רַחֲמֶיךָ מֵעוֹלָם, סְלִיחָה עִמְּךָ הִיא. נִחָם עַל הָרָעָה, מַטֵּה כְּלַפֵּי חֶסֶד. לֹא תִתְעַלַּם בְּעִתּוֹת כָּאֵל, כִּי בְּצָרָה גְדוֹלָה אֲנָחְנוּ. יִוָּדַע לְעֵינֵי הַכֹּל, טוּבְךָ וְחַסְדְּךָ עִמָּנוּ. חֲתֹם פֶּה-שָׂטָן, וְאַל יַשְׂטִין עָלֵינוּ, זְעֹם בּוֹ וְיִדֹּם. וְיַעֲמֹד מֵלִיץ טוֹב לְצַדְּקֵנוּ, הוּא יַגִּיד יָשְׁרֵנוּ. דְּרָכֶיךָ רַחוּם וְחַנּוּן גִּלִּיתָ לְנֶאֱמַן בָּיִת. בְּבַקְשׁוֹ אָז מִלְּפָנֶיךָ, אֱמוּנָתְךָ הוֹדַעְתָּ לּוֹ: \n\n" +
						"אֶל מֶלֶךְ יוֹשֵׁב עַל כִּסֵּא רַחֲמִים וּמִתְנַהֵג בַּחֲסִידוּת, מוֹחֵל עֲוֹנוֹת עַמּוֹ, מַעֲבִיר רִאשׁוֹן רִאשׁוֹן. מַרְבֶּה מְחִילָה לַחַטָּאִים, וּסְלִיחָה לַפּוֹשְׁעִים, עוֹשֶׂה צְדָקוֹת עִם כָּל בָּשָׂר וְרוּחַ, לֹא כְרָעָתָם לָהֶם גּוֹמֵל, אֶל, הוֹרֵתָנוּ לוֹמַר מִדּוֹת שְׁלֹשׁ עֶשְׂרֵה, זְכוֹר לָנוּ הַיּוֹם בְּרִית שְׁלֹשׁ עֶשְׂרֵה כְּמוֹ שֶׁהוֹדַעְתָּ לֶעָנָו מִקֶּדֶם, וְכֵן כָּתוּב בְּתוֹרָתָךְ וַיֵּ֤רֶד יְהֹוָה֙ בֶּֽעָנָ֔ן וַיִּתְיַצֵּ֥ב עִמּ֖וֹ שָׁ֑ם וַיִּקְרָ֥א בְשֵׁ֖ם יְהֹוָֽה: וְשָׁם נֶאֱמַר \n\n" +
						vayavor);

					if (jewishDateInfo.getJewishCalendar().isTaanis()) {
						addToSiddurHighlighted("וּכְשֶׁחָֽטְאוּ יִשְׂרָאֵל בַּמִּדְבָּר, עָמַד מֹשֶׁה בִּתְפִלָּה לְפָנֶיךָ, וּבִקֵּשׁ רַחֲמִים עַל עַמְּךָ יִשְׂרָאֵל וְכָךְ אָמַר בִּתְפִלָּתוֹ: סְלַֽח־נָ֗א לַעֲוֺ֛ן הָעָ֥ם הַזֶּ֖ה כְּגֹ֣דֶל חַסְדֶּ֑ךָ וְכַאֲשֶׁ֤ר נָשָׂ֙אתָה֙ לָעָ֣ם הַזֶּ֔ה מִמִּצְרַ֖יִם וְעַד־הֵֽנָּה׃ אַף אַתָּה הֱשִׁיבוֹתָ לוֹ כְּדַרְכֵי טוּבְךָ בִּשַּׂרְתּוֹ וַחֲנַנְתּוֹ וְאָמַרְתָּ לוֹ: סָלַחְתִּי כִּדְבָרֶךָ: \n\n" +
						"דָּנִיֵּאל אִישׁ חֲמוּדוֹת אָמַר לְפָנֶיךָ: הַטֵּ֨ה אֱלֹהַ֥י ׀ אׇזְנְךָ֮ וּֽשְׁמָע֒ פְּקַ֣ח עֵינֶ֗יךָ וּרְאֵה֙ שֹֽׁמְמֹתֵ֔ינוּ וְהָעִ֕יר אֲשֶׁר־נִקְרָ֥א שִׁמְךָ֖ עָלֶ֑יהָ כִּ֣י ׀ לֹ֣א עַל־צִדְקֹתֵ֗ינוּ אֲנַ֨חְנוּ מַפִּילִ֤ים תַּחֲנוּנֵ֙ינוּ֙ לְפָנֶ֔יךָ כִּ֖י עַל־רַחֲמֶ֥יךָ הָרַבִּֽים׃ אֲדֹנָ֤י ׀ שְׁמָ֙עָה֙ אֲדֹנָ֣י ׀ סְלָ֔חָה אֲדֹנָ֛י הַֽקְשִׁ֥יבָה וַעֲשֵׂ֖ה אַל־תְּאַחַ֑ר לְמַֽעַנְךָ֣ אֱלֹהַ֔י כִּֽי־שִׁמְךָ֣ נִקְרָ֔א עַל־עִירְךָ֖ וְעַל־עַמֶּֽךָ׃ וְלִירוּשָׁלַיִם עִירָךְ אָמַרְתָּ לָהּ: הִנְנִי֙ נִשְׁפָּ֣ט אוֹתָ֔ךְ עַל־אׇמְרֵ֖ךְ לֹ֥א חָטָֽאתִי׃ אֲנַחְנוּ בּוֹשְׁנוּ בְּמַעֲשֵֽׂינוּ וְנִכְלַמְנוּ בַּעֲוֹנוֹתֵֽינוּ, אֵין לָנוּ פֶּה לְהָשִׁיב וְלֹא מֵצַח לְהָרִים רֹאשׁ:");
					}

					addToSiddur(
						"אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ. אַל תַּעַשׂ עִמָּנוּ כָּלָה, תֹּאחֵז יָדְךָ בַּמִּשְׁפָּט. בְּבֹא תוֹכֵחָה נֶגְדֶּךָ, שְׁמֵנוּ מִסִּפְרְךָ אַל תֶּמַח. גִּשְׁתְּךָ לַחֲקֹר מוּסָר, רַחֲמֶיךָ יקַדְּמוּ רָגְזֶךָ. דַּלּוּת מַעֲשִׂים בְּשׁוּרֶךָ, קָרֵב צֶדֶק מֵאֵלֶיךָ. הוֹרֵנוּ, בְּזַעֲקֵנוּ לָךְ, צַו יְשׁוּעָתֵנוּ בְּמַפְגִּיעַ. וְתָשִׁיב שְׁבוּת אָהֳלֵי תָם, פְּתָחָיו רְאֵה כִּי שָׁמֵמוּ. זְכֹר נָאַמְתָּ, עֵדוּת לֹא תִשָּׁכַח מִפִּי זַרְעוֹ. חוֹתַם תְּעוּדָה תַּתִּיר, סוֹדְךָ שִׂים בְּלִמּוּדֶיךָ. טַבּוּר אַגַּן הַסַּהַר, נָא אַל יֶחְסַר הַמָּזֶג. יָהּ, דַּע אֶת יִשְׂרָאֵל אֲשֶׁר יְדָעוּךָ, מַגֵּר אֶת הַגּוֹיִם אֲשֶׁר לֹא יְדָעוּךָ. כִּי תָשִׁיב לְבִצָּרוֹן, לְכוּדִים אֲסִירֵי הַתִּקְוָה.");

					if (jewishDateInfo.getJewishCalendar().isTaanis()) {
						addToSiddurHighlighted(
							"אָשַׁמְנוּ מִכָּל־עָם, בֹּשְׁנוּ מִכָּל־גּוֹי. גָּלָה מִמֶּנּוּ מָשׂוֹשׂ, דָּוֶה לִבֵּנוּ בַּחֲטָאֵֽינוּ. הָחְבַּל אֶוְיֵֽינוּ, וְנִפְרָע פְּאֵרֵנוּ. זְבוּל מִקְדָּשֵׁנוּ, חָרֵב בַּעֲוֹנֵֽינוּ. טִירָתֵנוּ הָֽיְתָה לְשַׁמָּה, יְפִי אַדְמָתֵנוּ לְזָרִים, כֹּחֵנוּ לְנָכְרִים. לְעֵינֵינוּ עָֽשְׁקוּ עֲמָלֵנוּ, מְמֻשָּׁךְ וּמוֹרָט מִמֶּנּוּ. נָֽתְנוּ עֻלָּם עָלֵֽינוּ, סָבַלְנוּ עַל שִׁכְמֵנוּ. עֲבָדִים מָֽשְׁלוּ בָנוּ, פּוֹרֵק אֵין מִיָּדָם. צָרוֹת רַבּוֹת סְבָבוּנוּ, קְרָאנוּךָ יְהֹוָה אֱלֹהֵֽינוּ. רָחַקְתָּ מִמֶּנּוּ בַּעֲוֹנֵֽינוּ, שַׁבְנוּ מֵאַחֲרֶיךָ, תָּעִֽינוּ כַּצֹּאן וְאָבָֽדְנוּ. וַעֲדַיִן לֹא שַׁבְנוּ מִתְּעִיָּתֵנוּ, וְהֵיאַךְ נָעִיז פָּנֵֽינוּ, וְנַקְשֶׁה עָרְפֵּנוּ, לוֹמַר לְפָנֶיךָ יְהֹוָה אֱלֹהֵֽינוּ וֵאלֹהֵי אֲבוֹתֵֽינוּ צַדִּיקִים אֲנַחְנוּ וְלֹא־חָטָאנוּ: \n\n" +
							"עֶזְרָא הַסּוֹפֵר אָמַר לְפָנֶיךָ: אֱלֹהַי֙ בֹּ֣שְׁתִּי וְנִכְלַ֔מְתִּי לְהָרִ֧ים אֱלֹהַ֛י פָּנַ֖י אֵלֶ֑יךָ כִּ֣י עֲוֺנֹתֵ֤ינוּ רָבוּ֙ לְמַ֣עְלָה רֹּ֔אשׁ וְאַשְׁמָתֵ֥נוּ גָדְלָ֖ה עַ֥ד לַשָּׁמָֽיִם׃ וְאַתָּה אֱלוֹהַּ סְלִיחוֹת, חַנּוּן וְרַחוּם, אֶרֶךְ־אַפַּיִם וְרַב־חֶסֶד, וְלֹא עֲזַבְתָּם. אַל תַּעַזְבֵנוּ אָבִֽינוּ, אַל תִּטְּשֵׁנוּ מַלְכֵּנוּ, וְאַל תִּשְׁכָּחֵנוּ יוֹצְרֵנוּ, וְאַל תַּעַשׂ עִמָּנוּ כָלָה בְּגָלוּתֵנוּ, וְקַיֵּם לָנוּ יְהֹוָה אֱלֹהֵֽינוּ אֶת־הַדָּבָר שֶׁהִבְטַחְתָּנוּ, עַל יְדֵי יִרְמְיָה חוֹזָךְ, כָּאָמוּר: בַּיָּמִ֣ים הָהֵם֩ וּבָעֵ֨ת הַהִ֜יא נְאֻם־יְהֹוָ֗ה יְבֻקַּ֞שׁ אֶת־עֲוֺ֤ן יִשְׂרָאֵל֙ וְאֵינֶ֔נּוּ וְאֶת־חַטֹּ֥את יְהוּדָ֖ה וְלֹ֣א תִמָּצֶ֑אינָה כִּ֥י אֶסְלַ֖ח לַאֲשֶׁ֥ר אַשְׁאִֽיר׃ וְאַל יְעַכֵּב לְפָנֶיךָ כָּל־חֵטְא וְעוֹן אֶת תְּפִלָּתֵנוּ, וּמְחוֹל וּסְלַח לְכָל־עֲוֹנוֹתֵֽינוּ, כִּי אֵל טוֹב וְסַלָּח אָתָּה:");
					}

					addToSiddur(
						"מַה נֹּאמַר לְפָנֶיךָ יוֹשֵׁב מָרוֹם, וּמַה נְּסַפֵּר לְפָנֶיךָ שׁוֹכֵן שְׁחָקִים, הֲלֹא הַנִּסְתָּרוֹת וְהַנִּגְלוֹת אַתָּה יוֹדֵעַ, אַתָּה יוֹדֵעַ רָזֵי עוֹלָם, וְתַעֲלוּמוֹת סִתְרֵי כָּל חָי, אַתָּה חוֹפֵשׂ כָּל חַדְרֵי בָטֶן, רֹאֶה כְלָיוֹת וָלֵב. אֵין דָּבָר נֶעְלָם מִמָּךָּ, וְאֵין נִסְתָּר מִנֶּגֶד עֵינֶיךָ: \n\n" +
						"יְהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, שֶׁתִּמְחֹל לָנוּ אֶת-כָּל-חַטֹּאתֵינוּ, וּתְכַפֵּר לָנוּ אֶת-כָּל-עֲוֹנוֹתֵינוּ, וְתִמְחֹל וְתִסְלַח לְכָל פְּשָׁעֵינוּ, וְסָלַחְתָּ֛ לַעֲוֺנֵ֥נוּ וּלְחַטָּאתֵ֖נוּ וּנְחַלְתָּֽנוּ: \n\n" +
						"סְלַח לָנוּ אָבִינוּ כִּי חָטָאנוּ, מְחֹל לָנוּ מַלְכֵּנוּ כִּי פָשָׁעְנוּ: כִּֽי־אַתָּ֣ה אֲ֭דֹנָי ט֣וֹב וְסַלָּ֑ח וְרַב־חֶ֗֝סֶד לְכׇל־קֹֽרְאֶֽיךָ׃ לְמַֽעַן־שִׁמְךָ֥ יְהֹוָ֑ה וְֽסָלַחְתָּ֥ לַ֝עֲוֺנִ֗י כִּ֣י רַב־הֽוּא׃ לְמַעַן־שִׁמְךָ֣ יְהֹוָ֣ה תְּחַיֵּ֑נִי בְּצִדְקָתְךָ֓ ׀ תּוֹצִ֖יא מִצָּרָ֣ה נַפְשִֽׁי׃ יְהֹוָ֣ה צְבָא֣וֹת עִמָּ֑נוּ מִשְׂגָּֽב־לָ֨נוּ אֱלֹהֵ֖י יַֽעֲקֹ֣ב סֶֽלָה׃ יְהֹוָ֥ה צְבָא֑וֹת אַֽשְׁרֵ֥י אָ֝דָ֗ם בֹּטֵ֥חַ בָּֽךְ׃ יְהֹוָ֥ה הוֹשִׁ֑יעָה הַ֝מֶּ֗לֶךְ יַעֲנֵ֥נוּ בְיוֹם־קׇרְאֵֽנוּ: הֲשִׁיבֵ֨נוּ יְהֹוָ֤ה ׀ אֵלֶ֙יךָ֙ וְֽנָשׁ֔וּבָה חַדֵּ֥שׁ יָמֵ֖ינוּ כְּקֶֽדֶם׃ \n\n" +
						"וְה֤וּא רַח֨וּם ׀ יְכַפֵּ֥ר עָוֺן֮ וְֽלֹא־יַֽ֫שְׁחִ֥ית וְ֭הִרְבָּה לְהָשִׁ֣יב אַפּ֑וֹ וְלֹא־יָ֝עִ֗יר כׇּל־חֲמָתֽוֹ׃  אַתָּ֤ה יְהֹוָ֗ה לֹֽא־תִכְלָ֣א רַחֲמֶ֣יךָ מִמֶּ֑נִּי חַסְדְּךָ֥ וַ֝אֲמִתְּךָ֗ תָּמִ֥יד יִצְּרֽוּנִי׃ הוֹשִׁיעֵ֨נוּ ׀ יְהֹ֘וָ֤ה אֱלֹהֵ֗ינוּ וְקַבְּצֵנוּ֮ מִֽן־הַגּ֫וֹיִ֥ם לְ֭הֹדוֹת לְשֵׁ֣ם קׇדְשֶׁ֑ךָ לְ֝הִשְׁתַּבֵּ֗חַ בִּתְהִלָּתֶֽךָ: אִם־עֲוֺנ֥וֹת תִּשְׁמׇר־יָ֑הּ אֲ֝דֹנָ֗י מִ֣י יַעֲמֹֽד׃ כִּֽי־עִמְּךָ֥ הַסְּלִיחָ֑ה לְ֝מַ֗עַן תִּוָּרֵֽא׃ לֹ֣א כַ֭חֲטָאֵינוּ עָ֣שָׂה לָ֑נוּ וְלֹ֥א כַ֝עֲוֺנֹתֵ֗ינוּ גָּמַ֥ל עָלֵֽינוּ׃ אִם־עֲוֺנֵ֙ינוּ֙ עָ֣נוּ בָ֔נוּ יְהֹוָ֕ה עֲשֵׂ֖ה לְמַ֣עַן שְׁמֶ֑ךָ׃ זְכֹר־רַחֲמֶ֣יךָ יְ֭הֹוָה וַחֲסָדֶ֑יךָ כִּ֖י מֵעוֹלָ֣ם הֵֽמָּה׃ יַֽעַנְךָ֣ יְ֭הֹוָה בְּי֣וֹם צָרָ֑ה יְ֝שַׂגֶּבְךָ֗ שֵׁ֤ם ׀ אֱלֹהֵ֬י יַעֲקֹֽב׃ יְהֹוָ֥ה הוֹשִׁ֑יעָה הַ֝מֶּ֗לֶךְ יַעֲנֵ֥נוּ בְיוֹם־קׇרְאֵֽנוּ: אָבִינוּ מַלְכֵּנוּ, חָנֵּנוּ וַעֲנֵנוּ כִּי אֵין בָּנוּ מַעֲשִׂים. עֲשֵׂה עִמָּנוּ צְדָקָה כְּרֹב רַחֲמֶיךָ, וְהוֹשִׁיעֵנוּ לְמַעַן שְׁמֶךָ: \n\n" +
						"וְעַתָּ֣ה ׀ אֲדֹנָ֣י אֱלֹהֵ֗ינוּ אֲשֶׁר֩ הוֹצֵ֨אתָ אֶֽת־עַמְּךָ֜ מֵאֶ֤רֶץ מִצְרַ֙יִם֙ בְּיָ֣ד חֲזָקָ֔ה וַתַּֽעַשׂ־לְךָ֥ שֵׁ֖ם כַּיּ֣וֹם הַזֶּ֑ה חָטָ֖אנוּ רָשָֽׁעְנוּ׃ אֲדֹנָ֗י כְּכׇל־צִדְקֹתֶ֙ךָ֙ יָֽשׇׁב־נָ֤א אַפְּךָ֙ וַחֲמָ֣תְךָ֔ מֵעִֽירְךָ֥ יְרוּשָׁלַיִם הַר־קׇדְשֶׁ֑ךָ כִּ֤י בַחֲטָאֵ֙ינוּ֙ וּבַעֲוֺנ֣וֹת אֲבֹתֵ֔ינוּ יְרוּשָׁלַיִם וְעַמְּךָ֛ לְחֶרְפָּ֖ה לְכָל־סְבִיבֹתֵֽינוּ׃ וְעַתָּ֣ה ׀ שְׁמַ֣ע אֱלֹהֵ֗ינוּ אֶל־תְּפִלַּ֤ת עַבְדְּךָ֙ וְאֶל־תַּ֣חֲנוּנָ֔יו וְהָאֵ֣ר פָּנֶ֔יךָ עַל־מִקְדָּשְׁךָ֖ הַשָּׁמֵ֑ם לְמַ֖עַן אֲדֹנָֽי׃ הַטֵּ֨ה אֱלֹהַ֥י ׀ אׇזְנְךָ֮ וּֽשְׁמָע֒ פְּקַ֣ח עֵינֶ֗יךָ וּרְאֵה֙ שֹֽׁמְמֹתֵ֔ינוּ וְהָעִ֕יר אֲשֶׁר־נִקְרָ֥א שִׁמְךָ֖ עָלֶ֑יהָ כִּ֣י ׀ לֹ֣א עַל־צִדְקֹתֵ֗ינוּ אֲנַ֨חְנוּ מַפִּילִ֤ים תַּחֲנוּנֵ֙ינוּ֙ לְפָנֶ֔יךָ כִּ֖י עַל־רַחֲמֶ֥יךָ הָרַבִּֽים׃ אֲדֹנָ֤י ׀ שְׁמָ֙עָה֙ אֲדֹנָ֣י ׀ סְלָ֔חָה אֲדֹנָ֛י הַֽקְשִׁ֥יבָה וַעֲשֵׂ֖ה אַל־תְּאַחַ֑ר לְמַֽעַנְךָ֣ אֱלֹהַ֔י כִּֽי־שִׁמְךָ֣ נִקְרָ֔א עַל־עִירְךָ֖ וְעַל־עַמֶּֽךָ׃ \n\n" +
						"אָבִינוּ אָב הָרַחֲמָן, הַרְאֵנוּ אוֹת לְטוֹבָה וְקַבֵּץ נְפוּצוֹתֵינוּ מֵאַרְבַּע כַּנְפוֹת הָאָרֶץ. יַכִּירוּ וְיֵדְעוּ כָּל הַגּוֹיִם כִּי אַתָּה יְהֹוָה אָבִינוּ אָתָּה. אֲנַחְנוּ הַחֹמֶר וְאַתָּה יֹצְרֵנוּ וּמַעֲשֵׂה יָדְךָ כֻּלָּנוּ: \n\n" +
						"אָבִינוּ מַלְכֵּנוּ, צוּרֵנוּ וְגוֹאֲלֵנוּ, ח֧וּסָה יְהֹוָ֣ה עַל־עַמֶּ֗ךָ וְאַל־תִּתֵּ֨ן נַחֲלָתְךָ֤ לְחֶרְפָּה֙ לִמְשׇׁל־בָּ֣ם גּוֹיִ֔ם לָ֚מָּה יֹאמְר֣וּ בָעַמִּ֔ים אַיֵּ֖ה אֱלֹהֵיהֶֽם׃ יָדַעְנוּ יְהֹוָה כִּי חָטָאנוּ. וְאֵין מִי יַעֲמוֹד בַּעֲדֵנוּ אֶלָּא שִׁמְךָ הַגָּדוֹל יַעֲמוֹד לָנוּ בְּעֵת צָרָה. וּכְרַחֵם אָב עַל בָּנִים רַחֵם עָלֵינוּ. חֲמֹל עַל עַמָּךְ וְרַחֵם עַל נַחֲלָתָךְ. חוּסָה נָּא כְּרֹב רַחֲמֶיךָ חָנֵּנוּ מַלְכֵּנוּ וַעֲנֵנוּ. לְךָ יְהֹוָה הַצְּדָקָה עוֹשֵׂה נִפְלָאוֹת בְּכָל עֵת וָעֵת. הַבֵּט נָא וְהוֹשִׁיעָה נָּא צֹאן מַרְעִיתֶךָ. אַל יִמְשָׁל בָּנוּ קֶצֶף כִּי לְךָ יְהֹוָה הַיְשׁוּעָה בְּךָ תוֹחַלְתֵּנוּ. אֱלוֹהַּ סְלִיחוֹת אָנָּא סְלַח נָא. כִּי אֵל טוֹב וְסַלָּח אָתָּה: \n\n" +
						"אָנָּא מֶלֶךְ רַחוּם וְחַנּוּן, זְכוֹר וְהַבֵּט לִבְרִית בֵּין הַבְּתָרִים. וְתֵרָאֶה לְפָנֶיךָ עֲקֵדַת יָחִיד. וּלְמַעַן יִשְׂרָאֵל אָבִינוּ. אַל תַּעַזְבֵנוּ אָבִינוּ. וְאַל תִּטְּשֵׁנוּ מַלְכֵּנוּ וְאַל תִּשְׁכָּחֵנוּ יוֹצְרֵנוּ. וְאַל תַּעַשׂ עִמָּנוּ כָלָה בְּגָלוּתֵינוּ. כִּי אֵל מֶלֶךְ חַנּוּן וְרַחוּם אָתָּה: \n\n" +
						"אֵין כָּמוֹךָ חַנּוּן וְרַחוּם אֱלֹהֵינוּ. אֵין כָּמוֹךָ אֵל אֶרֶךְ אַפַּיִם וְרַב חֶסֶד וֶאֱמֶת. הושִׁיעֵנוּ וְרַחֲמֵנוּ מֵרַעַשׁ וּמֵרֹגֶז הַצִּילֵנוּ: זְכֹר֙ לַעֲבָדֶ֔יךָ לְאַבְרָהָ֥ם לְיִצְחָ֖ק וּֽלְיַעֲקֹ֑ב אַל־תֵּ֗פֶן אֶל־קְשִׁי֙ הָעָ֣ם הַזֶּ֔ה וְאֶל־רִשְׁע֖וֹ וְאֶל־חַטָּאתֽוֹ׃ שׁ֚וּב מֵחֲר֣וֹן אַפֶּ֔ךָ וְהִנָּחֵ֥ם עַל־הָרָעָ֖ה לְעַמֶּֽךָ׃ וְהָסֵר מִמֶּנּוּ מַכַּת הַמָּוֶת כִּי רַחוּם אָתָּה. כִּי כֵן דַּרְכְּךָ לַעֲשׂוֹת חֶסֶד חִנָּם בְּכָל דּוֹר וָדוֹר: אָנָּ֣א יְ֭הֹוָה הוֹשִׁ֘יעָ֥ה נָּ֑א אָנָּ֥א יְ֝הֹוָ֗ה הַצְלִ֘יחָ֥ה נָּֽא׃ אָנָּא יְהֹוָה עֲנֵנוּ בְיוֹם קָרְאֵנוּ: לְךָ יְהֹוָה קִוִּינוּ. לְךָ יְהֹוָה חִכִּינוּ. לְךָ יְהֹוָה נְיַחֵל אַל תֶּחֱשֶׁה וּתְעַנֵּנוּ. כִּי נָאֲמוּ גוֹיִם אָבְדָה תִקְוָתָם. כָּל בֶּרֶךְ לְךָ תִכְרַע וְכָל קוֹמָה לְפָנֶיךָ תִשְׁתַּחֲוֶה: \n\n" +
						"הַפּוֹתֵחַ יָד בִּתְשׁוּבָה לְקַבֵּל פּוֹשְׁעִים וְחַטָּאִים. נִבְהֲלָה נַפְשֵׁנוּ מֵרוֹב עִצְּבוֹנֵנוּ. אַל תִּשְׁכָּחֵנוּ נֶצַח קוּמָה וְהוֹשִׁיעֵנוּ. אַל תִּשְׁפּוֹךְ חֲרוֹנְךָ עָלֵינוּ כִּי עַמְּךָ אֲנַחְנוּ בְּנֵי בְרִיתֶךָ. אֵל הַבִּיטָה. דַּל כְּבוֹדֵנוּ בַגּוֹיִם וְשִׁקְּצוּנוּ כְּטֻמְאַת הַנִּדָּה. עַד מָתַי עֻזְּךָ בַּשְּׁבִי וְתִפְאַרְתְּךָ בְּיַד צָר. הֵמָּה יִרְאוּ וְיֵבשׁוּ וְיֵחַתּוּ מִגְּבוּרָתָם. עוֹרְרָה גְבוּרָתְךָ וְהוֹשִׁיעֵנוּ לְמַעַן שְׁמֶךָ. אַל יִמְעֲטוּ לְפָנֶיךָ תְּלָאוֹתֵינוּ מַהֵר יְקַדְּמוּנוּ רַחֲמֶיךָ בְּעֵת צָרוֹתֵנוּ. לֹא לְמַעֲנֵנוּ אֶלָּא לְמַעֲנָךְ פְּעֹל וְאַל תַּשְׁחֵת אֶת זֵכֶר שְׁאֵרִיתֵנוּ. כִּי לְךָ מְיַחֲלוֹת עֵינֵינוּ כִּי אֵל מֶלֶךְ חַנּוּן וְרַחוּם אָתָּה. וּזְכוֹר עֵדוּתֵינוּ בְּכָל יוֹם תָּמִיד אוֹמְרִים פַּעֲמַיִם בְּאַהֲבָה: שְׁמַ֖ע יִשְׂרָאֵ֑ל יְהֹוָ֥ה אֱלֹהֵ֖ינוּ יְהֹוָ֥ה ׀ אֶחָֽד׃");
				}
			} else {// no tachanun
				addToSiddurHighlighted(
					"יְהִ֤י שֵׁ֣ם יְהֹוָ֣ה מְבֹרָ֑ךְ מֵ֝עַתָּ֗ה וְעַד־עוֹלָֽם׃ מִמִּזְרַח־שֶׁ֥מֶשׁ עַד־מְבוֹא֑וֹ מְ֝הֻלָּ֗ל שֵׁ֣ם יְהֹוָֽה׃ רָ֖ם עַל־כׇּל־גּוֹיִ֥ם ׀ יְהֹוָ֑ה עַ֖ל הַשָּׁמַ֣יִם כְּבוֹדֽוֹ׃ יְהֹוָ֥ה אֲדֹנֵ֑ינוּ מָה־אַדִּ֥יר שִׁ֝מְךָ֗ בְּכׇל־הָאָֽרֶץ׃");
			}

			addHalfKaddish(false);
		}

		if ((jewishDateInfo.getJewishCalendar().getDayOfWeek() == 2
			|| jewishDateInfo.getJewishCalendar().getDayOfWeek() == 5)
			|| jewishDateInfo.getJewishCalendar().isPurim()
			|| jewishDateInfo.getJewishCalendar().isTaanis()
			|| jewishDateInfo.getJewishCalendar().isRoshChodesh()
			|| jewishDateInfo.getJewishCalendar().isCholHamoed()
			|| jewishDateInfo.getJewishCalendar().isChanukah()) {

			if (!jewishDateInfo.getJewishCalendar().isCholHamoedSuccos()) {// torah was taken out before hoshanot
				addHotzahSeferTorah();
			}

			if (jewishDateInfo.getJewishCalendar().getIsSafekMukafChoma()) {
				addToSiddurHighlighted(
					"ב-14 באדר, בעיר שהיא ספק מוקפת חומה, קוראים את התורה עם הברכות, ולא אומרים את הברכות ב-15. עם זאת, אלו שיש להם מנהג לומר את הברכות גם ב-15 יש להם על מה לסמוך/In a safek mufak choma, we read the Torah with the berachot on the 14th of Adar (Purim), and we do not say the berachot on the 15th (Shushan Purim). However, those that have a custom to say the berachot on the 15th as well have what to rely on (הליכות עולם רלא)");
			}
			addToSiddur(
				"כשמגיע לדוכן, מגביה את ספר התורה ומראה הכתב לקהל ואומרים (When it reaches the platform, raise the Torah for everyone to see and say) \n\n" +
				"וְזֹ֖את הַתּוֹרָ֑ה אֲשֶׁר־שָׂ֣ם מֹשֶׁ֔ה לִפְנֵ֖י בְּנֵ֥י יִשְׂרָאֵֽל׃ תּוֹרָ֥ה צִוָּה־לָ֖נוּ מֹשֶׁ֑ה מוֹרָשָׁ֖ה קְהִלַּ֥ת יַעֲקֹֽב׃ הָאֵל֮ תָּמִ֢ים דַּ֫רְכּ֥וֹ אִמְרַֽת־יְהֹוָ֥ה צְרוּפָ֑ה מָגֵ֥ן ה֝֗וּא לְכֹ֤ל ׀ הַחֹסִ֬ים בּֽוֹ׃");

			if (jewishDateInfo.getJewishCalendar().isRoshChodesh()) {
				addToSiddur("קוראים ד' עולים (Four people go up for Aliya)");
			} else {
				addToSiddur("קוראים ג' עולים (Three people go up for Aliya)");
			}

			addToSiddur(
				"ואומר העולה: הַשֵּׁם עִמָּכֶם: \n\n" +
				"ועונים הקהל: יְבָרֶכְךָ הַשֵּׁם: \n\n" +
				"ואומר העולה: בָּרְכוּ אֶת יְהֹוָה הַמְּבֹרָךְ: \n\n" +
				"ועונים הקהל: בָּרוּךְ יְהֹוָה הַמְּבֹרָךְ לְעוֹלָם וָעֶד: \n\n" +
				"וחוזר העולה: בָּרוּךְ יְהֹוָה הַמְּבֹרָךְ לְעוֹלָם וָעֶד: \n\n" +
				"ומברך העולה לפני הקריאה \n\n" +
				"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ  מֶלֶךְ הָעוֹלָם, אֲשֶׁר בָּחַר בָּנוּ מִכָּל הָעַמִּים וְנָתַן לָנוּ אֶת תּוֹרָתוֹ. בָּרוּךְ אַתָּה יְהֹוָה, נוֹתֵן הַתּוֹרָה: [אמן] \n\n" +
				"אחר הקריאה מברך העולה \n\n" +
				"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ  מֶלֶךְ הָעוֹלָם, אֲשֶׁר נָתַן לָנוּ אֶת תּוֹרָתוֹ תּוֹרַת אֱמֶת, וְחַיֵּי עוֹלָם נָטַע בְּתוֹכֵנוּ. בָּרוּךְ אַתָּה יְהֹוָה, נוֹתֵן הַתּוֹרָה: [אמן]");

			if (jewishDateInfo.getJewishCalendar().isRoshChodesh()) {
				addToSiddur(
					"[כהן]: וַיְדַבֵּ֥ר יְהֹוָ֖ה אֶל־מֹשֶׁ֥ה לֵּאמֹֽר׃ צַ֚ו אֶת־בְּנֵ֣י יִשְׂרָאֵ֔ל וְאָמַרְתָּ֖ אֲלֵהֶ֑ם אֶת־קׇרְבָּנִ֨י לַחְמִ֜י לְאִשַּׁ֗י רֵ֚יחַ נִֽיחֹחִ֔י תִּשְׁמְר֕וּ לְהַקְרִ֥יב לִ֖י בְּמוֹעֲדֽוֹ׃ וְאָמַרְתָּ֣ לָהֶ֔ם זֶ֚ה הָֽאִשֶּׁ֔ה אֲשֶׁ֥ר תַּקְרִ֖יבוּ לַיהֹוָ֑ה כְּבָשִׂ֨ים בְּנֵֽי־שָׁנָ֧ה תְמִימִ֛ם שְׁנַ֥יִם לַיּ֖וֹם עֹלָ֥ה תָמִֽיד׃ " +
					(!jewishDateInfo.getJewishCalendar().isChanukah() ? "\n\n[לוי חוזר מ''ואמרת להם'']: וְאָמַרְתָּ֣ לָהֶ֔ם זֶ֚ה הָֽאִשֶּׁ֔ה אֲשֶׁ֥ר תַּקְרִ֖יבוּ לַיהֹוָ֑ה כְּבָשִׂ֨ים בְּנֵֽי־שָׁנָ֧ה תְמִימִ֛ם שְׁנַ֥יִם לַיּ֖וֹם עֹלָ֥ה תָמִֽיד׃ " : "") +
					"אֶת־הַכֶּ֥בֶשׂ אֶחָ֖ד תַּעֲשֶׂ֣ה בַבֹּ֑קֶר וְאֵת֙ הַכֶּ֣בֶשׂ הַשֵּׁנִ֔י תַּעֲשֶׂ֖ה בֵּ֥ין הָֽעַרְבָּֽיִם׃ וַעֲשִׂירִ֧ית הָאֵיפָ֛ה סֹ֖לֶת לְמִנְחָ֑ה בְּלוּלָ֛ה בְּשֶׁ֥מֶן כָּתִ֖ית רְבִיעִ֥ת הַהִֽין׃ " + "\n\n" +
					(jewishDateInfo.getJewishCalendar().isChanukah() ? "[לוי]:" : "[שלישי]:") + " עֹלַ֖ת תָּמִ֑יד הָעֲשֻׂיָה֙ בְּהַ֣ר סִינַ֔י לְרֵ֣יחַ נִיחֹ֔חַ אִשֶּׁ֖ה לַֽיהֹוָֽה׃ וְנִסְכּוֹ֙ רְבִיעִ֣ת הַהִ֔ין לַכֶּ֖בֶשׂ הָאֶחָ֑ד בַּקֹּ֗דֶשׁ הַסֵּ֛ךְ נֶ֥סֶךְ שֵׁכָ֖ר לַיהֹוָֽה׃ וְאֵת֙ הַכֶּ֣בֶשׂ הַשֵּׁנִ֔י תַּעֲשֶׂ֖ה בֵּ֣ין הָֽעַרְבָּ֑יִם כְּמִנְחַ֨ת הַבֹּ֤קֶר וּכְנִסְכּוֹ֙ תַּעֲשֶׂ֔ה אִשֵּׁ֛ה רֵ֥יחַ נִיחֹ֖חַ לַיהֹוָֽה׃ \n" +
					"וּבְיוֹם֙ הַשַּׁבָּ֔ת שְׁנֵֽי־כְבָשִׂ֥ים בְּנֵֽי־שָׁנָ֖ה תְּמִימִ֑ם וּשְׁנֵ֣י עֶשְׂרֹנִ֗ים סֹ֧לֶת מִנְחָ֛ה בְּלוּלָ֥ה בַשֶּׁ֖מֶן וְנִסְכּֽוֹ׃ עֹלַ֥ת שַׁבַּ֖ת בְּשַׁבַּתּ֑וֹ עַל־עֹלַ֥ת הַתָּמִ֖יד וְנִסְכָּֽהּ׃ \n\n" +
					(jewishDateInfo.getJewishCalendar().isChanukah() ? "[שלישי]:" : "[רביעי]:") + " וּבְרָאשֵׁי֙ חׇדְשֵׁיכֶ֔ם תַּקְרִ֥יבוּ עֹלָ֖ה לַיהֹוָ֑ה פָּרִ֨ים בְּנֵֽי־בָקָ֤ר שְׁנַ֙יִם֙ וְאַ֣יִל אֶחָ֔ד כְּבָשִׂ֧ים בְּנֵי־שָׁנָ֛ה שִׁבְעָ֖ה תְּמִימִֽם׃ וּשְׁלֹשָׁ֣ה עֶשְׂרֹנִ֗ים סֹ֤לֶת מִנְחָה֙ בְּלוּלָ֣ה בַשֶּׁ֔מֶן לַפָּ֖ר הָאֶחָ֑ד וּשְׁנֵ֣י עֶשְׂרֹנִ֗ים סֹ֤לֶת מִנְחָה֙ בְּלוּלָ֣ה בַשֶּׁ֔מֶן לָאַ֖יִל הָֽאֶחָֽד׃ וְעִשָּׂרֹ֣ן עִשָּׂר֗וֹן סֹ֤לֶת מִנְחָה֙ בְּלוּלָ֣ה בַשֶּׁ֔מֶן לַכֶּ֖בֶשׂ הָאֶחָ֑ד עֹלָה֙ רֵ֣יחַ נִיחֹ֔חַ אִשֶּׁ֖ה לַיהֹוָֽה׃ וְנִסְכֵּיהֶ֗ם חֲצִ֣י הַהִין֩ יִהְיֶ֨ה לַפָּ֜ר וּשְׁלִישִׁ֧ת הַהִ֣ין לָאַ֗יִל וּרְבִיעִ֥ת הַהִ֛ין לַכֶּ֖בֶשׂ יָ֑יִן זֹ֣את עֹלַ֥ת חֹ֙דֶשׁ֙ בְּחׇדְשׁ֔וֹ לְחׇדְשֵׁ֖י הַשָּׁנָֽה׃ וּשְׂעִ֨יר עִזִּ֥ים אֶחָ֛ד לְחַטָּ֖את לַיהֹוָ֑ה עַל־עֹלַ֧ת הַתָּמִ֛יד יֵעָשֶׂ֖ה וְנִסְכּֽוֹ׃");

				if (jewishDateInfo.getJewishCalendar().isChanukah()) {
					addToSiddurHighlighted("רביעי:");
					addChanukaTorahReading();
				}

				addToSiddurHighlighted("בסיום הקריאה אומר המשלים חצי קדיש (The one who received the fourth aliya should say Kaddish)");
			} else if (jewishDateInfo.getJewishCalendar().isChanukah()) {
				if (jewishDateInfo.getJewishCalendar().getDayOfChanukah() != 1) {
					addToSiddurHighlighted(
						" הראשון קורא את שלושת הפסוקים הראשונים, השני קורא את שלושת הפסוקים הבאים, והמשלים חוזר על הכל ואומר חצי קדיש (the first person reads the first three verses, the second person reads the next three verses, and the last person repeats everything and says Half Kaddish)");
				}
				addChanukaTorahReading();
			} else if (jewishDateInfo.getJewishCalendar().isCholHamoedPesach()) {
				if (jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 16) { // 2nd day of pesach, only shown in Israel
					addToSiddurHighlighted(
						"[כהן]: וַיְדַבֵּ֥ר יְהֹוָ֖ה אֶל־מֹשֶׁ֥ה לֵּאמֹֽר׃ \n" +
						"שׁ֣וֹר אוֹ־כֶ֤שֶׂב אוֹ־עֵז֙ כִּ֣י יִוָּלֵ֔ד וְהָיָ֛ה שִׁבְעַ֥ת יָמִ֖ים תַּ֣חַת אִמּ֑וֹ וּמִיּ֤וֹם הַשְּׁמִינִי֙ וָהָ֔לְאָה יֵרָצֶ֕ה לְקׇרְבַּ֥ן אִשֶּׁ֖ה לַיהֹוָֽה׃ \n" +
						"וְשׁ֖וֹר אוֹ־שֶׂ֑ה אֹת֣וֹ וְאֶת־בְּנ֔וֹ לֹ֥א תִשְׁחֲט֖וּ בְּי֥וֹם אֶחָֽד׃ \n" +
						"וְכִֽי־תִזְבְּח֥וּ זֶֽבַח־תּוֹדָ֖ה לַיהֹוָ֑ה לִֽרְצֹנְכֶ֖ם תִּזְבָּֽחוּ׃ \n" +
						"בַּיּ֤וֹם הַהוּא֙ יֵאָכֵ֔ל לֹֽא־תוֹתִ֥ירוּ מִמֶּ֖נּוּ עַד־בֹּ֑קֶר אֲנִ֖י יְהֹוָֽה׃ \n" +
						"וּשְׁמַרְתֶּם֙ מִצְוֺתַ֔י וַעֲשִׂיתֶ֖ם אֹתָ֑ם אֲנִ֖י יְהֹוָֽה׃ \n" +
						"וְלֹ֤א תְחַלְּלוּ֙ אֶת־שֵׁ֣ם קׇדְשִׁ֔י וְנִ֨קְדַּשְׁתִּ֔י בְּת֖וֹךְ בְּנֵ֣י יִשְׂרָאֵ֑ל אֲנִ֥י יְהֹוָ֖ה מְקַדִּשְׁכֶֽם׃ \n" +
						"הַמּוֹצִ֤יא אֶתְכֶם֙ מֵאֶ֣רֶץ מִצְרַ֔יִם לִהְי֥וֹת לָכֶ֖ם לֵאלֹהִ֑ים אֲנִ֖י יְהֹוָֽה׃ \n" +
						"וַיְדַבֵּ֥ר יְהֹוָ֖ה אֶל־מֹשֶׁ֥ה לֵּאמֹֽר׃ \n" +
						"דַּבֵּ֞ר אֶל־בְּנֵ֤י יִשְׂרָאֵל֙ וְאָמַרְתָּ֣ אֲלֵהֶ֔ם מוֹעֲדֵ֣י יְהֹוָ֔ה אֲשֶׁר־תִּקְרְא֥וּ אֹתָ֖ם מִקְרָאֵ֣י קֹ֑דֶשׁ אֵ֥לֶּה הֵ֖ם מוֹעֲדָֽי׃ \n" +
						"שֵׁ֣שֶׁת יָמִים֮ תֵּעָשֶׂ֣ה מְלָאכָה֒ וּבַיּ֣וֹם הַשְּׁבִיעִ֗י שַׁבַּ֤ת שַׁבָּתוֹן֙ מִקְרָא־קֹ֔דֶשׁ כׇּל־מְלָאכָ֖ה לֹ֣א תַעֲשׂ֑וּ שַׁבָּ֥ת הִוא֙ לַֽיהֹוָ֔ה בְּכֹ֖ל מוֹשְׁבֹֽתֵיכֶֽם׃\n\n" +
						"[לוי]: אֵ֚לֶּה מוֹעֲדֵ֣י יְהֹוָ֔ה מִקְרָאֵ֖י קֹ֑דֶשׁ אֲשֶׁר־תִּקְרְא֥וּ אֹתָ֖ם בְּמוֹעֲדָֽם׃ \n" +
						"בַּחֹ֣דֶשׁ הָרִאשׁ֗וֹן בְּאַרְבָּעָ֥ה עָשָׂ֛ר לַחֹ֖דֶשׁ בֵּ֣ין הָעַרְבָּ֑יִם פֶּ֖סַח לַיהֹוָֽה׃ \n" +
						"וּבַחֲמִשָּׁ֨ה עָשָׂ֥ר יוֹם֙ לַחֹ֣דֶשׁ הַזֶּ֔ה חַ֥ג הַמַּצּ֖וֹת לַיהֹוָ֑ה שִׁבְעַ֥ת יָמִ֖ים מַצּ֥וֹת תֹּאכֵֽלוּ׃ \n" +
						"בַּיּוֹם֙ הָֽרִאשׁ֔וֹן מִקְרָא־קֹ֖דֶשׁ יִהְיֶ֣ה לָכֶ֑ם כׇּל־מְלֶ֥אכֶת עֲבֹדָ֖ה לֹ֥א תַעֲשֽׂוּ׃ \n" +
						"וְהִקְרַבְתֶּ֥ם אִשֶּׁ֛ה לַיהֹוָ֖ה שִׁבְעַ֣ת יָמִ֑ים בַּיּ֤וֹם הַשְּׁבִיעִי֙ מִקְרָא־קֹ֔דֶשׁ כׇּל־מְלֶ֥אכֶת עֲבֹדָ֖ה לֹ֥א תַעֲשֽׂוּ׃ \n" +
						"וַיְדַבֵּ֥ר יְהֹוָ֖ה אֶל־מֹשֶׁ֥ה לֵּאמֹֽר׃ \n" +
						"דַּבֵּ֞ר אֶל־בְּנֵ֤י יִשְׂרָאֵל֙ וְאָמַרְתָּ֣ אֲלֵהֶ֔ם כִּֽי־תָבֹ֣אוּ אֶל־הָאָ֗רֶץ אֲשֶׁ֤ר אֲנִי֙ נֹתֵ֣ן לָכֶ֔ם וּקְצַרְתֶּ֖ם אֶת־קְצִירָ֑הּ וַהֲבֵאתֶ֥ם אֶת־עֹ֛מֶר רֵאשִׁ֥ית קְצִירְכֶ֖ם אֶל־הַכֹּהֵֽן׃ \n" +
						"וְהֵנִ֧יף אֶת־הָעֹ֛מֶר לִפְנֵ֥י יְהֹוָ֖ה לִֽרְצֹנְכֶ֑ם מִֽמׇּחֳרַת֙ הַשַּׁבָּ֔ת יְנִיפֶ֖נּוּ הַכֹּהֵֽן׃ \n" +
						"וַעֲשִׂיתֶ֕ם בְּי֥וֹם הֲנִֽיפְכֶ֖ם אֶת־הָעֹ֑מֶר כֶּ֣בֶשׂ תָּמִ֧ים בֶּן־שְׁנָת֛וֹ לְעֹלָ֖ה לַיהֹוָֽה׃ \n" +
						"וּמִנְחָתוֹ֩ שְׁנֵ֨י עֶשְׂרֹנִ֜ים סֹ֣לֶת בְּלוּלָ֥ה בַשֶּׁ֛מֶן אִשֶּׁ֥ה לַיהֹוָ֖ה רֵ֣יחַ נִיחֹ֑חַ וְנִסְכֹּ֥ה יַ֖יִן רְבִיעִ֥ת הַהִֽין׃ \n" +
						"וְלֶ֩חֶם֩ וְקָלִ֨י וְכַרְמֶ֜ל לֹ֣א תֹֽאכְל֗וּ עַד־עֶ֙צֶם֙ הַיּ֣וֹם הַזֶּ֔ה עַ֚ד הֲבִ֣יאֲכֶ֔ם אֶת־קׇרְבַּ֖ן אֱלֹהֵיכֶ֑ם חֻקַּ֤ת עוֹלָם֙ לְדֹרֹ֣תֵיכֶ֔ם בְּכֹ֖ל מֹשְׁבֹֽתֵיכֶֽם׃ \n" +
						"וּסְפַרְתֶּ֤ם לָכֶם֙ מִמׇּחֳרַ֣ת הַשַּׁבָּ֔ת מִיּוֹם֙ הֲבִ֣יאֲכֶ֔ם אֶת־עֹ֖מֶר הַתְּנוּפָ֑ה שֶׁ֥בַע שַׁבָּת֖וֹת תְּמִימֹ֥ת תִּהְיֶֽינָה׃ \n" +
						"עַ֣ד מִֽמׇּחֳרַ֤ת הַשַּׁבָּת֙ הַשְּׁבִיעִ֔ת תִּסְפְּר֖וּ חֲמִשִּׁ֣ים י֑וֹם וְהִקְרַבְתֶּ֛ם מִנְחָ֥ה חֲדָשָׁ֖ה לַיהֹוָֽה׃ \n" +
						"מִמּוֹשְׁבֹ֨תֵיכֶ֜ם תָּבִ֣יאּוּ ׀ לֶ֣חֶם תְּנוּפָ֗ה שְׁ֚תַּיִם שְׁנֵ֣י עֶשְׂרֹנִ֔ים סֹ֣לֶת תִּהְיֶ֔ינָה חָמֵ֖ץ תֵּאָפֶ֑ינָה בִּכּוּרִ֖ים לַֽיהֹוָֽה׃ \n" +
						"וְהִקְרַבְתֶּ֣ם עַל־הַלֶּ֗חֶם שִׁבְעַ֨ת כְּבָשִׂ֤ים תְּמִימִם֙ בְּנֵ֣י שָׁנָ֔ה וּפַ֧ר בֶּן־בָּקָ֛ר אֶחָ֖ד וְאֵילִ֣ם שְׁנָ֑יִם יִהְי֤וּ עֹלָה֙ לַֽיהֹוָ֔ה וּמִנְחָתָם֙ וְנִסְכֵּיהֶ֔ם אִשֵּׁ֥ה רֵֽיחַ־נִיחֹ֖חַ לַיהֹוָֽה׃ \n" +
						"וַעֲשִׂיתֶ֛ם שְׂעִיר־עִזִּ֥ים אֶחָ֖ד לְחַטָּ֑את וּשְׁנֵ֧י כְבָשִׂ֛ים בְּנֵ֥י שָׁנָ֖ה לְזֶ֥בַח שְׁלָמִֽים׃ \n" +
						"וְהֵנִ֣יף הַכֹּהֵ֣ן ׀ אֹתָ֡ם עַל֩ לֶ֨חֶם הַבִּכֻּרִ֤ים תְּנוּפָה֙ לִפְנֵ֣י יְהֹוָ֔ה עַל־שְׁנֵ֖י כְּבָשִׂ֑ים קֹ֛דֶשׁ יִהְי֥וּ לַיהֹוָ֖ה לַכֹּהֵֽן׃ \n" +
						"וּקְרָאתֶ֞ם בְּעֶ֣צֶם ׀ הַיּ֣וֹם הַזֶּ֗ה מִֽקְרָא־קֹ֙דֶשׁ֙ יִהְיֶ֣ה לָכֶ֔ם כׇּל־מְלֶ֥אכֶת עֲבֹדָ֖ה לֹ֣א תַעֲשׂ֑וּ חֻקַּ֥ת עוֹלָ֛ם בְּכׇל־מוֹשְׁבֹ֥תֵיכֶ֖ם לְדֹרֹֽתֵיכֶֽם׃ \n" +
						"וּֽבְקֻצְרְכֶ֞ם אֶת־קְצִ֣יר אַרְצְכֶ֗ם לֹֽא־תְכַלֶּ֞ה פְּאַ֤ת שָֽׂדְךָ֙ בְּקֻצְרֶ֔ךָ וְלֶ֥קֶט קְצִירְךָ֖ לֹ֣א תְלַקֵּ֑ט לֶֽעָנִ֤י וְלַגֵּר֙ תַּעֲזֹ֣ב אֹתָ֔ם אֲנִ֖י יְהֹוָ֥ה אֱלֹהֵיכֶֽם׃\n\n" +
						"[שלישי]: וַיְדַבֵּ֥ר יְהֹוָ֖ה אֶל־מֹשֶׁ֥ה לֵּאמֹֽר׃ \n" +
						"דַּבֵּ֛ר אֶל־בְּנֵ֥י יִשְׂרָאֵ֖ל לֵאמֹ֑ר בַּחֹ֨דֶשׁ הַשְּׁבִיעִ֜י בְּאֶחָ֣ד לַחֹ֗דֶשׁ יִהְיֶ֤ה לָכֶם֙ שַׁבָּת֔וֹן זִכְר֥וֹן תְּרוּעָ֖ה מִקְרָא־קֹֽדֶשׁ׃ \n" +
						"כׇּל־מְלֶ֥אכֶת עֲבֹדָ֖ה לֹ֣א תַעֲשׂ֑וּ וְהִקְרַבְתֶּ֥ם אִשֶּׁ֖ה לַיהֹוָֽה׃ \n" +
						"וַיְדַבֵּ֥ר יְהֹוָ֖ה אֶל־מֹשֶׁ֥ה לֵּאמֹֽר׃ \n" +
						"אַ֡ךְ בֶּעָשׂ֣וֹר לַחֹ֩דֶשׁ֩ הַשְּׁבִיעִ֨י הַזֶּ֜ה י֧וֹם הַכִּפֻּרִ֣ים ה֗וּא מִֽקְרָא־קֹ֙דֶשׁ֙ יִהְיֶ֣ה לָכֶ֔ם וְעִנִּיתֶ֖ם אֶת־נַפְשֹׁתֵיכֶ֑ם וְהִקְרַבְתֶּ֥ם אִשֶּׁ֖ה לַיהֹוָֽה׃ \n" +
						"וְכׇל־מְלָאכָה֙ לֹ֣א תַעֲשׂ֔וּ בְּעֶ֖צֶם הַיּ֣וֹם הַזֶּ֑ה כִּ֣י י֤וֹם כִּפֻּרִים֙ ה֔וּא לְכַפֵּ֣ר עֲלֵיכֶ֔ם לִפְנֵ֖י יְהֹוָ֥ה אֱלֹהֵיכֶֽם׃ \n" +
						"כִּ֤י כׇל־הַנֶּ֙פֶשׁ֙ אֲשֶׁ֣ר לֹֽא־תְעֻנֶּ֔ה בְּעֶ֖צֶם הַיּ֣וֹם הַזֶּ֑ה וְנִכְרְתָ֖ה מֵֽעַמֶּֽיהָ׃ \n" +
						"וְכׇל־הַנֶּ֗פֶשׁ אֲשֶׁ֤ר תַּעֲשֶׂה֙ כׇּל־מְלָאכָ֔ה בְּעֶ֖צֶם הַיּ֣וֹם הַזֶּ֑ה וְהַֽאֲבַדְתִּ֛י אֶת־הַנֶּ֥פֶשׁ הַהִ֖וא מִקֶּ֥רֶב עַמָּֽהּ׃ \n" +
						"כׇּל־מְלָאכָ֖ה לֹ֣א תַעֲשׂ֑וּ חֻקַּ֤ת עוֹלָם֙ לְדֹרֹ֣תֵיכֶ֔ם בְּכֹ֖ל מֹשְׁבֹֽתֵיכֶֽם׃ \n" +
						"שַׁבַּ֨ת שַׁבָּת֥וֹן הוּא֙ לָכֶ֔ם וְעִנִּיתֶ֖ם אֶת־נַפְשֹׁתֵיכֶ֑ם בְּתִשְׁעָ֤ה לַחֹ֙דֶשׁ֙ בָּעֶ֔רֶב מֵעֶ֣רֶב עַד־עֶ֔רֶב תִּשְׁבְּת֖וּ שַׁבַּתְּכֶֽם׃ \n" +
						"וַיְדַבֵּ֥ר יְהֹוָ֖ה אֶל־מֹשֶׁ֥ה לֵּאמֹֽר׃ \n" +
						"דַּבֵּ֛ר אֶל־בְּנֵ֥י יִשְׂרָאֵ֖ל לֵאמֹ֑ר בַּחֲמִשָּׁ֨ה עָשָׂ֜ר י֗וֹם לַחֹ֤דֶשׁ הַשְּׁבִיעִי֙ הַזֶּ֔ה חַ֧ג הַסֻּכּ֛וֹת שִׁבְעַ֥ת יָמִ֖ים לַיהֹוָֽה׃ \n" +
						"בַּיּ֥וֹם הָרִאשׁ֖וֹן מִקְרָא־קֹ֑דֶשׁ כׇּל־מְלֶ֥אכֶת עֲבֹדָ֖ה לֹ֥א תַעֲשֽׂוּ׃ \n" +
						"שִׁבְעַ֣ת יָמִ֔ים תַּקְרִ֥יבוּ אִשֶּׁ֖ה לַיהֹוָ֑ה בַּיּ֣וֹם הַשְּׁמִינִ֡י מִקְרָא־קֹ֩דֶשׁ֩ יִהְיֶ֨ה לָכֶ֜ם וְהִקְרַבְתֶּ֨ם אִשֶּׁ֤ה לַֽיהֹוָה֙ עֲצֶ֣רֶת הִ֔וא כׇּל־מְלֶ֥אכֶת עֲבֹדָ֖ה לֹ֥א תַעֲשֽׂוּ׃ \n" +
						"אֵ֚לֶּה מוֹעֲדֵ֣י יְהֹוָ֔ה אֲשֶׁר־תִּקְרְא֥וּ אֹתָ֖ם מִקְרָאֵ֣י קֹ֑דֶשׁ לְהַקְרִ֨יב אִשֶּׁ֜ה לַיהֹוָ֗ה עֹלָ֧ה וּמִנְחָ֛ה זֶ֥בַח וּנְסָכִ֖ים דְּבַר־י֥וֹם בְּיוֹמֽוֹ׃ \n" +
						"מִלְּבַ֖ד שַׁבְּתֹ֣ת יְהֹוָ֑ה וּמִלְּבַ֣ד מַתְּנֽוֹתֵיכֶ֗ם וּמִלְּבַ֤ד כׇּל־נִדְרֵיכֶם֙ וּמִלְּבַד֙ כׇּל־נִדְבֹ֣תֵיכֶ֔ם אֲשֶׁ֥ר תִּתְּנ֖וּ לַיהֹוָֽה׃ \n" +
						"אַ֡ךְ בַּחֲמִשָּׁה֩ עָשָׂ֨ר י֜וֹם לַחֹ֣דֶשׁ הַשְּׁבִיעִ֗י בְּאׇסְפְּכֶם֙ אֶת־תְּבוּאַ֣ת הָאָ֔רֶץ תָּחֹ֥גּוּ אֶת־חַג־יְהֹוָ֖ה שִׁבְעַ֣ת יָמִ֑ים בַּיּ֤וֹם הָֽרִאשׁוֹן֙ שַׁבָּת֔וֹן וּבַיּ֥וֹם הַשְּׁמִינִ֖י שַׁבָּתֽוֹן׃ \n" +
						"וּלְקַחְתֶּ֨ם לָכֶ֜ם בַּיּ֣וֹם הָרִאשׁ֗וֹן פְּרִ֨י עֵ֤ץ הָדָר֙ כַּפֹּ֣ת תְּמָרִ֔ים וַעֲנַ֥ף עֵץ־עָבֹ֖ת וְעַרְבֵי־נָ֑חַל וּשְׂמַחְתֶּ֗ם לִפְנֵ֛י יְהֹוָ֥ה אֱלֹהֵיכֶ֖ם שִׁבְעַ֥ת יָמִֽים׃ \n" +
						"וְחַגֹּתֶ֤ם אֹתוֹ֙ חַ֣ג לַֽיהֹוָ֔ה שִׁבְעַ֥ת יָמִ֖ים בַּשָּׁנָ֑ה חֻקַּ֤ת עוֹלָם֙ לְדֹרֹ֣תֵיכֶ֔ם בַּחֹ֥דֶשׁ הַשְּׁבִיעִ֖י תָּחֹ֥גּוּ אֹתֽוֹ׃ \n" +
						"בַּסֻּכֹּ֥ת תֵּשְׁב֖וּ שִׁבְעַ֣ת יָמִ֑ים כׇּל־הָֽאֶזְרָח֙ בְּיִשְׂרָאֵ֔ל יֵשְׁב֖וּ בַּסֻּכֹּֽת׃ \n" +
						"לְמַ֘עַן֮ יֵדְע֣וּ דֹרֹֽתֵיכֶם֒ כִּ֣י בַסֻּכּ֗וֹת הוֹשַׁ֙בְתִּי֙ אֶת־בְּנֵ֣י יִשְׂרָאֵ֔ל בְּהוֹצִיאִ֥י אוֹתָ֖ם מֵאֶ֣רֶץ מִצְרָ֑יִם אֲנִ֖י יְהֹוָ֥ה אֱלֹהֵיכֶֽם׃ \n" +
						"וַיְדַבֵּ֣ר מֹשֶׁ֔ה אֶֽת־מֹעֲדֵ֖י יְהֹוָ֑ה אֶל־בְּנֵ֖י יִשְׂרָאֵֽל׃");
				} else if (jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 17) {// 3rd day
					addToSiddurHighlighted(
						"[כהן]: " + WeeklyParashaReadings.tefilinParashatBo[0] + "\n\n" +
						"[לוי]: " + WeeklyParashaReadings.tefilinParashatBo[1] + "\n\n" +
						"[שלישי]: " + WeeklyParashaReadings.tefilinParashatBo[2]);
				} else if (jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 18) {// 4th day
					addToSiddurHighlighted(
						"[כהן]: אִם־כֶּ֣סֶף ׀ תַּלְוֶ֣ה אֶת־עַמִּ֗י אֶת־הֶֽעָנִי֙ עִמָּ֔ךְ לֹא־תִהְיֶ֥ה ל֖וֹ כְּנֹשֶׁ֑ה לֹֽא־תְשִׂימ֥וּן עָלָ֖יו נֶֽשֶׁךְ׃ \n" +
						"אִם־חָבֹ֥ל תַּחְבֹּ֖ל שַׂלְמַ֣ת רֵעֶ֑ךָ עַד־בֹּ֥א הַשֶּׁ֖מֶשׁ תְּשִׁיבֶ֥נּוּ לֽוֹ׃ \n"	+
						"כִּ֣י הִ֤וא כְסוּתֹה֙ לְבַדָּ֔הּ הִ֥וא שִׂמְלָת֖וֹ לְעֹר֑וֹ בַּמֶּ֣ה יִשְׁכָּ֔ב וְהָיָה֙ כִּֽי־יִצְעַ֣ק אֵלַ֔י וְשָׁמַעְתִּ֖י כִּֽי־חַנּ֥וּן אָֽנִי׃ \n" +
						"אֱלֹהִ֖ים לֹ֣א תְקַלֵּ֑ל וְנָשִׂ֥יא בְעַמְּךָ֖ לֹ֥א תָאֹֽר׃ \n" +
						"מְלֵאָתְךָ֥ וְדִמְעֲךָ֖ לֹ֣א תְאַחֵ֑ר בְּכ֥וֹר בָּנֶ֖יךָ תִּתֶּן־לִֽי׃ \n" +
						"כֵּֽן־תַּעֲשֶׂ֥ה לְשֹׁרְךָ֖ לְצֹאנֶ֑ךָ שִׁבְעַ֤ת יָמִים֙ יִהְיֶ֣ה עִם־אִמּ֔וֹ בַּיּ֥וֹם הַשְּׁמִינִ֖י תִּתְּנוֹ־לִֽי׃ \n" +
						"וְאַנְשֵׁי־קֹ֖דֶשׁ תִּהְי֣וּן לִ֑י וּבָשָׂ֨ר בַּשָּׂדֶ֤ה טְרֵפָה֙ לֹ֣א תֹאכֵ֔לוּ לַכֶּ֖לֶב תַּשְׁלִכ֥וּן אֹתֽוֹ׃ \n" +
						"לֹ֥א תִשָּׂ֖א שֵׁ֣מַע שָׁ֑וְא אַל־תָּ֤שֶׁת יָֽדְךָ֙ עִם־רָשָׁ֔ע לִהְיֹ֖ת עֵ֥ד חָמָֽס׃ \n" +
						"לֹֽא־תִהְיֶ֥ה אַחֲרֵֽי־רַבִּ֖ים לְרָעֹ֑ת וְלֹא־תַעֲנֶ֣ה עַל־רִ֗ב לִנְטֹ֛ת אַחֲרֵ֥י רַבִּ֖ים לְהַטֹּֽת׃ \n" +
						"וְדָ֕ל לֹ֥א תֶהְדַּ֖ר בְּרִיבֽוֹ׃ \n" +
						"כִּ֣י תִפְגַּ֞ע שׁ֧וֹר אֹֽיִבְךָ֛ א֥וֹ חֲמֹר֖וֹ תֹּעֶ֑ה הָשֵׁ֥ב תְּשִׁיבֶ֖נּוּ לֽוֹ׃ \n" +
						"כִּֽי־תִרְאֶ֞ה חֲמ֣וֹר שֹׂנַאֲךָ֗ רֹבֵץ֙ תַּ֣חַת מַשָּׂא֔וֹ וְחָדַלְתָּ֖ מֵעֲזֹ֣ב ל֑וֹ עָזֹ֥ב תַּעֲזֹ֖ב עִמּֽוֹ׃\n\n" +
						"[לוי]: לֹ֥א תַטֶּ֛ה מִשְׁפַּ֥ט אֶבְיֹנְךָ֖ בְּרִיבֽוֹ׃ \n" +
						"מִדְּבַר־שֶׁ֖קֶר תִּרְחָ֑ק וְנָקִ֤י וְצַדִּיק֙ אַֽל־תַּהֲרֹ֔ג כִּ֥י לֹא־אַצְדִּ֖יק רָשָֽׁע׃ \n" +
						"וְשֹׁ֖חַד לֹ֣א תִקָּ֑ח כִּ֤י הַשֹּׁ֙חַד֙ יְעַוֵּ֣ר פִּקְחִ֔ים וִֽיסַלֵּ֖ף דִּבְרֵ֥י צַדִּיקִֽים׃ \n" +
						"וְגֵ֖ר לֹ֣א תִלְחָ֑ץ וְאַתֶּ֗ם יְדַעְתֶּם֙ אֶת־נֶ֣פֶשׁ הַגֵּ֔ר כִּֽי־גֵרִ֥ים הֱיִיתֶ֖ם בְּאֶ֥רֶץ מִצְרָֽיִם׃ \n" +
						"וְשֵׁ֥שׁ שָׁנִ֖ים תִּזְרַ֣ע אֶת־אַרְצֶ֑ךָ וְאָסַפְתָּ֖ אֶת־תְּבוּאָתָֽהּ׃ \n" +
						"וְהַשְּׁבִיעִ֞ת תִּשְׁמְטֶ֣נָּה וּנְטַשְׁתָּ֗הּ וְאָֽכְלוּ֙ אֶבְיֹנֵ֣י עַמֶּ֔ךָ וְיִתְרָ֕ם תֹּאכַ֖ל חַיַּ֣ת הַשָּׂדֶ֑ה כֵּֽן־תַּעֲשֶׂ֥ה לְכַרְמְךָ֖ לְזֵיתֶֽךָ׃ \n" +
						"שֵׁ֤שֶׁת יָמִים֙ תַּעֲשֶׂ֣ה מַעֲשֶׂ֔יךָ וּבַיּ֥וֹם הַשְּׁבִיעִ֖י תִּשְׁבֹּ֑ת לְמַ֣עַן יָנ֗וּחַ שֽׁוֹרְךָ֙ וַחֲמֹרֶ֔ךָ וְיִנָּפֵ֥שׁ בֶּן־אֲמָתְךָ֖ וְהַגֵּֽר׃ \n" +
						"וּבְכֹ֛ל אֲשֶׁר־אָמַ֥רְתִּי אֲלֵיכֶ֖ם תִּשָּׁמֵ֑רוּ וְשֵׁ֨ם אֱלֹהִ֤ים אֲחֵרִים֙ לֹ֣א תַזְכִּ֔ירוּ לֹ֥א יִשָּׁמַ֖ע עַל־פִּֽיךָ׃ \n" +
						"שָׁלֹ֣שׁ רְגָלִ֔ים תָּחֹ֥ג לִ֖י בַּשָּׁנָֽה׃\n\n" +
						"[שלישי]: אֶת־חַ֣ג הַמַּצּוֹת֮ תִּשְׁמֹר֒ שִׁבְעַ֣ת יָמִים֩ תֹּאכַ֨ל מַצּ֜וֹת כַּֽאֲשֶׁ֣ר צִוִּיתִ֗ךָ לְמוֹעֵד֙ חֹ֣דֶשׁ הָֽאָבִ֔יב כִּי־ב֖וֹ יָצָ֣אתָ מִמִּצְרָ֑יִם וְלֹא־יֵרָא֥וּ פָנַ֖י רֵיקָֽם׃ \n" +
						"וְחַ֤ג הַקָּצִיר֙ בִּכּוּרֵ֣י מַעֲשֶׂ֔יךָ אֲשֶׁ֥ר תִּזְרַ֖ע בַּשָּׂדֶ֑ה וְחַ֤ג הָֽאָסִף֙ בְּצֵ֣את הַשָּׁנָ֔ה בְּאׇסְפְּךָ֥ אֶֽת־מַעֲשֶׂ֖יךָ מִן־הַשָּׂדֶֽה׃ \n" +
						"שָׁלֹ֥שׁ פְּעָמִ֖ים בַּשָּׁנָ֑ה יֵרָאֶה֙ כׇּל־זְכ֣וּרְךָ֔ אֶל־פְּנֵ֖י הָאָדֹ֥ן ׀ יְהֹוָֽה׃ \n" +
						"לֹֽא־תִזְבַּ֥ח עַל־חָמֵ֖ץ דַּם־זִבְחִ֑י וְלֹֽא־יָלִ֥ין חֵֽלֶב־חַגִּ֖י עַד־בֹּֽקֶר׃ \n"	+
						"רֵאשִׁ֗ית בִּכּוּרֵי֙ אַדְמָ֣תְךָ֔ תָּבִ֕יא בֵּ֖ית יְהֹוָ֣ה אֱלֹהֶ֑יךָ לֹֽא־תְבַשֵּׁ֥ל גְּדִ֖י בַּחֲלֵ֥ב אִמּֽוֹ׃");
				} else if (jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 19) {// 5th day
					addToSiddurHighlighted(
						"[כהן]: " +
						WeeklyParashaReadings.vayavorParagraph[0] +
						WeeklyParashaReadings.vayavorParagraph[1] + "\n\n" +
						"[לוי]: שְׁמׇ֨ר־לְךָ֔ אֵ֛ת אֲשֶׁ֥ר אָנֹכִ֖י מְצַוְּךָ֣ הַיּ֑וֹם הִנְנִ֧י גֹרֵ֣שׁ מִפָּנֶ֗יךָ אֶת־הָאֱמֹרִי֙ וְהַֽכְּנַעֲנִ֔י וְהַחִתִּי֙ וְהַפְּרִזִּ֔י וְהַחִוִּ֖י וְהַיְבוּסִֽי׃ \n" +
						"הִשָּׁ֣מֶר לְךָ֗ פֶּן־תִּכְרֹ֤ת בְּרִית֙ לְיוֹשֵׁ֣ב הָאָ֔רֶץ אֲשֶׁ֥ר אַתָּ֖ה בָּ֣א עָלֶ֑יהָ פֶּן־יִהְיֶ֥ה לְמוֹקֵ֖שׁ בְּקִרְבֶּֽךָ׃ \n" +
						"כִּ֤י אֶת־מִזְבְּחֹתָם֙ תִּתֹּצ֔וּן וְאֶת־מַצֵּבֹתָ֖ם תְּשַׁבֵּר֑וּן וְאֶת־אֲשֵׁרָ֖יו תִּכְרֹתֽוּן׃ \n" +
						"כִּ֛י לֹ֥א תִֽשְׁתַּחֲוֶ֖ה לְאֵ֣ל אַחֵ֑ר כִּ֤י יְהֹוָה֙ קַנָּ֣א שְׁמ֔וֹ אֵ֥ל קַנָּ֖א הֽוּא׃ \n" +
						"פֶּן־תִּכְרֹ֥ת בְּרִ֖ית לְיוֹשֵׁ֣ב הָאָ֑רֶץ וְזָנ֣וּ ׀ אַחֲרֵ֣י אֱלֹֽהֵיהֶ֗ם וְזָבְחוּ֙ לֵאלֹ֣הֵיהֶ֔ם וְקָרָ֣א לְךָ֔ וְאָכַלְתָּ֖ מִזִּבְחֽוֹ׃ \n" +
						"וְלָקַחְתָּ֥ מִבְּנֹתָ֖יו לְבָנֶ֑יךָ וְזָנ֣וּ בְנֹתָ֗יו אַחֲרֵי֙ אֱלֹ֣הֵיהֶ֔ן וְהִזְנוּ֙ אֶת־בָּנֶ֔יךָ אַחֲרֵ֖י אֱלֹהֵיהֶֽן׃ \n" +
						"אֱלֹהֵ֥י מַסֵּכָ֖ה לֹ֥א תַעֲשֶׂה־לָּֽךְ׃ \n" +
						"אֶת־חַ֣ג הַמַּצּוֹת֮ תִּשְׁמֹר֒ שִׁבְעַ֨ת יָמִ֜ים תֹּאכַ֤ל מַצּוֹת֙ אֲשֶׁ֣ר צִוִּיתִ֔ךָ לְמוֹעֵ֖ד חֹ֣דֶשׁ הָאָבִ֑יב כִּ֚י בְּחֹ֣דֶשׁ הָֽאָבִ֔יב יָצָ֖אתָ מִמִּצְרָֽיִם׃ \n" +
						"כׇּל־פֶּ֥טֶר רֶ֖חֶם לִ֑י וְכׇֽל־מִקְנְךָ֙ תִּזָּכָ֔ר פֶּ֖טֶר שׁ֥וֹר וָשֶֽׂה׃ \n" +
						"וּפֶ֤טֶר חֲמוֹר֙ תִּפְדֶּ֣ה בְשֶׂ֔ה וְאִם־לֹ֥א תִפְדֶּ֖ה וַעֲרַפְתּ֑וֹ כֹּ֣ל בְּכ֤וֹר בָּנֶ֙יךָ֙ תִּפְדֶּ֔ה וְלֹֽא־יֵרָא֥וּ פָנַ֖י רֵיקָֽם׃\n\n" +
						"[שלישי]: שֵׁ֤שֶׁת יָמִים֙ תַּעֲבֹ֔ד וּבַיּ֥וֹם הַשְּׁבִיעִ֖י תִּשְׁבֹּ֑ת בֶּחָרִ֥ישׁ וּבַקָּצִ֖יר תִּשְׁבֹּֽת׃ \n" +
						"וְחַ֤ג שָׁבֻעֹת֙ תַּעֲשֶׂ֣ה לְךָ֔ בִּכּוּרֵ֖י קְצִ֣יר חִטִּ֑ים וְחַג֙ הָֽאָסִ֔יף תְּקוּפַ֖ת הַשָּׁנָֽה׃ \n" +
						"שָׁלֹ֥שׁ פְּעָמִ֖ים בַּשָּׁנָ֑ה יֵרָאֶה֙ כׇּל־זְכ֣וּרְךָ֔ אֶת־פְּנֵ֛י הָֽאָדֹ֥ן ׀ יְהֹוָ֖ה אֱלֹהֵ֥י יִשְׂרָאֵֽל׃ \n" +
						"כִּֽי־אוֹרִ֤ישׁ גּוֹיִם֙ מִפָּנֶ֔יךָ וְהִרְחַבְתִּ֖י אֶת־גְּבֻלֶ֑ךָ וְלֹא־יַחְמֹ֥ד אִישׁ֙ אֶֽת־אַרְצְךָ֔ בַּעֲלֹֽתְךָ֗ לֵרָאוֹת֙ אֶת־פְּנֵי֙ יְהֹוָ֣ה אֱלֹהֶ֔יךָ שָׁלֹ֥שׁ פְּעָמִ֖ים בַּשָּׁנָֽה׃ \n" +
						"לֹֽא־תִשְׁחַ֥ט עַל־חָמֵ֖ץ דַּם־זִבְחִ֑י וְלֹא־יָלִ֣ין לַבֹּ֔קֶר זֶ֖בַח חַ֥ג הַפָּֽסַח׃ \n" +
						"רֵאשִׁ֗ית בִּכּוּרֵי֙ אַדְמָ֣תְךָ֔ תָּבִ֕יא בֵּ֖ית יְהֹוָ֣ה אֱלֹהֶ֑יךָ לֹא־תְבַשֵּׁ֥ל גְּדִ֖י בַּחֲלֵ֥ב אִמּֽוֹ׃");
				} else if (jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 20) {// 6th day. 7th day is
																							// already chag
					addToSiddurHighlighted(
						"[כהן]: וַיְדַבֵּ֣ר יְהֹוָ֣ה אֶל־מֹשֶׁ֣ה בְמִדְבַּר־סִ֠ינַ֠י בַּשָּׁנָ֨ה הַשֵּׁנִ֜ית לְצֵאתָ֨ם מֵאֶ֧רֶץ מִצְרַ֛יִם בַּחֹ֥דֶשׁ הָרִאשׁ֖וֹן לֵאמֹֽר׃ \n" +
						"וְיַעֲשׂ֧וּ בְנֵי־יִשְׂרָאֵ֛ל אֶת־הַפָּ֖סַח בְּמוֹעֲדֽוֹ׃ \n" +
						"בְּאַרְבָּעָ֣ה עָשָֽׂר־י֠וֹם בַּחֹ֨דֶשׁ הַזֶּ֜ה בֵּ֧ין הָֽעַרְבַּ֛יִם תַּעֲשׂ֥וּ אֹת֖וֹ בְּמֹעֲד֑וֹ כְּכׇל־חֻקֹּתָ֥יו וּכְכׇל־מִשְׁפָּטָ֖יו תַּעֲשׂ֥וּ אֹתֽוֹ׃ \n" +
						"וַיְדַבֵּ֥ר מֹשֶׁ֛ה אֶל־בְּנֵ֥י יִשְׂרָאֵ֖ל לַעֲשֹׂ֥ת הַפָּֽסַח׃\n\n" +
						"[לוי]: וַיַּעֲשׂ֣וּ אֶת־הַפֶּ֡סַח בָּרִאשׁ֡וֹן בְּאַרְבָּעָה֩ עָשָׂ֨ר י֥וֹם לַחֹ֛דֶשׁ בֵּ֥ין הָעַרְבַּ֖יִם בְּמִדְבַּ֣ר סִינָ֑י כְּ֠כֹ֠ל אֲשֶׁ֨ר צִוָּ֤ה יְהֹוָה֙ אֶת־מֹשֶׁ֔ה כֵּ֥ן עָשׂ֖וּ בְּנֵ֥י יִשְׂרָאֵֽל׃ \n" +
						"וַיְהִ֣י אֲנָשִׁ֗ים אֲשֶׁ֨ר הָי֤וּ טְמֵאִים֙ לְנֶ֣פֶשׁ אָדָ֔ם וְלֹא־יָכְל֥וּ לַעֲשֹׂת־הַפֶּ֖סַח בַּיּ֣וֹם הַה֑וּא וַֽיִּקְרְב֞וּ לִפְנֵ֥י מֹשֶׁ֛ה וְלִפְנֵ֥י אַהֲרֹ֖ן בַּיּ֥וֹם הַהֽוּא׃ \n" +
						"וַ֠יֹּאמְר֠וּ הָאֲנָשִׁ֤ים הָהֵ֙מָּה֙ אֵלָ֔יו אֲנַ֥חְנוּ טְמֵאִ֖ים לְנֶ֣פֶשׁ אָדָ֑ם לָ֣מָּה נִגָּרַ֗ע לְבִלְתִּ֨י הַקְרִ֜יב אֶת־קׇרְבַּ֤ן יְהֹוָה֙ בְּמֹ֣עֲד֔וֹ בְּת֖וֹךְ בְּנֵ֥י יִשְׂרָאֵֽל׃ \n" +
						"וַיֹּ֥אמֶר אֲלֵהֶ֖ם מֹשֶׁ֑ה עִמְד֣וּ וְאֶשְׁמְעָ֔ה מַה־יְצַוֶּ֥ה יְהֹוָ֖ה לָכֶֽם׃\n\n" +
						"[שלישי]: וַיְדַבֵּ֥ר יְהֹוָ֖ה אֶל־מֹשֶׁ֥ה לֵּאמֹֽר׃ \n" +
						"דַּבֵּ֛ר אֶל־בְּנֵ֥י יִשְׂרָאֵ֖ל לֵאמֹ֑ר אִ֣ישׁ אִ֣ישׁ כִּי־יִהְיֶֽה־טָמֵ֣א ׀ לָנֶ֡פֶשׁ אוֹ֩ בְדֶ֨רֶךְ רְחֹקָ֜הׄ לָכֶ֗ם א֚וֹ לְדֹרֹ֣תֵיכֶ֔ם וְעָ֥שָׂה פֶ֖סַח לַיהֹוָֽה׃ \n" +
						"בַּחֹ֨דֶשׁ הַשֵּׁנִ֜י בְּאַרְבָּעָ֨ה עָשָׂ֥ר י֛וֹם בֵּ֥ין הָעַרְבַּ֖יִם יַעֲשׂ֣וּ אֹת֑וֹ עַל־מַצּ֥וֹת וּמְרֹרִ֖ים יֹאכְלֻֽהוּ׃ \n" +
						"לֹֽא־יַשְׁאִ֤ירוּ מִמֶּ֙נּוּ֙ עַד־בֹּ֔קֶר וְעֶ֖צֶם לֹ֣א יִשְׁבְּרוּ־ב֑וֹ כְּכׇל־חֻקַּ֥ת הַפֶּ֖סַח יַעֲשׂ֥וּ אֹתֽוֹ׃ \n" +
						"וְהָאִישׁ֩ אֲשֶׁר־ה֨וּא טָה֜וֹר וּבְדֶ֣רֶךְ לֹא־הָיָ֗ה וְחָדַל֙ לַעֲשׂ֣וֹת הַפֶּ֔סַח וְנִכְרְתָ֛ה הַנֶּ֥פֶשׁ הַהִ֖וא מֵֽעַמֶּ֑יהָ כִּ֣י ׀ קׇרְבַּ֣ן יְהֹוָ֗ה לֹ֤א הִקְרִיב֙ בְּמֹ֣עֲד֔וֹ חֶטְא֥וֹ יִשָּׂ֖א הָאִ֥ישׁ הַהֽוּא׃ \n" +
						"וְכִֽי־יָג֨וּר אִתְּכֶ֜ם גֵּ֗ר וְעָ֤שָֽׂה פֶ֙סַח֙ לַֽיהֹוָ֔ה כְּחֻקַּ֥ת הַפֶּ֛סַח וּכְמִשְׁפָּט֖וֹ כֵּ֣ן יַעֲשֶׂ֑ה חֻקָּ֤ה אַחַת֙ יִהְיֶ֣ה לָכֶ֔ם וְלַגֵּ֖ר וּלְאֶזְרַ֥ח הָאָֽרֶץ׃");
				}
				addToSiddurHighlighted("אין אומרים קדיש לפי שעדיין לא נשלמו מנין העולים/We do not say Kaddish until the fourth person finishes");
				addToSiddurHighlighted("והרביעי קורא בספר שני בפרשת פנחס/The fourth person reads from the second Sefer Torah in Parashat Pinchas");
				addToSiddurHighlighted(
					"וְהִקְרַבְתֶּ֨ם אִשֶּׁ֤ה עֹלָה֙ לַֽיהֹוָ֔ה פָּרִ֧ים בְּנֵי־בָקָ֛ר שְׁנַ֖יִם וְאַ֣יִל אֶחָ֑ד וְשִׁבְעָ֤ה כְבָשִׂים֙ בְּנֵ֣י שָׁנָ֔ה תְּמִימִ֖ם יִהְי֥וּ לָכֶֽם׃ \n" +
					"וּמִ֨נְחָתָ֔ם סֹ֖לֶת בְּלוּלָ֣ה בַשָּׁ֑מֶן שְׁלֹשָׁ֨ה עֶשְׂרֹנִ֜ים לַפָּ֗ר וּשְׁנֵ֧י עֶשְׂרֹנִ֛ים לָאַ֖יִל תַּעֲשֽׂוּ׃ \n" +
					"עִשָּׂר֤וֹן עִשָּׂרוֹן֙ תַּעֲשֶׂ֔ה לַכֶּ֖בֶשׂ הָאֶחָ֑ד לְשִׁבְעַ֖ת הַכְּבָשִֽׂים׃ \n" +
					"וּשְׂעִ֥יר חַטָּ֖את אֶחָ֑ד לְכַפֵּ֖ר עֲלֵיכֶֽם׃ \n" +
					"מִלְּבַד֙ עֹלַ֣ת הַבֹּ֔קֶר אֲשֶׁ֖ר לְעֹלַ֣ת הַתָּמִ֑יד תַּעֲשׂ֖וּ אֶת־אֵֽלֶּה׃ \n" +
					"כָּאֵ֜לֶּה תַּעֲשׂ֤וּ לַיּוֹם֙ שִׁבְעַ֣ת יָמִ֔ים לֶ֛חֶם אִשֵּׁ֥ה רֵֽיחַ־נִיחֹ֖חַ לַיהֹוָ֑ה עַל־עוֹלַ֧ת הַתָּמִ֛יד יֵעָשֶׂ֖ה וְנִסְכּֽוֹ׃ \n" +
					"וּבַיּוֹם֙ הַשְּׁבִיעִ֔י מִקְרָא־קֹ֖דֶשׁ יִהְיֶ֣ה לָכֶ֑ם כׇּל־מְלֶ֥אכֶת עֲבֹדָ֖ה לֹ֥א תַעֲשֽׂוּ׃");
			} else if (jewishDateInfo.getJewishCalendar().isCholHamoedSuccos()) {
				addToSiddurHighlighted("וקוראים ד' עולים בספר תורה (Four people go up for Aliya)");
				String second = "וּבַיּ֣וֹם הַשֵּׁנִ֗י פָּרִ֧ים בְּנֵי־בָקָ֛ר שְׁנֵ֥ים עָשָׂ֖ר אֵילִ֣ם שְׁנָ֑יִם כְּבָשִׂ֧ים בְּנֵי־שָׁנָ֛ה אַרְבָּעָ֥ה עָשָׂ֖ר תְּמִימִֽם׃ וּמִנְחָתָ֣ם וְנִסְכֵּיהֶ֡ם לַ֠פָּרִ֠ים לָאֵילִ֧ם וְלַכְּבָשִׂ֛ים בְּמִסְפָּרָ֖ם כַּמִּשְׁפָּֽט׃ וּשְׂעִיר־עִזִּ֥ים אֶחָ֖ד חַטָּ֑את מִלְּבַד֙ עֹלַ֣ת הַתָּמִ֔יד וּמִנְחָתָ֖הּ וְנִסְכֵּיהֶֽם׃";
				String third = "וּבַיּ֧וֹם הַשְּׁלִישִׁ֛י פָּרִ֥ים עַשְׁתֵּי־עָשָׂ֖ר אֵילִ֣ם שְׁנָ֑יִם כְּבָשִׂ֧ים בְּנֵי־שָׁנָ֛ה אַרְבָּעָ֥ה עָשָׂ֖ר תְּמִימִֽם׃ וּמִנְחָתָ֣ם וְנִסְכֵּיהֶ֡ם לַ֠פָּרִ֠ים לָאֵילִ֧ם וְלַכְּבָשִׂ֛ים בְּמִסְפָּרָ֖ם כַּמִּשְׁפָּֽט׃ וּשְׂעִ֥יר חַטָּ֖את אֶחָ֑ד מִלְּבַד֙ עֹלַ֣ת הַתָּמִ֔יד וּמִנְחָתָ֖הּ וְנִסְכָּֽהּ׃";
				String fourth = "וּבַיּ֧וֹם הָרְבִיעִ֛י פָּרִ֥ים עֲשָׂרָ֖ה אֵילִ֣ם שְׁנָ֑יִם כְּבָשִׂ֧ים בְּנֵֽי־שָׁנָ֛ה אַרְבָּעָ֥ה עָשָׂ֖ר תְּמִימִֽם׃ מִנְחָתָ֣ם וְנִסְכֵּיהֶ֡ם לַ֠פָּרִ֠ים לָאֵילִ֧ם וְלַכְּבָשִׂ֛ים בְּמִסְפָּרָ֖ם כַּמִּשְׁפָּֽט׃ וּשְׂעִיר־עִזִּ֥ים אֶחָ֖ד חַטָּ֑את מִלְּבַד֙ עֹלַ֣ת הַתָּמִ֔יד מִנְחָתָ֖הּ וְנִסְכָּֽהּ׃";
				String fifth = "וּבַיּ֧וֹם הַחֲמִישִׁ֛י פָּרִ֥ים תִּשְׁעָ֖ה אֵילִ֣ם שְׁנָ֑יִם כְּבָשִׂ֧ים בְּנֵֽי־שָׁנָ֛ה אַרְבָּעָ֥ה עָשָׂ֖ר תְּמִימִֽם׃ וּמִנְחָתָ֣ם וְנִסְכֵּיהֶ֡ם לַ֠פָּרִ֠ים לָאֵילִ֧ם וְלַכְּבָשִׂ֛ים בְּמִסְפָּרָ֖ם כַּמִּשְׁפָּֽט׃ וּשְׂעִ֥יר חַטָּ֖את אֶחָ֑ד מִלְּבַד֙ עֹלַ֣ת הַתָּמִ֔יד וּמִנְחָתָ֖הּ וְנִסְכָּֽהּ׃";
				String sixth = "וּבַיּ֧וֹם הַשִּׁשִּׁ֛י פָּרִ֥ים שְׁמֹנָ֖ה אֵילִ֣ם שְׁנָ֑יִם כְּבָשִׂ֧ים בְּנֵי־שָׁנָ֛ה אַרְבָּעָ֥ה עָשָׂ֖ר תְּמִימִֽם׃ וּמִנְחָתָ֣ם וְנִסְכֵּיהֶ֡ם לַ֠פָּרִ֠ים לָאֵילִ֧ם וְלַכְּבָשִׂ֛ים בְּמִסְפָּרָ֖ם כַּמִּשְׁפָּֽט׃ וּשְׂעִ֥יר חַטָּ֖את אֶחָ֑ד מִלְּבַד֙ עֹלַ֣ת הַתָּמִ֔יד מִנְחָתָ֖הּ וּנְסָכֶֽיהָ׃";
				String seventh = "וּבַיּ֧וֹם הַשְּׁבִיעִ֛י פָּרִ֥ים שִׁבְעָ֖ה אֵילִ֣ם שְׁנָ֑יִם כְּבָשִׂ֧ים בְּנֵי־שָׁנָ֛ה אַרְבָּעָ֥ה עָשָׂ֖ר תְּמִימִֽם׃ וּמִנְחָתָ֣ם וְנִסְכֵּהֶ֡ם לַ֠פָּרִ֠ים לָאֵילִ֧ם וְלַכְּבָשִׂ֛ים בְּמִסְפָּרָ֖ם כְּמִשְׁפָּטָֽם׃ וּשְׂעִ֥יר חַטָּ֖את אֶחָ֑ד מִלְּבַד֙ עֹלַ֣ת הַתָּמִ֔יד מִנְחָתָ֖הּ וְנִסְכָּֽהּ׃";

				if (jewishDateInfo.getJewishCalendar().getInIsrael()) {
					addToSiddurHighlighted("כל ד' העולים קוראים/(All four people read):");
					switch (jewishDateInfo.getJewishCalendar().getJewishDayOfMonth()) {
						case 16: // 2nd day
							addToSiddurHighlighted(second);
							break;
						case 17: // 3rd day
							addToSiddurHighlighted(third);
							break;
						case 18: // 4th day
							addToSiddurHighlighted(fourth);
							break;
						case 19: // 5th day
							addToSiddurHighlighted(fifth);
							break;
						case 20: // 6th day
							addToSiddurHighlighted(sixth);
							break;
						case 21: // 7th day
							addToSiddurHighlighted(seventh);
							break;
					}
				} else { // not in Israel

					String[] aliyot = {
						"[כהן]: ",
						"[לוי]: ",
						"[שלישי]: ",
						"[רביעי]: "
					};

					switch (jewishDateInfo.getJewishCalendar().getJewishDayOfMonth()) {
						case 17: // 3rd day
							addToSiddurHighlighted(aliyot[0] + second);
							addToSiddurHighlighted(aliyot[1] + third);
							addToSiddurHighlighted(aliyot[2] + third);
							addToSiddurHighlighted(aliyot[3] + second + " " + third);
							break;
						case 18: // 4th day
							addToSiddurHighlighted(aliyot[0] + third);
							addToSiddurHighlighted(aliyot[1] + fourth);
							addToSiddurHighlighted(aliyot[2] + fourth);
							addToSiddurHighlighted(aliyot[3] + third + " " + fourth);
							break;
						case 19: // 5th day
							addToSiddurHighlighted(aliyot[0] + fourth);
							addToSiddurHighlighted(aliyot[1] + fifth);
							addToSiddurHighlighted(aliyot[2] + fifth);
							addToSiddurHighlighted(aliyot[3] + fourth + " " + fifth);
							break;
						case 20: // 6th day
							addToSiddurHighlighted(aliyot[0] + fifth);
							addToSiddurHighlighted(aliyot[1] + sixth);
							addToSiddurHighlighted(aliyot[2] + sixth);
							addToSiddurHighlighted(aliyot[3] + fifth + " " + sixth);
							break;
						case 21: // 7th day
							addToSiddurHighlighted(aliyot[0] + sixth);
							addToSiddurHighlighted(aliyot[1] + seventh);
							addToSiddurHighlighted(aliyot[2] + seventh);
							addToSiddurHighlighted(aliyot[3] + sixth + " " + seventh);
							break;
					}
				}
			} else if (jewishDateInfo.getJewishCalendar().isTishaBav()) {
				addToSiddurHighlighted(
					"[כהן]: כִּֽי־תוֹלִ֤יד בָּנִים֙ וּבְנֵ֣י בָנִ֔ים וְנוֹשַׁנְתֶּ֖ם בָּאָ֑רֶץ וְהִשְׁחַתֶּ֗ם וַעֲשִׂ֤יתֶם פֶּ֙סֶל֙ תְּמ֣וּנַת כֹּ֔ל וַעֲשִׂיתֶ֥ם הָרַ֛ע בְּעֵינֵ֥י יְהֹוָה־אֱלֹהֶ֖יךָ לְהַכְעִיסֽוֹ׃ \n" +
					"הַעִידֹ֩תִי֩ בָכֶ֨ם הַיּ֜וֹם אֶת־הַשָּׁמַ֣יִם וְאֶת־הָאָ֗רֶץ כִּֽי־אָבֹ֣ד תֹּאבֵדוּן֮ מַהֵר֒ מֵעַ֣ל הָאָ֔רֶץ אֲשֶׁ֨ר אַתֶּ֜ם עֹבְרִ֧ים אֶת־הַיַּרְדֵּ֛ן שָׁ֖מָּה לְרִשְׁתָּ֑הּ לֹֽא־תַאֲרִיכֻ֤ן יָמִים֙ עָלֶ֔יהָ כִּ֥י הִשָּׁמֵ֖ד תִּשָּׁמֵדֽוּן׃ \n" +
					"וְהֵפִ֧יץ יְהֹוָ֛ה אֶתְכֶ֖ם בָּעַמִּ֑ים וְנִשְׁאַרְתֶּם֙ מְתֵ֣י מִסְפָּ֔ר בַּגּוֹיִ֕ם אֲשֶׁ֨ר יְנַהֵ֧ג יְהֹוָ֛ה אֶתְכֶ֖ם שָֽׁמָּה׃ \n" +
					"וַעֲבַדְתֶּם־שָׁ֣ם אֱלֹהִ֔ים מַעֲשֵׂ֖ה יְדֵ֣י אָדָ֑ם עֵ֣ץ וָאֶ֔בֶן אֲשֶׁ֤ר לֹֽא־יִרְאוּן֙ וְלֹ֣א יִשְׁמְע֔וּן וְלֹ֥א יֹֽאכְל֖וּן וְלֹ֥א יְרִיחֻֽן׃ \n" +
					"וּבִקַּשְׁתֶּ֥ם מִשָּׁ֛ם אֶת־יְהֹוָ֥ה אֱלֹהֶ֖יךָ וּמָצָ֑אתָ כִּ֣י תִדְרְשֶׁ֔נּוּ בְּכׇל־לְבָבְךָ֖ וּבְכׇל־נַפְשֶֽׁךָ׃ \n" +
					"[לוי]: בַּצַּ֣ר לְךָ֔ וּמְצָא֕וּךָ כֹּ֖ל הַדְּבָרִ֣ים הָאֵ֑לֶּה בְּאַחֲרִית֙ הַיָּמִ֔ים וְשַׁבְתָּ֙ עַד־יְהֹוָ֣ה אֱלֹהֶ֔יךָ וְשָׁמַעְתָּ֖ בְּקֹלֽוֹ׃ \n" +
					"כִּ֣י אֵ֤ל רַחוּם֙ יְהֹוָ֣ה אֱלֹהֶ֔יךָ לֹ֥א יַרְפְּךָ֖ וְלֹ֣א יַשְׁחִיתֶ֑ךָ וְלֹ֤א יִשְׁכַּח֙ אֶת־בְּרִ֣ית אֲבֹתֶ֔יךָ אֲשֶׁ֥ר נִשְׁבַּ֖ע לָהֶֽם׃ \n" +
					"כִּ֣י שְׁאַל־נָא֩ לְיָמִ֨ים רִֽאשֹׁנִ֜ים אֲשֶׁר־הָי֣וּ לְפָנֶ֗יךָ לְמִן־הַיּוֹם֙ אֲשֶׁר֩ בָּרָ֨א אֱלֹהִ֤ים ׀ אָדָם֙ עַל־הָאָ֔רֶץ וּלְמִקְצֵ֥ה הַשָּׁמַ֖יִם וְעַד־קְצֵ֣ה הַשָּׁמָ֑יִם הֲנִֽהְיָ֗ה כַּדָּבָ֤ר הַגָּדוֹל֙ הַזֶּ֔ה א֖וֹ הֲנִשְׁמַ֥ע כָּמֹֽהוּ׃ \n" +
					"הֲשָׁ֣מַֽע עָם֩ ק֨וֹל אֱלֹהִ֜ים מְדַבֵּ֧ר מִתּוֹךְ־הָאֵ֛שׁ כַּאֲשֶׁר־שָׁמַ֥עְתָּ אַתָּ֖ה וַיֶּֽחִי׃ \n" +
					"א֣וֹ ׀ הֲנִסָּ֣ה אֱלֹהִ֗ים לָ֠ב֠וֹא לָקַ֨חַת ל֣וֹ גוֹי֮ מִקֶּ֣רֶב גּוֹי֒ בְּמַסֹּת֩ בְּאֹתֹ֨ת וּבְמוֹפְתִ֜ים וּבְמִלְחָמָ֗ה וּבְיָ֤ד חֲזָקָה֙ וּבִזְר֣וֹעַ נְטוּיָ֔ה וּבְמוֹרָאִ֖ים גְּדֹלִ֑ים כְּ֠כֹ֠ל אֲשֶׁר־עָשָׂ֨ה לָכֶ֜ם יְהֹוָ֧ה אֱלֹהֵיכֶ֛ם בְּמִצְרַ֖יִם לְעֵינֶֽיךָ׃ \n" +
					"[ישראל]: אַתָּה֙ הׇרְאֵ֣תָ לָדַ֔עַת כִּ֥י יְהֹוָ֖ה ה֣וּא הָאֱלֹהִ֑ים אֵ֥ין ע֖וֹד מִלְּבַדּֽוֹ׃ \n" +
					"מִן־הַשָּׁמַ֛יִם הִשְׁמִֽיעֲךָ֥ אֶת־קֹל֖וֹ לְיַסְּרֶ֑ךָּ וְעַל־הָאָ֗רֶץ הֶרְאֲךָ֙ אֶת־אִשּׁ֣וֹ הַגְּדוֹלָ֔ה וּדְבָרָ֥יו שָׁמַ֖עְתָּ מִתּ֥וֹךְ הָאֵֽשׁ׃ \n" +
					"וְתַ֗חַת כִּ֤י אָהַב֙ אֶת־אֲבֹתֶ֔יךָ וַיִּבְחַ֥ר בְּזַרְע֖וֹ אַחֲרָ֑יו וַיּוֹצִֽאֲךָ֧ בְּפָנָ֛יו בְּכֹח֥וֹ הַגָּדֹ֖ל מִמִּצְרָֽיִם׃ \n" +
					"לְהוֹרִ֗ישׁ גּוֹיִ֛ם גְּדֹלִ֧ים וַעֲצֻמִ֛ים מִמְּךָ֖ מִפָּנֶ֑יךָ לַהֲבִֽיאֲךָ֗ לָֽתֶת־לְךָ֧ אֶת־אַרְצָ֛ם נַחֲלָ֖ה כַּיּ֥וֹם הַזֶּֽה׃ \n" +
					"וְיָדַעְתָּ֣ הַיּ֗וֹם וַהֲשֵׁבֹתָ֮ אֶל־לְבָבֶ֒ךָ֒ כִּ֤י יְהֹוָה֙ ה֣וּא הָֽאֱלֹהִ֔ים בַּשָּׁמַ֣יִם מִמַּ֔עַל וְעַל־הָאָ֖רֶץ מִתָּ֑חַת אֵ֖ין עֽוֹד׃ \n" +
					"וְשָׁמַרְתָּ֞ אֶת־חֻקָּ֣יו וְאֶת־מִצְוֺתָ֗יו אֲשֶׁ֨ר אָנֹכִ֤י מְצַוְּךָ֙ הַיּ֔וֹם אֲשֶׁר֙ יִיטַ֣ב לְךָ֔ וּלְבָנֶ֖יךָ אַחֲרֶ֑יךָ וּלְמַ֨עַן תַּאֲרִ֤יךְ יָמִים֙ עַל־הָ֣אֲדָמָ֔ה אֲשֶׁ֨ר יְהֹוָ֧ה אֱלֹהֶ֛יךָ נֹתֵ֥ן לְךָ֖ כׇּל־הַיָּמִֽים׃");

				addToSiddurHighlighted("אין אומרים חצי קדיש (Do NOT say Half Kaddish here)");
				addToSiddurHighlighted(
					"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר בָּחַר בִּנְבִיאִים טוֹבִים וְרָצָה בְדִבְרֵיהֶם הַנֶּאֱמָרִים בֶּאֱמֶת. בָּרוּךְ אַתָּה יְהֹוָה, הַבּוֹחֵר בַּתּוֹרָה וּבְמֹשֶׁה עַבְדּוֹ, וּבְיִשְׂרָאֵל עַמּוֹ וּבִנְבִיאֵי הָאֱמֶת וְהַצֶּדֶק:");
				addToSiddurHighlighted(
					"אָסֹ֥ף אֲסִיפֵ֖ם נְאֻם־יְהֹוָ֑ה אֵין֩ עֲנָבִ֨ים בַּגֶּ֜פֶן וְאֵ֧ין תְּאֵנִ֣ים בַּתְּאֵנָ֗ה וְהֶעָלֶה֙ נָבֵ֔ל וָאֶתֵּ֥ן לָהֶ֖ם יַעַבְרֽוּם׃ \n" +
					"עַל־מָה֙ אֲנַ֣חְנוּ יֹֽשְׁבִ֔ים הֵאָסְפ֗וּ וְנָב֛וֹא אֶל־עָרֵ֥י הַמִּבְצָ֖ר וְנִדְּמָה־שָּׁ֑ם כִּי֩ יְהֹוָ֨ה אֱלֹהֵ֤ינוּ הֲדִמָּ֙נוּ֙ וַיַּשְׁקֵ֣נוּ מֵי־רֹ֔אשׁ כִּ֥י חָטָ֖אנוּ לַיהֹוָֽה׃ \n" +
					"קַוֵּ֥ה לְשָׁל֖וֹם וְאֵ֣ין ט֑וֹב לְעֵ֥ת מַרְפֵּ֖ה וְהִנֵּ֥ה בְעָתָֽה׃ \n" +
					"מִדָּ֤ן נִשְׁמַע֙ נַחְרַ֣ת סוּסָ֔יו מִקּוֹל֙ מִצְהֲל֣וֹת אַבִּירָ֔יו רָעֲשָׁ֖ה כׇּל־הָאָ֑רֶץ וַיָּב֗וֹאוּ וַיֹּֽאכְלוּ֙ אֶ֣רֶץ וּמְלוֹאָ֔הּ עִ֖יר וְיֹ֥שְׁבֵי בָֽהּ׃ \n" +
					"כִּי֩ הִנְנִ֨י מְשַׁלֵּ֜חַ בָּכֶ֗ם נְחָשִׁים֙ צִפְעֹנִ֔ים אֲשֶׁ֥ר אֵין־לָהֶ֖ם לָ֑חַשׁ וְנִשְּׁכ֥וּ אֶתְכֶ֖ם נְאֻם־יְהֹוָֽה׃ \n" +
					"מַבְלִ֥יגִיתִ֖י עֲלֵ֣י יָג֑וֹן עָלַ֖י לִבִּ֥י דַוָּֽי׃ \n" +
					"הִנֵּה־ק֞וֹל שַֽׁוְעַ֣ת בַּת־עַמִּ֗י מֵאֶ֙רֶץ֙ מַרְחַקִּ֔ים הַֽיהֹוָה֙ אֵ֣ין בְּצִיּ֔וֹן אִם־מַלְכָּ֖הּ אֵ֣ין בָּ֑הּ מַדּ֗וּעַ הִכְעִס֛וּנִי בִּפְסִלֵיהֶ֖ם בְּהַבְלֵ֥י נֵכָֽר׃ \n" +
					"עָבַ֥ר קָצִ֖יר כָּ֣לָה קָ֑יִץ וַאֲנַ֖חְנוּ ל֥וֹא נוֹשָֽׁעְנוּ׃ \n" +
					"עַל־שֶׁ֥בֶר בַּת־עַמִּ֖י הׇשְׁבָּ֑רְתִּי קָדַ֕רְתִּי שַׁמָּ֖ה הֶחֱזִקָֽתְנִי׃ \n" +
					"הַצֳּרִי֙ אֵ֣ין בְּגִלְעָ֔ד אִם־רֹפֵ֖א אֵ֣ין שָׁ֑ם כִּ֗י מַדּ֙וּעַ֙ לֹ֣א עָֽלְתָ֔ה אֲרֻכַ֖ת בַּת־עַמִּֽי׃ \n" +
					"מִֽי־יִתֵּ֤ן רֹאשִׁי֙ מַ֔יִם וְעֵינִ֖י מְק֣וֹר דִּמְעָ֑ה וְאֶבְכֶּה֙ יוֹמָ֣ם וָלַ֔יְלָה אֵ֖ת חַֽלְלֵ֥י בַת־עַמִּֽי׃ \n" +
					"מִֽי־יִתְּנֵ֣נִי בַמִּדְבָּ֗ר מְלוֹן֙ אֹֽרְחִ֔ים וְאֶֽעֶזְבָה֙ אֶת־עַמִּ֔י וְאֵלְכָ֖ה מֵֽאִתָּ֑ם כִּ֤י כֻלָּם֙ מְנָ֣אֲפִ֔ים עֲצֶ֖רֶת בֹּגְדִֽים׃ \n" +
					"וַֽיַּדְרְכ֤וּ אֶת־לְשׁוֹנָם֙ קַשְׁתָּ֣ם שֶׁ֔קֶר וְלֹ֥א לֶאֱמוּנָ֖ה גָּבְר֣וּ בָאָ֑רֶץ כִּי֩ מֵרָעָ֨ה אֶל־רָעָ֧ה ׀ יָצָ֛אוּ וְאֹתִ֥י לֹא־יָדָ֖עוּ נְאֻם־יְהֹוָֽה׃ \n" +
					"אִ֤ישׁ מֵרֵעֵ֙הוּ֙ הִשָּׁמֵ֔רוּ וְעַל־כׇּל־אָ֖ח אַל־תִּבְטָ֑חוּ כִּ֤י כׇל־אָח֙ עָק֣וֹב יַעְקֹ֔ב וְכׇל־רֵ֖עַ רָכִ֥יל יַהֲלֹֽךְ׃ \n" +
					"וְאִ֤ישׁ בְּרֵעֵ֙הוּ֙ יְהָתֵ֔לּוּ וֶאֱמֶ֖ת לֹ֣א יְדַבֵּ֑רוּ לִמְּד֧וּ לְשׁוֹנָ֛ם דַּבֶּר־שֶׁ֖קֶר הַעֲוֵ֥ה נִלְאֽוּ׃ \n" +
					"שִׁבְתְּךָ֖ בְּת֣וֹךְ מִרְמָ֑ה בְּמִרְמָ֛ה מֵאֲנ֥וּ דַעַת־אוֹתִ֖י נְאֻם־יְהֹוָֽה׃ \n" +
					"לָכֵ֗ן כֹּ֤ה אָמַר֙ יְהֹוָ֣ה צְבָא֔וֹת הִנְנִ֥י צוֹרְפָ֖ם וּבְחַנְתִּ֑ים כִּי־אֵ֣יךְ אֶֽעֱשֶׂ֔ה מִפְּנֵ֖י בַּת־עַמִּֽי׃ \n" +
					"חֵ֥ץ שָׁח֛וּט לְשׁוֹנָ֖ם מִרְמָ֣ה דִבֵּ֑ר בְּפִ֗יו שָׁל֤וֹם אֶת־רֵעֵ֙הוּ֙ יְדַבֵּ֔ר וּבְקִרְבּ֖וֹ יָשִׂ֥ים אׇרְבּֽוֹ׃ \n" +
					"הַֽעַל־אֵ֥לֶּה לֹא־אֶפְקׇד־בָּ֖ם נְאֻם־יְהֹוָ֑ה אִ֚ם בְּג֣וֹי אֲשֶׁר־כָּזֶ֔ה לֹ֥א תִתְנַקֵּ֖ם נַפְשִֽׁי׃ \n" +
					"עַל־הֶ֨הָרִ֜ים אֶשָּׂ֧א בְכִ֣י וָנֶ֗הִי וְעַל־נְא֤וֹת מִדְבָּר֙ קִינָ֔ה כִּ֤י נִצְּתוּ֙ מִבְּלִי־אִ֣ישׁ עֹבֵ֔ר וְלֹ֥א שָׁמְע֖וּ ק֣וֹל מִקְנֶ֑ה מֵע֤וֹף הַשָּׁמַ֙יִם֙ וְעַד־בְּהֵמָ֔ה נָדְד֖וּ הָלָֽכוּ׃ \n" +
					"וְנָתַתִּ֧י אֶת־יְרוּשָׁלַ֛͏ִם לְגַלִּ֖ים מְע֣וֹן תַּנִּ֑ים וְאֶת־עָרֵ֧י יְהוּדָ֛ה אֶתֵּ֥ן שְׁמָמָ֖ה מִבְּלִ֥י יוֹשֵֽׁב׃ \n" +
					"מִֽי־הָאִ֤ישׁ הֶחָכָם֙ וְיָבֵ֣ן אֶת־זֹ֔את וַאֲשֶׁ֨ר דִּבֶּ֧ר פִּֽי־יְהֹוָ֛ה אֵלָ֖יו וְיַגִּדָ֑הּ עַל־מָה֙ אָבְדָ֣ה הָאָ֔רֶץ נִצְּתָ֥ה כַמִּדְבָּ֖ר מִבְּלִ֥י עֹבֵֽר׃ \n" +
					"וַיֹּ֣אמֶר יְהֹוָ֔ה עַל־עׇזְבָם֙ אֶת־תּ֣וֹרָתִ֔י אֲשֶׁ֥ר נָתַ֖תִּי לִפְנֵיהֶ֑ם וְלֹא־שָׁמְע֥וּ בְקוֹלִ֖י וְלֹא־הָ֥לְכוּ בָֽהּ׃ \n" +
					"וַיֵּ֣לְכ֔וּ אַחֲרֵ֖י שְׁרִר֣וּת לִבָּ֑ם וְאַֽחֲרֵי֙ הַבְּעָלִ֔ים אֲשֶׁ֥ר לִמְּד֖וּם אֲבוֹתָֽם׃ \n" +
					"לָכֵ֗ן כֹּה־אָמַ֞ר יְהֹוָ֤ה צְבָאוֹת֙ אֱלֹהֵ֣י יִשְׂרָאֵ֔ל הִנְנִ֧י מַאֲכִילָ֛ם אֶת־הָעָ֥ם הַזֶּ֖ה לַעֲנָ֑ה וְהִשְׁקִיתִ֖ים מֵי־רֹֽאשׁ׃ \n" +
					"וַהֲפִֽצוֹתִים֙ בַּגּוֹיִ֔ם אֲשֶׁר֙ לֹ֣א יָדְע֔וּ הֵ֖מָּה וַאֲבוֹתָ֑ם וְשִׁלַּחְתִּ֤י אַֽחֲרֵיהֶם֙ אֶת־הַחֶ֔רֶב עַ֥ד כַּלּוֹתִ֖י אוֹתָֽם׃ \n" +
					"כֹּ֤ה אָמַר֙ יְהֹוָ֣ה צְבָא֔וֹת הִתְבּ֥וֹנְנ֛וּ וְקִרְא֥וּ לַמְקוֹנְנ֖וֹת וּתְבוֹאֶ֑ינָה וְאֶל־הַחֲכָמ֥וֹת שִׁלְח֖וּ וְתָבֽוֹאנָה׃ \n" +
					"וּתְמַהֵ֕רְנָה וְתִשֶּׂ֥נָה עָלֵ֖ינוּ נֶ֑הִי וְתֵרַ֤דְנָה עֵינֵ֙ינוּ֙ דִּמְעָ֔ה וְעַפְעַפֵּ֖ינוּ יִזְּלוּ־מָֽיִם׃ \n" +
					"כִּ֣י ק֥וֹל נְהִ֛י נִשְׁמַ֥ע מִצִּיּ֖וֹן אֵ֣יךְ שֻׁדָּ֑דְנוּ בֹּ֤שְׁנֽוּ מְאֹד֙ כִּֽי־עָזַ֣בְנוּ אָ֔רֶץ כִּ֥י הִשְׁלִ֖יכוּ מִשְׁכְּנוֹתֵֽינוּ׃ \n" +
					"כִּֽי־שְׁמַ֤עְנָה נָשִׁים֙ דְּבַר־יְהֹוָ֔ה וְתִקַּ֥ח אׇזְנְכֶ֖ם דְּבַר־פִּ֑יו וְלַמֵּ֤דְנָה בְנֽוֹתֵיכֶם֙ נֶ֔הִי וְאִשָּׁ֥ה רְעוּתָ֖הּ קִינָֽה׃ \n" +
					"כִּי־עָ֤לָֽה מָ֙וֶת֙ בְּחַלּוֹנֵ֔ינוּ בָּ֖א בְּאַרְמְנוֹתֵ֑ינוּ לְהַכְרִ֤ית עוֹלָל֙ מִח֔וּץ בַּֽחוּרִ֖ים מֵרְחֹבֽוֹת׃ \n" +
					"דַּבֵּ֗ר כֹּ֚ה נְאֻם־יְהֹוָ֔ה וְנָֽפְלָה֙ נִבְלַ֣ת הָאָדָ֔ם כְּדֹ֖מֶן עַל־פְּנֵ֣י הַשָּׂדֶ֑ה וּכְעָמִ֛יר מֵאַחֲרֵ֥י הַקֹּצֵ֖ר וְאֵ֥ין מְאַסֵּֽף׃ \n" +
					"כֹּ֣ה ׀ אָמַ֣ר יְהֹוָ֗ה אַל־יִתְהַלֵּ֤ל חָכָם֙ בְּחׇכְמָת֔וֹ וְאַל־יִתְהַלֵּ֥ל הַגִּבּ֖וֹר בִּגְבֽוּרָת֑וֹ אַל־יִתְהַלֵּ֥ל עָשִׁ֖יר בְּעׇשְׁרֽוֹ׃ \n" +
					"כִּ֣י אִם־בְּזֹ֞את יִתְהַלֵּ֣ל הַמִּתְהַלֵּ֗ל הַשְׂכֵּל֮ וְיָדֹ֣עַ אוֹתִי֒ כִּ֚י אֲנִ֣י יְהֹוָ֔ה עֹ֥שֶׂה חֶ֛סֶד מִשְׁפָּ֥ט וּצְדָקָ֖ה בָּאָ֑רֶץ כִּֽי־בְאֵ֥לֶּה חָפַ֖צְתִּי נְאֻם־יְהֹוָֽה׃");
				addToSiddurHighlighted("אחר קריאת ההפטרה יאמר \n" +
					"גֹּאֲלֵ֕נוּ יְהֹוָ֥ה צְבָא֖וֹת שְׁמ֑וֹ קְד֖וֹשׁ יִשְׂרָאֵֽל׃ \n" +
					"ואחר כך יברך \n" +
					"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, צוּר כָּל־הָעוֹלָמִים, צַדִּיק בְּכָל־הַדּוֹרוֹת, הָאֵל הַנֶּאֱמָן הָאֹמֵר וְעֹשֶׂה, הַמְדַבֵּר וּמְקַיֵּם, שֶׁכָּל־דְּבָרָיו אֱמֶת וָצֶדֶק. נֶאֱמָן, אַתָּה הוּא יְהֹוָה אֱלֹהֵינוּ, וְנֶאֱמָנִים דְּבָרֶיךָ, וְדָבָר אֶחָד מִדְּבָרֶיךָ אָחוֹר לֹא יָשׁוּב רֵיקָם, כִּי אֵל מֶלֶךְ נֶאֱמָן וְרַחֲמָן אָתָּה. בָּרוּךְ אַתָּה יְהֹוָה, הָאֵל הַנֶּאֱמָן בְּכָל־דְּבָרָיו: \n" +
					"רַחֵם עַל צִיּוֹן כִּי הִיא בֵּית חַיֵּינוּ, וְלַעֲלוּבַת נֶפֶשׁ תּוֹשִׁיעַ בִּמְהֵרָה בְיָמֵינוּ. בָּרוּךְ אַתָּה יְהֹוָה, מְשַׂמֵּחַ צִיּוֹן בְּבָנֶיהָ: \n" +
					"שַׂמְּחֵנוּ יְהֹוָה אֱלֹהֵינוּ, בְּאֵלִיָהוּ הַנָּבִיא עַבְדָּךְ, וּבְמַלְכוּת בֵּית דָּוִד מְשִׁיחָךְ, בִּמְהֵרָה יָבֹא וְיָגֵל לִבֵּנוּ, עַל כִּסְאוֹ לֹא יֵשֶׁב זָר, וְלֹא יִנְחֲלוּ עוֹד אֲחֵרִים אֶת כְּבוֹדוֹ, כִּי בְשֵׁם קָדְשְׁךָ נִשְׁבַּעְתָּ לּוֹ, שֶׁלֹּא יִכְבֶּה נֵרוֹ לְעוֹלָם וָעֶד. בָּרוּךְ אַתָּה יְהֹוָה, מָגֵן דָּוִד: [אָמֵן]");
			} else {
				addToSiddur(WeeklyParashaReadings.getWeeklyParashaReading(
						jewishDateInfo.getJewishCalendar().getUpcomingParshah(),
						jewishDateInfo.getJewishCalendar(),
						true));

				addToSiddur("העולה האחרון אומר חצי קדיש (The last person says Half Kaddish)");
			}
			addHalfKaddish(false);
		}

		addCategoryToSiddur("אשרי");

		addToSiddur(
			"אַ֭שְׁרֵי יוֹשְׁבֵ֣י בֵיתֶ֑ךָ ע֝֗וֹד יְֽהַלְל֥וּךָ סֶּֽלָה: אַשְׁרֵ֣י הָ֭עָם שֶׁכָּ֣כָה לּ֑וֹ אַֽשְׁרֵ֥י הָ֝עָ֗ם שֱׁיְהֹוָ֥ה אֱלֹהָֽיו:\n" +
			"תְּהִלָּ֗ה לְדָ֫וִ֥ד אֲרוֹמִמְךָ֣ אֱלוֹהַ֣י הַמֶּ֑לֶךְ וַאֲבָרְכָ֥ה שִׁ֝מְךָ֗ לְעוֹלָ֥ם וָעֶֽד׃ בְּכָל־י֥וֹם אֲבָֽרְכֶ֑ךָּ וַאֲהַֽלְלָ֥ה שִׁ֝מְךָ֗ לְעוֹלָ֥ם וָעֶֽד׃ גָּ֘ד֤וֹל יְהֹוָ֣ה וּמְהֻלָּ֣ל מְאֹ֑ד וְ֝לִגְדֻלָּת֗וֹ אֵ֣ין חֵֽקֶר׃ דּ֣וֹר לְ֭דוֹר יְשַׁבַּ֣ח מַעֲשֶׂ֑יךָ וּגְב֖וּרֹתֶ֣יךָ יַגִּֽידוּ׃ הֲ֭דַר כְּב֣וֹד הוֹדֶ֑ךָ וְדִבְרֵ֖י נִפְלְאֹתֶ֣יךָ אָשִֽׂיחָה׃ וֶעֱז֣וּז נֽוֹרְאֹתֶ֣יךָ יֹאמֵ֑רוּ וּגְדֻלָּתְךָ֥ אֲסַפְּרֶֽנָּה׃ זֵ֣כֶר רַב־טוּבְךָ֣ יַבִּ֑יעוּ וְצִדְקָתְךָ֥ יְרַנֵּֽנוּ׃ חַנּ֣וּן וְרַח֣וּם יְהֹוָ֑ה אֶ֥רֶךְ אַ֝פַּ֗יִם וּגְדׇל־חָֽסֶד׃ טוֹב־יְהֹוָ֥ה לַכֹּ֑ל וְ֝רַחֲמָ֗יו עַל־כׇּל־מַעֲשָֽׂיו׃ יוֹד֣וּךָ יְ֭הֹוָה כׇּל־מַעֲשֶׂ֑יךָ וַ֝חֲסִידֶ֗יךָ יְבָרְכֽוּכָה׃ כְּב֣וֹד מַלְכוּתְךָ֣ יֹאמֵ֑רוּ וּגְבוּרָתְךָ֥ יְדַבֵּֽרוּ׃ לְהוֹדִ֤יעַ  ׀ לִבְנֵ֣י הָ֭אָדָם גְּבוּרֹתָ֑יו וּ֝כְב֗וֹד הֲדַ֣ר מַלְכוּתֽוֹ׃ מַֽלְכוּתְךָ֗ מַלְכ֥וּת כׇּל־עֹלָמִ֑ים וּ֝מֶֽמְשַׁלְתְּךָ֗ בְּכׇל־דּ֥וֹר וָדֹֽר׃ סוֹמֵ֣ךְ יְ֭הֹוָה לְכׇל־הַנֹּפְלִ֑ים וְ֝זוֹקֵ֗ף לְכׇל־הַכְּפוּפִֽים׃ עֵֽינֵי־כֹ֭ל אֵלֶ֣יךָ יְשַׂבֵּ֑רוּ וְאַתָּ֤ה נֽוֹתֵן־לָהֶ֖ם אֶת־אׇכְלָ֣ם בְּעִתּֽוֹ׃ פּוֹתֵ֥חַ אֶת־יָדֶ֑ךָ וּמַשְׂבִּ֖יעַ לְכׇל־חַ֣י רָצֽוֹן׃ צַדִּ֣יק יְ֭הֹוָה בְּכׇל־דְּרָכָ֑יו וְ֝חָסִ֗יד בְּכׇל־מַעֲשָֽׂיו׃ קָר֣וֹב יְ֭הֹוָה לְכׇל־קֹרְאָ֑יו לְכֹ֤ל אֲשֶׁ֖ר יִקְרָאֻ֣הוּ בֶֽאֱמֶֽת׃ רְצוֹן־יְרֵאָ֥יו יַעֲשֶׂ֑ה וְֽאֶת־שַׁוְעָתָ֥ם יִ֝שְׁמַ֗ע וְיוֹשִׁיעֵֽם׃ שׁוֹמֵ֣ר יְ֭הֹוָה אֶת־כׇּל־אֹהֲבָ֑יו וְאֵ֖ת כׇּל־הָרְשָׁעִ֣ים יַשְׁמִֽיד׃ תְּהִלַּ֥ת יְהֹוָ֗ה יְֽדַבֶּ֫ר פִּ֥י וִיבָרֵ֣ךְ כׇּל־בָּ֭שָׂר שֵׁ֥ם קׇדְשׁ֗וֹ לְעוֹלָ֥ם וָעֶֽד׃ וַאֲנַ֤חְנוּ ׀ נְבָ֘רֵ֤ךְ יָ֗הּ מֵעַתָּ֥ה וְעַד־עוֹלָ֗ם הַֽלְלוּיָֽהּ׃");

		if (isTachanunSaidInTheMorning) {
			addToSiddur(
				"לַמְנַצֵּ֗חַ מִזְמ֥וֹר לְדָוִֽד׃ יַֽעַנְךָ֣ יְ֭הֹוָה בְּי֣וֹם צָרָ֑ה יְ֝שַׂגֶּבְךָ֗ שֵׁ֤ם ׀ אֱלֹהֵ֬י יַעֲקֹֽב׃ יִשְׁלַֽח־עֶזְרְךָ֥ מִקֹּ֑דֶשׁ וּ֝מִצִּיּ֗וֹן יִסְעָדֶֽךָּ׃ יִזְכֹּ֥ר כׇּל־מִנְחֹתֶ֑ךָ וְעוֹלָתְךָ֖ יְדַשְּׁנֶ֣ה סֶֽלָה׃ יִֽתֶּן־לְךָ֥ כִלְבָבֶ֑ךָ וְֽכׇל־עֲצָתְךָ֥ יְמַלֵּֽא׃ נְרַנְּנָ֤ה ׀ בִּ֘ישׁ֤וּעָתֶ֗ךָ וּבְשֵֽׁם־אֱלֹהֵ֥ינוּ נִדְגֹּ֑ל יְמַלֵּ֥א יְ֝הֹוָ֗ה כׇּל־מִשְׁאֲלוֹתֶֽיךָ׃ עַתָּ֤ה יָדַ֗עְתִּי כִּ֤י הוֹשִׁ֥יעַ ׀ יְהֹוָ֗ה מְשִׁ֫יח֥וֹ יַ֭עֲנֵהוּ מִשְּׁמֵ֣י קׇדְשׁ֑וֹ בִּ֝גְבֻר֗וֹת יֵ֣שַׁע יְמִינֽוֹ׃ אֵ֣לֶּה בָ֭רֶכֶב וְאֵ֣לֶּה בַסּוּסִ֑ים וַאֲנַ֓חְנוּ ׀ בְּשֵׁם־יְהֹוָ֖ה אֱלֹהֵ֣ינוּ נַזְכִּֽיר׃ הֵ֭מָּה כָּרְע֣וּ וְנָפָ֑לוּ וַאֲנַ֥חְנוּ קַּ֝֗מְנוּ וַנִּתְעוֹדָֽד׃ יְהֹוָ֥ה הוֹשִׁ֑יעָה הַ֝מֶּ֗לֶךְ יַעֲנֵ֥נוּ בְיוֹם־קׇרְאֵֽנוּ׃");
		}

		String ubaLetzion = "וּבָ֤א לְצִיּוֹן֙ גּוֹאֵ֔ל וּלְשָׁבֵ֥י פֶ֖שַׁע בְּיַֽעֲקֹ֑ב נְאֻ֖ם יְהֹוָֽה׃";
		if (!jewishDateInfo.getJewishCalendar().isTishaBav()) {
			addToSiddur(ubaLetzion + "וַאֲנִ֗י זֹ֣את בְּרִיתִ֤י אוֹתָם֙ אָמַ֣ר יְהֹוָ֔ה רוּחִי֙ אֲשֶׁ֣ר עָלֶ֔יךָ וּדְבָרַ֖י אֲשֶׁר־שַׂ֣מְתִּי בְּפִ֑יךָ לֹֽא־יָמ֡וּשׁוּ מִפִּ֩יךָ֩ וּמִפִּ֨י זַרְעֲךָ֜ וּמִפִּ֨י זֶ֤רַע זַרְעֲךָ֙ אָמַ֣ר יְהֹוָ֔ה מֵעַתָּ֖ה וְעַד־עוֹלָֽם׃");
		} else {
			addToSiddur("[" + ubaLetzion + "]");
		}

		if (jewishDateInfo.getJewishCalendar().isPurim() ||
			// for purim meshulash
			(jewishDateInfo.getJewishCalendar().getIsMukafChoma()
				&& jewishDateInfo.getJewishCalendar().getDayOfWeek() == 6
				&& jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 14 &&
					(jewishDateInfo.getJewishCalendar().getJewishMonth() == JewishDate.ADAR
							|| jewishDateInfo.getJewishCalendar().getJewishMonth() == JewishDate.ADAR_II))) {
			addCategoryToSiddur("קריאת המגילה");
			if (jewishDateInfo.getJewishCalendar().getIsSafekMukafChoma()) {
				addToSiddurHighlighted(
					"ב-14 באדר, בעיר שהיא ספק מוקפת חומה, קוראים את המגילה עם הברכות, ולא אומרים את הברכות ב-15/On the 14th of Adar, in a safek mufak choma, we read the megilah with the berachot, and we do not say the berachot on the 15th. (הליכות עולם רל)");
			}
			addToSiddurHighlighted(
				"לפני קריאת המגילה החזן מברך מעומד, וגם הקהל יעמדו בשעת הברכה: (Before the Megilah is read, everyone should stand for the bracha) \n\n" +
				"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָֽׁנוּ בְּמִצְוֹתָיו, וְצִוָּֽנוּ עַל מִקְרָא מְגִלָּה:\n\n" +
				"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, שֶׁעָשָׂה נִסִּים לַאֲבוֹתֵֽינוּ בַּיָּמִים הָהֵם בַּזְּמַן הַזֶּה:\n\n" +
				"אם מתפללים עם אשכנזים, לא יענו אמן לברכת שהחיינו (If one is praying by ashkenazim, they should not answer amen to the Shehechiyanu blessing) \n\n" +
				"קוראים את המגילה (Megilah is read) \n\n" +
				"וכשאומר \"ויקר\" ישים ידיו על התפילין וינשק, וכשאומר \"את אגרת הפורים\" ינענע המגילה בתיבת \"אגרת\" (Remember to place your hands on your tefilin and kiss them when saying the word \"Vikar\", and remember to shake the megilah when saying the word \"Igeret\" while the megilah is read) \n" +
				"(בן איש חי שנה א תצוה ט) \n\n" +
				"אחר קריאת המגילה גוללה ואחר כך מברך: (Megilah is finished) \n\n" +
				"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, הַאֵל הָרָב אֶת־רִיבֵֽנוּ, וְהַדָּן אֶת־דִּינֵֽנוּ, וְהַנּוֹקֵם אֶת־נִקְמָתֵֽנוּ, וְהַנִּפְרָע לָנוּ מִצָּרֵֽינוּ, וְהַמְשַׁלֵּם גְּמּוּל לְכָל־אֽוֹיְבֵֽי נַפְשֵֽׁנוּ. בָּרוּךְ אַתָּה יְהֹוָה, הַנִּפְרָע לְעַמּוֹ יִשְׂרָאֵל מִכָּל־צָרֵיהֶם הָאֵל הַמּוֹשִׁיעַ:\n\n" +
				"אָרוּר הָמָן, בָּרוּךְ מָרְדְּכַי.\n\n" +
				"אֲרוּרָה זֶרֶשׁ, בְּרוּכָה אֶסְתֵּר.\n\n" +
				"אֲרוּרִים כָּל־הָרְשָׁעִים, בְּרוּכִים כָּל־יִשְׂרָאֵל. וְגַם חַרְבוֹנָה זָכוּר לטוֹב: שלש פעמים (Three times)");
		}
		addToSiddur(
			"וְאַתָּ֥ה קָד֑וֹשׁ י֝וֹשֵׁ֗ב תְּהִלּ֥וֹת יִשְׂרָאֵֽל׃ וְקָרָ֨א זֶ֤ה אֶל־זֶה֙ וְאָמַ֔ר קָד֧וֹשׁ ׀ קָד֛וֹשׁ קָד֖וֹשׁ יְהֹוָ֣ה צְבָא֑וֹת מְלֹ֥א כׇל־הָאָ֖רֶץ כְּבוֹדֽוֹ׃ (silently/בלחש) וּמְקַבְּלִין דֵּין מִן דֵּין וְאָֽמְרִין: קַדִּישׁ בִּשְׁמֵי מְרוֹמָא עִלָּאָה בֵּית שְׁכִינְתֵּהּ, קַדִּישׁ עַל אַרְעָא עוֹבַד גְּבוּרְתֵּהּ, קַדִּישׁ לְעָלַם וּלְעָֽלְמֵי עָֽלְמַיָּא. יְהֹוָה צְבָאוֹת מַלְיָא כָל-אַרְעָא זִיו יְקָרֵהּ: (בקול/speak up) וַתִּשָּׂאֵ֣נִי ר֔וּחַ וָאֶשְׁמַ֣ע אַחֲרַ֔י ק֖וֹל רַ֣עַשׁ גָּד֑וֹל בָּר֥וּךְ כְּבוֹד־יְהֹוָ֖ה מִמְּקוֹמֽוֹ׃ (silently/בלחש) וּנְטָלַֽתְנִי רוּחָא, וּשְׁמָעִית בַּתְרַי קַל זִֽיעַ שַׂגִּיא דִּמְשַׁבְּחִין וְאָֽמְרִין: בְּרִיךְ יְקָרָא דַֽיהֹוָה מֵֽאֲתַר בֵּית שְׁכִינְתֵּהּ: (בקול/speak up) יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד׃ (silently/בלחש) יְהֹוָה מַלְכוּתֵיהּ קָאִים לְעָלַם וּלְעָֽלְמֵי עָֽלְמַיָּא: (בקול/speak up) יְהֹוָ֗ה אֱ֠לֹהֵ֠י אַבְרָהָ֞ם יִצְחָ֤ק וְיִשְׂרָאֵל֙ אֲבֹתֵ֔ינוּ שׇׁמְרָה־זֹּ֣את לְעוֹלָ֔ם לְיֵ֥צֶר מַחְשְׁב֖וֹת לְבַ֣ב עַמֶּ֑ךָ וְהָכֵ֥ן לְבָבָ֖ם אֵלֶֽיךָ׃ וְה֤וּא רַח֨וּם ׀ יְכַפֵּ֥ר עָוֺן֮ וְֽלֹא־יַֽ֫שְׁחִ֥ית וְ֭הִרְבָּה לְהָשִׁ֣יב אַפּ֑וֹ וְלֹא־יָ֝עִ֗יר כׇּל־חֲמָתֽוֹ׃ כִּֽי־אַתָּ֣ה אֲ֭דֹנָי ט֣וֹב וְסַלָּ֑ח וְרַב־חֶ֗֝סֶד לְכׇל־קֹֽרְאֶֽיךָ׃ צִדְקָתְךָ֣ צֶ֣דֶק לְעוֹלָ֑ם וְֽתוֹרָתְךָ֥ אֱמֶֽת׃ תִּתֵּ֤ן אֱמֶת֙ לְיַֽעֲקֹ֔ב חֶ֖סֶד לְאַבְרָהָ֑ם אֲשֶׁר־נִשְׁבַּ֥עְתָּ לַאֲבֹתֵ֖ינוּ מִ֥ימֵי קֶֽדֶם׃ בָּ֤ר֣וּךְ אֲדֹנָי֮ י֤וֹם ׀ י֥֫וֹם יַעֲמָס־לָ֗נוּ הָ֘אֵ֤ל יְֽשׁוּעָתֵ֬נוּ סֶֽלָה׃ יְהֹוָ֣ה צְבָא֣וֹת עִמָּ֑נוּ מִשְׂגָּֽב־לָ֨נוּ אֱלֹהֵ֖י יַֽעֲקֹ֣ב סֶֽלָה׃ יְהֹוָ֥ה צְבָא֑וֹת אַֽשְׁרֵ֥י אָ֝דָ֗ם בֹּטֵ֥חַ בָּֽךְ׃ יְהֹוָ֥ה הוֹשִׁ֑יעָה הַ֝מֶּ֗לֶךְ יַעֲנֵ֥נוּ בְיוֹם־קׇרְאֵֽנוּ: \n\n" +
			"בָּרוּךְ אֱלֹהֵֽינוּ שֶׁבְּרָאָֽנוּ לִכְבוֹדוֹ, וְהִבְדִּילָֽנוּ מִן הַתּוֹעִים, וְנָֽתַן לָֽנוּ תּוֹרַת אֱמֶת, וְחַיֵּי עוֹלָם נָטַע בְּתוֹכֵֽנוּ. הוּא יִפְתַּח לִבֵּֽנוּ בְּתֽוֹרָתוֹ, וְיָשִׂים בְּלִבֵּֽנוּ אַֽהֲבָתוֹ וְיִרְאָתוֹ לַֽעֲשׂוֹת רְצוֹנוֹ, וּלְעָבְדוֹ בְּלֵבָב שָׁלֵם. לֹא נִיגַע לָרִיק, וְלֹא נֵלֵד לַבֶּֽהָלָה. יְהִי רָצוֹן מִלְּפָנֶֽיךָ, יְהֹוָה אֱלֹהֵֽינוּ וֵֽאלֹהֵי אֲבוֹתֵֽינוּ, שֶׁנִּשְׁמוֹר חֻקֶּֽיךָ וּמִצְוֹתֶֽיךָ בָּעוֹלָם הַזֶּה, וְנִזְכֶּה, וְנִחְיֶה, וְנִירַשׁ טוֹבָה וּבְרָכָה לְחַיֵּי הָעוֹלָם הַבָּא: לְמַ֤עַן ׀ יְזַמֶּרְךָ֣ כָ֭בוֹד וְלֹ֣א יִדֹּ֑ם (יפסיק מעט/break) יְהֹוָ֥ה אֱ֝לֹהַ֗י לְעוֹלָ֥ם אוֹדֶֽךָּ׃ יְהֹוָ֥ה חָפֵ֖ץ לְמַ֣עַן צִדְק֑וֹ יַגְדִּ֥יל תּוֹרָ֖ה וְיַאְדִּֽיר: וְיִבְטְח֣וּ בְ֭ךָ יוֹדְעֵ֣י שְׁמֶ֑ךָ כִּ֤י לֹֽא־עָזַ֖בְתָּ דֹרְשֶׁ֣יךָ יְהֹוָֽה: יְהֹוָ֥ה אֲדֹנֵ֑ינוּ מָה־אַדִּ֥יר שִׁ֝מְךָ֗ בְּכׇל־הָאָֽרֶץ׃ חִ֭זְקוּ וְיַאֲמֵ֣ץ לְבַבְכֶ֑ם כׇּל־הַ֝מְיַחֲלִ֗ים לַֽיהֹוָֽה:");

		if (!jewishDateInfo.getJewishCalendar().isRoshChodesh() && !jewishDateInfo.getJewishCalendar().isCholHamoed()) {
			addToSiddur("ואומר החזן קדיש תתקבל (And the chazzan says Kaddish Titkabal)");
			addKaddishTitkabal(false);

			if (jewishDateInfo.getJewishCalendar().getDayOfWeek() == 2
					|| jewishDateInfo.getJewishCalendar().getDayOfWeek() == 5
					|| jewishDateInfo.getJewishCalendar().isPurim() || (jewishDateInfo.getJewishCalendar().isTaanis()
							&& !jewishDateInfo.getJewishCalendar().isTishaBav())) {
				addToSiddur(
						"ומחזירין את ספר התורה למקומו ואומרים יהללו (Sefer torah is returned)\n\n" +
								"יְהַלְל֤וּ ׀ אֶת־שֵׁ֬ם יְהֹוָ֗ה כִּֽי־נִשְׂגָּ֣ב שְׁמ֣וֹ לְבַדּ֑וֹ ה֝וֹד֗וֹ עַל־אֶ֥רֶץ וְשָׁמָֽיִם׃ וַיָּ֤רֶם קֶ֨רֶן ׀ לְעַמּ֡וֹ תְּהִלָּ֤ה לְֽכׇל־חֲסִידָ֗יו לִבְנֵ֣י יִ֭שְׂרָאֵל עַ֥ם קְרֹב֗וֹ הַֽלְלוּיָֽהּ׃ יְהֹוָה הוּא הָאֱלֹהִים, יְהֹוָה֙ ה֣וּא הָֽאֱלֹהִ֔ים בַּשָּׁמַ֣יִם מִמַּ֔עַל וְעַל־הָאָ֖רֶץ מִתָּ֑חַת אֵ֖ין עֽוֹד: אֵין־כָּמ֖וֹךָ בָאֱלֹהִ֥ים ׀ אֲדֹנָ֗י וְאֵ֣ין כְּֽמַעֲשֶֽׂיךָ׃ הֲשִׁיבֵ֨נוּ יְהֹוָ֤ה ׀ אֵלֶ֙יךָ֙ וְֽנָשׁ֔וּבָה חַדֵּ֥שׁ יָמֵ֖ינוּ כְּקֶֽדֶם׃");
			} else if (jewishDateInfo.getJewishCalendar().isTishaBav()) {
				addToSiddurHighlighted(
					"עַ֥ל נַהֲר֨וֹת ׀ בָּבֶ֗ל שָׁ֣ם יָ֭שַׁבְנוּ גַּם־בָּכִ֑ינוּ בְּ֝זׇכְרֵ֗נוּ אֶת־צִיּֽוֹן׃ " +
					"עַֽל־עֲרָבִ֥ים בְּתוֹכָ֑הּ תָּ֝לִ֗ינוּ כִּנֹּרוֹתֵֽינוּ׃ " +
					"כִּ֤י שָׁ֨ם שְֽׁאֵל֪וּנוּ שׁוֹבֵ֡ינוּ דִּבְרֵי־שִׁ֭יר וְתוֹלָלֵ֣ינוּ שִׂמְחָ֑ה שִׁ֥ירוּ לָ֝֗נוּ מִשִּׁ֥יר צִיּֽוֹן׃ " +
					"אֵ֗יךְ נָשִׁ֥יר אֶת־שִׁיר־יְהֹוָ֑ה עַ֝֗ל אַדְמַ֥ת נֵכָֽר׃ " +
					"אִֽם־אֶשְׁכָּחֵ֥ךְ יְֽרוּשָׁלָ֗͏ִם תִּשְׁכַּ֥ח יְמִינִֽי׃ " +
					"תִּדְבַּֽק־לְשׁוֹנִ֨י ׀ לְחִכִּי֮ אִם־לֹ֢א אֶ֫זְכְּרֵ֥כִי אִם־לֹ֣א אַ֭עֲלֶה אֶת־יְרוּשָׁלַ֑͏ִם עַ֝֗ל רֹ֣אשׁ שִׂמְחָתִֽי׃ " +
					"זְכֹ֤ר יְהֹוָ֨ה ׀ לִבְנֵ֬י אֱד֗וֹם אֵת֮ י֤וֹם יְֽר֫וּשָׁלָ֥͏ִם הָ֭אֹ֣מְרִים עָ֤רוּ ׀ עָ֑רוּ עַ֝֗ד הַיְס֥וֹד בָּֽהּ׃ " +
					"בַּת־בָּבֶ֗ל הַשְּׁד֫וּדָ֥ה אַשְׁרֵ֥י שֶׁיְשַׁלֶּם־לָ֑ךְ אֶת־גְּ֝מוּלֵ֗ךְ שֶׁגָּמַ֥לְתְּ לָֽנוּ׃ " +
					"אַשְׁרֵ֤י ׀ שֶׁיֹּאחֵ֓ז וְנִפֵּ֬ץ אֶֽת־עֹלָלַ֗יִךְ אֶל־הַסָּֽלַע׃");
			}
		}

		if (isTachanunSaidInTheMorning) {
			addToSiddur(
				"תְּפִלָּ֗ה לְדָ֫וִ֥ד הַטֵּֽה־יְהֹוָ֣ה אׇזְנְךָ֣ עֲנֵ֑נִי כִּֽי־עָנִ֖י וְאֶבְי֣וֹן אָֽנִי׃ שָׁ֥מְרָ֣ה נַפְשִׁי֮ כִּֽי־חָסִ֢יד אָ֥נִי הוֹשַׁ֣ע עַ֭בְדְּךָ אַתָּ֣ה אֱלֹהַ֑י הַבּוֹטֵ֥חַ אֵלֶֽיךָ׃ חׇנֵּ֥נִי אֲדֹנָ֑י כִּ֥י אֵלֶ֥יךָ אֶ֝קְרָ֗א כׇּל־הַיּֽוֹם׃ שַׂ֭מֵּחַ נֶ֣פֶשׁ עַבְדֶּ֑ךָ כִּ֥י אֵלֶ֥יךָ אֲ֝דֹנָ֗י נַפְשִׁ֥י אֶשָּֽׂא׃ כִּֽי־אַתָּ֣ה אֲ֭דֹנָי ט֣וֹב וְסַלָּ֑ח וְרַב־חֶ֗֝סֶד לְכׇל־קֹֽרְאֶֽיךָ׃ הַאֲזִ֣ינָה יְ֭הֹוָה תְּפִלָּתִ֑י וְ֝הַקְשִׁ֗יבָה בְּק֣וֹל תַּחֲנוּנוֹתָֽי׃ בְּי֣וֹם צָ֭רָתִ֥י אֶקְרָאֶ֗ךָּ כִּ֣י תַעֲנֵֽנִי׃ אֵין־כָּמ֖וֹךָ בָאֱלֹהִ֥ים ׀ אֲדֹנָ֗י וְאֵ֣ין כְּֽמַעֲשֶֽׂיךָ׃ כׇּל־גּוֹיִ֤ם ׀ אֲשֶׁ֥ר עָשִׂ֗יתָ יָב֤וֹאוּ ׀ וְיִשְׁתַּֽחֲו֣וּ לְפָנֶ֣יךָ אֲדֹנָ֑י וִ֖יכַבְּד֣וּ לִשְׁמֶֽךָ׃ כִּֽי־גָד֣וֹל אַ֭תָּה וְעֹשֵׂ֣ה נִפְלָא֑וֹת אַתָּ֖ה אֱלֹהִ֣ים לְבַדֶּֽךָ׃ ה֘וֹרֵ֤נִי יְהֹוָ֨ה ׀ דַּרְכֶּ֗ךָ אֲהַלֵּ֥ךְ בַּאֲמִתֶּ֑ךָ יַחֵ֥ד לְ֝בָבִ֗י לְיִרְאָ֥ה שְׁמֶֽךָ׃ אוֹדְךָ֤ ׀ אֲדֹנָ֣י אֱ֭לֹהַי בְּכׇל־לְבָבִ֑י וַאֲכַבְּדָ֖ה שִׁמְךָ֣ לְעוֹלָֽם׃ כִּֽי־חַ֭סְדְּךָ גָּד֣וֹל עָלָ֑י וְהִצַּ֥לְתָּ נַ֝פְשִׁ֗י מִשְּׁא֥וֹל תַּחְתִּיָּֽה׃ אֱלֹהִ֤ים ׀ זֵ֘דִ֤ים קָֽמוּ־עָלַ֗י וַעֲדַ֣ת עָ֭רִיצִים בִּקְשׁ֣וּ נַפְשִׁ֑י וְלֹ֖א שָׂמ֣וּךָ לְנֶגְדָּֽם׃ וְאַתָּ֣ה אֲ֭דֹנָי אֵל־רַח֣וּם וְחַנּ֑וּן אֶ֥רֶךְ אַ֝פַּ֗יִם וְרַב־חֶ֥סֶד וֶאֱמֶֽת׃ פְּנֵ֥ה אֵלַ֗י וְחָ֫נֵּ֥נִי תְּנָֽה־עֻזְּךָ֥ לְעַבְדֶּ֑ךָ וְ֝הוֹשִׁ֗יעָה לְבֶן־אֲמָתֶֽךָ׃ עֲשֵֽׂה־עִמִּ֥י א֗וֹת לְט֫וֹבָ֥ה וְיִרְא֣וּ שֹׂנְאַ֣י וְיֵבֹ֑שׁוּ כִּֽי־אַתָּ֥ה יְ֝הֹוָ֗ה עֲזַרְתַּ֥נִי וְנִחַמְתָּֽנִי׃");
		}

		addToSiddur(
			"בֵּ֖ית יַעֲקֹ֑ב לְכ֥וּ וְנֵלְכָ֖ה בְּא֥וֹר יְהֹוָֽה׃ כִּ֚י כׇּל־הָ֣עַמִּ֔ים יֵלְכ֕וּ אִ֖ישׁ בְּשֵׁ֣ם אֱלֹהָ֑יו וַאֲנַ֗חְנוּ נֵלֵ֛ךְ בְּשֵׁם־יְהֹוָ֥ה אֱלֹהֵ֖ינוּ לְעוֹלָ֥ם וָעֶֽד׃ יְהִ֨י יְהֹוָ֤ה אֱלֹהֵ֙ינוּ֙ עִמָּ֔נוּ כַּאֲשֶׁ֥ר הָיָ֖ה עִם־אֲבֹתֵ֑ינוּ אַל־יַעַזְבֵ֖נוּ וְאַֽל־יִטְּשֵֽׁנוּ׃ לְהַטּ֥וֹת לְבָבֵ֖נוּ אֵלָ֑יו לָלֶ֣כֶת בְּכׇל־דְּרָכָ֗יו וְלִשְׁמֹ֨ר מִצְוֺתָ֤יו וְחֻקָּיו֙ וּמִשְׁפָּטָ֔יו אֲשֶׁ֥ר צִוָּ֖ה אֶת־אֲבֹתֵֽינוּ׃ וְיִֽהְי֨וּ דְבָרַ֜י אֵ֗לֶּה אֲשֶׁ֤ר הִתְחַנַּ֙נְתִּי֙ לִפְנֵ֣י יְהֹוָ֔ה קְרֹבִ֛ים אֶל־יְהֹוָ֥ה אֱלֹהֵ֖ינוּ יוֹמָ֣ם וָלָ֑יְלָה לַעֲשׂ֣וֹת ׀ מִשְׁפַּ֣ט עַבְדּ֗וֹ וּמִשְׁפַּ֛ט עַמּ֥וֹ יִשְׂרָאֵ֖ל דְּבַר־י֥וֹם בְּיוֹמֽוֹ׃ לְמַ֗עַן דַּ֚עַת כׇּל־עַמֵּ֣י הָאָ֔רֶץ כִּ֥י יְהֹוָ֖ה ה֣וּא הָאֱלֹהִ֑ים אֵ֖ין עֽוֹד׃ \n\n" +
			"שִׁ֥יר הַֽמַּעֲל֗וֹת לְדָ֫וִ֥ד לוּלֵ֣י יְ֭הֹוָה שֶׁהָ֣יָה לָ֑נוּ יֹאמַר־נָ֗֝א יִשְׂרָאֵֽל׃ לוּלֵ֣י יְ֭הֹוָה שֶׁהָ֣יָה לָ֑נוּ בְּק֖וּם עָלֵ֣ינוּ אָדָֽם׃ אֲ֭זַי חַיִּ֣ים בְּלָע֑וּנוּ בַּחֲר֖וֹת אַפָּ֣ם בָּֽנוּ׃ אֲ֭זַי הַמַּ֣יִם שְׁטָפ֑וּנוּ נַ֗֝חְלָה עָבַ֥ר עַל־נַפְשֵֽׁנוּ׃ אֲ֭זַי עָבַ֣ר עַל־נַפְשֵׁ֑נוּ הַ֝מַּ֗יִם הַזֵּידוֹנִֽים׃ בָּר֥וּךְ יְהֹוָ֑ה שֶׁלֹּ֥א נְתָנָ֥נוּ טֶ֗֝רֶף לְשִׁנֵּיהֶֽם׃ נַפְשֵׁ֗נוּ כְּצִפּ֥וֹר נִמְלְטָה֮ מִפַּ֢ח י֫וֹקְשִׁ֥ים הַפַּ֥ח נִשְׁבָּ֗ר וַאֲנַ֥חְנוּ נִמְלָֽטְנוּ׃ עֶ֭זְרֵנוּ בְּשֵׁ֣ם יְהֹוָ֑ה עֹ֝שֵׂ֗ה שָׁמַ֥יִם וָאָֽרֶץ׃");

		boolean removeHashir = jewishDateInfo.getJewishCalendar().isRoshChodesh()
				|| jewishDateInfo.getJewishCalendar().isChanukah()
				|| jewishDateInfo.getJewishCalendar().isPurim();

		addShirShelYom(removeHashir);

		switch (jewishDateInfo.getJewishCalendar().getYomTovIndex()) {
			case JewishCalendar.FAST_OF_GEDALYAH:
			case JewishCalendar.TENTH_OF_TEVES:
				addToSiddurHighlighted(
					"שִׁ֖יר מִזְמ֣וֹר לְאָסָֽף׃ אֱלֹהִ֥ים אַל־דֳּמִי־לָ֑ךְ אַל־תֶּחֱרַ֖שׁ וְאַל־תִּשְׁקֹ֣ט אֵֽל׃ כִּֽי־הִנֵּ֣ה א֭וֹיְבֶיךָ יֶהֱמָי֑וּן וּ֝מְשַׂנְאֶ֗יךָ נָ֣שְׂאוּ רֹֽאשׁ׃ עַֽל־עַ֭מְּךָ יַעֲרִ֣ימוּ ס֑וֹד וְ֝יִתְיָעֲצ֗וּ עַל־צְפוּנֶֽיךָ׃ אָמְר֗וּ לְ֭כוּ וְנַכְחִידֵ֣ם מִגּ֑וֹי וְלֹֽא־יִזָּכֵ֖ר שֵֽׁם־יִשְׂרָאֵ֣ל עֽוֹד׃ כִּ֤י נוֹעֲצ֣וּ לֵ֣ב יַחְדָּ֑ו עָ֝לֶ֗יךָ בְּרִ֣ית יִכְרֹֽתוּ׃ אׇהֳלֵ֣י אֱ֭דוֹם וְיִשְׁמְעֵאלִ֗ים מוֹאָ֥ב וְהַגְרִֽים׃ גְּבָ֣ל וְ֭עַמּוֹן וַעֲמָלֵ֑ק פְּ֝לֶ֗שֶׁת עִם־יֹ֥שְׁבֵי צֽוֹר׃ גַּם־אַ֭שּׁוּר נִלְוָ֣ה עִמָּ֑ם הָ֤יֽוּ זְר֖וֹעַ לִבְנֵי־ל֣וֹט סֶֽלָה׃ עֲשֵֽׂה־לָהֶ֥ם כְּמִדְיָ֑ן כְּֽסִיסְרָ֥א כְ֝יָבִ֗ין בְּנַ֣חַל קִישֽׁוֹן׃ נִשְׁמְד֥וּ בְֽעֵין־דֹּ֑אר הָ֥יוּ דֹּ֗֝מֶן לָאֲדָמָֽה׃ שִׁיתֵ֣מוֹ נְ֭דִיבֵימוֹ כְּעֹרֵ֣ב וְכִזְאֵ֑ב וּֽכְזֶ֥בַח וּ֝כְצַלְמֻנָּ֗ע כׇּל־נְסִיכֵֽימוֹ׃ אֲשֶׁ֣ר אָ֭מְרוּ נִ֣ירְשָׁה לָּ֑נוּ אֵ֗֝ת נְא֣וֹת אֱלֹהִֽים׃ אֱֽלֹהַ֗י שִׁיתֵ֥מוֹ כַגַּלְגַּ֑ל כְּ֝קַ֗שׁ לִפְנֵי־רֽוּחַ׃ כְּאֵ֥שׁ תִּבְעַר־יָ֑עַר וּ֝כְלֶהָבָ֗ה תְּלַהֵ֥ט הָרִֽים׃ כֵּ֭ן תִּרְדְּפֵ֣ם בְּסַעֲרֶ֑ךָ וּבְסוּפָתְךָ֥ תְבַהֲלֵֽם׃ מַלֵּ֣א פְנֵיהֶ֣ם קָל֑וֹן וִיבַקְשׁ֖וּ שִׁמְךָ֣ יְהֹוָֽה׃ יֵבֹ֖שׁוּ וְיִבָּהֲל֥וּ עֲדֵי־עַ֗ד וְֽיַחְפְּר֥וּ וְיֹאבֵֽדוּ׃ וְֽיֵדְע֗וּ כִּֽי־אַתָּ֬ה שִׁמְךָ֣ יְהֹוָ֣ה לְבַדֶּ֑ךָ עֶ֝לְי֗וֹן עַל־כׇּל־הָאָֽרֶץ׃");
				break;
			case JewishCalendar.CHANUKAH:
				if (!jewishDateInfo.getJewishCalendar().isRoshChodesh()) {
					addToSiddurHighlighted(
						"מִזְמ֡וֹר שִׁיר־חֲנֻכַּ֖ת הַבַּ֣יִת לְדָוִֽד׃ אֲרוֹמִמְךָ֣ יְ֭הֹוָה כִּ֣י דִלִּיתָ֑נִי וְלֹֽא־שִׂמַּ֖חְתָּ אֹיְבַ֣י לִֽי׃ יְהֹוָ֥ה אֱלֹהָ֑י שִׁוַּ֥עְתִּי אֵ֝לֶ֗יךָ וַתִּרְפָּאֵֽנִי׃ יְֽהֹוָ֗ה הֶעֱלִ֣יתָ מִן־שְׁא֣וֹל נַפְשִׁ֑י חִ֝יִּיתַ֗נִי מִיׇּֽרְדִי־בֽוֹר׃ זַמְּר֣וּ לַיהֹוָ֣ה חֲסִידָ֑יו וְ֝הוֹד֗וּ לְזֵ֣כֶר קׇדְשֽׁוֹ׃ כִּ֤י רֶ֨גַע ׀ בְּאַפּוֹ֮ חַיִּ֢ים בִּרְצ֫וֹנ֥וֹבָּ֭עֶרֶב יָלִ֥ין בֶּ֗כִי וְלַבֹּ֥קֶר רִנָּֽה׃ וַ֭אֲנִי אָמַ֣רְתִּי בְשַׁלְוִ֑י בַּל־אֶמּ֥וֹט לְעוֹלָֽם׃ יְֽהֹוָ֗ה בִּרְצוֹנְךָ֮ הֶעֱמַ֢דְתָּה לְֽהַרְרִ֫י עֹ֥ז הִסְתַּ֥רְתָּ פָנֶ֗יךָ הָיִ֥יתִי נִבְהָֽל׃ אֵלֶ֣יךָ יְהֹוָ֣ה אֶקְרָ֑א וְאֶל־אֲ֝דֹנָ֗י אֶתְחַנָּֽן׃ מַה־בֶּ֥צַע בְּדָמִי֮ בְּרִדְתִּ֢י אֶ֫ל שָׁ֥חַת הֲיוֹדְךָ֥ עָפָ֑ר הֲיַגִּ֥יד אֲמִתֶּֽךָ׃ שְׁמַע־יְהֹוָ֥ה וְחׇנֵּ֑נִי יְ֝הֹוָ֗ה הֱֽיֵה־עֹזֵ֥ר לִֽי׃ הָפַ֣כְתָּ מִסְפְּדִי֮ לְמָח֢וֹל לִ֥י פִּתַּ֥חְתָּ שַׂקִּ֑י וַֽתְּאַזְּרֵ֥נִי שִׂמְחָֽה׃ לְמַ֤עַן ׀ יְזַמֶּרְךָ֣ כָ֭בוֹד וְלֹ֣א יִדֹּ֑ם (יפסיק מעט/break) יְהֹוָ֥ה אֱ֝לֹהַ֗י לְעוֹלָ֥ם אוֹדֶֽךָּ׃");
				}
				break;
			case JewishCalendar.PURIM:
			case JewishCalendar.FAST_OF_ESTHER:
				addToSiddurHighlighted(
					"לַ֭מְנַצֵּחַ עַל־אַיֶּ֥לֶת הַשַּׁ֗חַר מִזְמ֥וֹר לְדָוִֽד׃ אֵלִ֣י אֵ֭לִי לָמָ֣ה עֲזַבְתָּ֑נִי רָח֥וֹק מִֽ֝ישׁוּעָתִ֗י דִּבְרֵ֥י שַׁאֲגָתִֽי׃ אֱֽלֹהַ֗י אֶקְרָ֣א י֭וֹמָם וְלֹ֣א תַעֲנֶ֑ה וְ֝לַ֗יְלָה וְֽלֹא־דֻֽמִיָּ֥ה לִֽי׃ וְאַתָּ֥ה קָד֑וֹשׁ י֝וֹשֵׁ֗ב תְּהִלּ֥וֹת יִשְׂרָאֵֽל׃ בְּ֭ךָ בָּטְח֣וּ אֲבֹתֵ֑ינוּ בָּ֝טְח֗וּ וַֽתְּפַלְּטֵֽמוֹ׃ אֵלֶ֣יךָ זָעֲק֣וּ וְנִמְלָ֑טוּ בְּךָ֖ בָטְח֣וּ וְלֹא־בֽוֹשׁוּ׃ וְאָנֹכִ֣י תוֹלַ֣עַת וְלֹא־אִ֑ישׁ חֶרְפַּ֥ת אָ֝דָ֗ם וּבְז֥וּי עָֽם׃ כׇּל־רֹ֭אַי יַלְעִ֣גוּ לִ֑י יַפְטִ֥ירוּ בְ֝שָׂפָ֗ה יָנִ֥יעוּ רֹֽאשׁ׃ גֹּ֣ל אֶל־יְהֹוָ֣ה יְפַלְּטֵ֑הוּ יַ֝צִּילֵ֗הוּ כִּ֘י חָ֥פֵֽץ בּֽוֹ׃ כִּֽי־אַתָּ֣ה גֹחִ֣י מִבָּ֑טֶן מַ֝בְטִיחִ֗י עַל־שְׁדֵ֥י אִמִּֽי׃ עָ֭לֶיךָ הׇשְׁלַ֣כְתִּי מֵרָ֑חֶם מִבֶּ֥טֶן אִ֝מִּ֗י אֵ֣לִי אָֽתָּה׃ אַל־תִּרְחַ֣ק מִ֭מֶּנִּי כִּי־צָרָ֣ה קְרוֹבָ֑ה כִּי־אֵ֥ין עוֹזֵֽר׃ סְ֭בָבוּנִי פָּרִ֣ים רַבִּ֑ים אַבִּירֵ֖י בָשָׁ֣ן כִּתְּרֽוּנִי׃ פָּצ֣וּ עָלַ֣י פִּיהֶ֑ם אַ֝רְיֵ֗ה טֹרֵ֥ף וְשֹׁאֵֽג׃ כַּמַּ֥יִם נִשְׁפַּכְתִּי֮ וְהִתְפָּֽרְד֗וּ כׇּֽל־עַצְמ֫וֹתָ֥י הָיָ֣ה לִ֭בִּי כַּדּוֹנָ֑ג נָ֝מֵ֗ס בְּת֣וֹךְ מֵעָֽי׃ יָ֘בֵ֤שׁ כַּחֶ֨רֶשׂ ׀ כֹּחִ֗י וּ֭לְשׁוֹנִי מֻדְבָּ֣ק מַלְקוֹחָ֑י וְֽלַעֲפַר־מָ֥וֶת תִּשְׁפְּתֵֽנִי׃ כִּ֥י סְבָב֗וּנִי כְּלָ֫בִ֥ים עֲדַ֣ת מְ֭רֵעִים הִקִּיפ֑וּנִי כָּ֝אֲרִ֗י יָדַ֥י וְרַגְלָֽי׃ אֲסַפֵּ֥ר כׇּל־עַצְמוֹתָ֑י הֵ֥מָּה יַ֝בִּ֗יטוּ יִרְאוּ־בִֽי׃ יְחַלְּק֣וּ בְגָדַ֣י לָהֶ֑ם וְעַל־לְ֝בוּשִׁ֗י יַפִּ֥ילוּ גוֹרָֽל׃ וְאַתָּ֣ה יְ֭הֹוָה אַל־תִּרְחָ֑ק אֱ֝יָלוּתִ֗י לְעֶזְרָ֥תִי חֽוּשָׁה׃ הַצִּ֣ילָה מֵחֶ֣רֶב נַפְשִׁ֑י מִיַּד־כֶּ֝֗לֶב יְחִידָתִֽי׃ ה֭וֹשִׁיעֵנִי מִפִּ֣י אַרְיֵ֑ה וּמִקַּרְנֵ֖י רֵמִ֣ים עֲנִיתָֽנִי׃ אֲסַפְּרָ֣ה שִׁמְךָ֣ לְאֶחָ֑י בְּת֖וֹךְ קָהָ֣ל אֲהַלְלֶֽךָּ׃ יִרְאֵ֤י יְהֹוָ֨ה ׀ הַֽלְל֗וּהוּ כׇּל־זֶ֣רַע יַעֲקֹ֣ב כַּבְּד֑וּהוּ וְג֥וּרוּ מִ֝מֶּ֗נּוּ כׇּל־זֶ֥רַע יִשְׂרָאֵֽל׃ כִּ֤י לֹֽא־בָזָ֨ה וְלֹ֪א שִׁקַּ֡ץ עֱנ֬וּת עָנִ֗י וְלֹא־הִסְתִּ֣יר פָּנָ֣יו מִמֶּ֑נּוּ וּֽבְשַׁוְּע֖וֹ אֵלָ֣יו שָׁמֵֽעַ׃ מֵ֥אִתְּךָ֗ תְּֽהִלָּ֫תִ֥י בְּקָהָ֥ל רָ֑ב נְדָרַ֥י אֲ֝שַׁלֵּ֗ם נֶ֣גֶד יְרֵאָֽיו׃ יֹאכְל֬וּ עֲנָוִ֨ים ׀ וְיִשְׂבָּ֗עוּ יְהַֽלְל֣וּ יְ֭הֹוָה דֹּ֣רְשָׁ֑יו יְחִ֖י לְבַבְכֶ֣ם לָעַֽד׃ יִזְכְּר֤וּ ׀ וְיָשֻׁ֣בוּ אֶל־יְ֭הֹוָה כׇּל־אַפְסֵי־אָ֑רֶץ וְיִֽשְׁתַּחֲו֥וּ לְ֝פָנֶ֗יךָ כׇּֽל־מִשְׁפְּח֥וֹת גּוֹיִֽם׃ כִּ֣י לַ֭יהֹוָה הַמְּלוּכָ֑ה וּ֝מֹשֵׁ֗ל בַּגּוֹיִֽם׃ אָכְל֬וּ וַיִּֽשְׁתַּחֲו֨וּ ׀ כׇּֽל־דִּשְׁנֵי־אֶ֗רֶץ לְפָנָ֣יו יִ֭כְרְעוּ כׇּל־יוֹרְדֵ֣י עָפָ֑ר וְ֝נַפְשׁ֗וֹ לֹ֣א חִיָּֽה׃ זֶ֥רַע יַֽעַבְדֶ֑נּוּ יְסֻפַּ֖ר לַֽאדֹנָ֣י לַדּֽוֹר׃ יָ֭בֹאוּ וְיַגִּ֣ידוּ צִדְקָת֑וֹ לְעַ֥ם נ֝וֹלָ֗ד כִּ֣י עָשָֽׂה׃");
				break;
			case JewishCalendar.SEVENTEEN_OF_TAMMUZ:
				addToSiddurHighlighted(
					"מִזְמ֗וֹר לְאָ֫סָ֥ף אֱֽלֹהִ֡ים בָּ֤אוּ גוֹיִ֨ם ׀ בְּֽנַחֲלָתֶ֗ךָ טִ֭מְּאוּ אֶת־הֵיכַ֣ל קׇדְשֶׁ֑ךָ שָׂ֖מוּ אֶת־יְרוּשָׁלַיִם לְעִיִּֽים׃ נָתְנ֡וּ אֶת־נִבְלַ֬ת עֲבָדֶ֗יךָ מַ֭אֲכָל לְע֣וֹף הַשָּׁמָ֑יִם בְּשַׂ֥ר חֲ֝סִידֶ֗יךָ לְחַיְתוֹ־אָֽרֶץ׃ שָׁפְכ֬וּ דָמָ֨ם ׀ כַּמַּ֗יִם סְֽבִ֘יב֤וֹת יְרוּשָׁלַיִם וְאֵ֣ין קוֹבֵֽר׃ הָיִ֣ינוּ חֶ֭רְפָּה לִשְׁכֵנֵ֑ינוּ לַ֥עַג וָ֝קֶ֗לֶס לִסְבִיבוֹתֵֽינוּ׃ עַד־מָ֣ה יְ֭הֹוָה תֶּאֱנַ֣ף לָנֶ֑צַח תִּבְעַ֥ר כְּמוֹ־אֵ֗֝שׁ קִנְאָתֶֽךָ׃ שְׁפֹ֤ךְ חֲמָתְךָ֗ אֶֽל־הַגּוֹיִם֮ אֲשֶׁ֢ר לֹא־יְדָ֫ע֥וּךָ וְעַ֥ל מַמְלָכ֑וֹת אֲשֶׁ֥ר בְּ֝שִׁמְךָ֗ לֹ֣א קָרָֽאוּ׃ כִּ֭י אָכַ֣ל אֶֽת־יַעֲקֹ֑ב וְֽאֶת־נָוֵ֥הוּ הֵשַֽׁמּוּ׃ אַֽל־תִּזְכׇּר־לָנוּ֮ עֲוֺנֹ֢ת רִאשֹׁ֫נִ֥ים מַ֭הֵר יְקַדְּמ֣וּנוּ רַחֲמֶ֑יךָ כִּ֖י דַלּ֣וֹנוּ מְאֹֽד׃ עׇזְרֵ֤נוּ ׀ אֱלֹ֘הֵ֤י יִשְׁעֵ֗נוּ עַֽל־דְּבַ֥ר כְּבֽוֹד־שְׁמֶ֑ךָ וְהַצִּילֵ֥נוּ וְכַפֵּ֥ר עַל־חַ֝טֹּאתֵ֗ינוּ לְמַ֣עַן שְׁמֶֽךָ׃ לָ֤מָּה ׀ יֹאמְר֣וּ הַגּוֹיִם֮ אַיֵּ֢ה אֱֽלֹהֵ֫יהֶ֥ם יִוָּדַ֣ע בַּגֹּיִ֣ים לְעֵינֵ֑ינוּ נִ֝קְמַ֗ת דַּֽם־עֲבָדֶ֥יךָ הַשָּׁפֽוּךְ׃ תָּ֤ב֣וֹא לְפָנֶיךָ֮ אֶנְקַ֢ת אָ֫סִ֥יר כְּגֹ֥דֶל זְרוֹעֲךָ֑ ה֝וֹתֵ֗ר בְּנֵ֣י תְמוּתָֽה׃ וְהָ֘שֵׁ֤ב לִשְׁכֵנֵ֣ינוּ שִׁ֭בְעָתַיִם אֶל־חֵיקָ֑ם חֶרְפָּ֘תָ֤ם אֲשֶׁ֖ר חֵרְפ֣וּךָ אֲדֹנָֽי׃ וַאֲנַ֤חְנוּ עַמְּךָ֨ ׀ וְצֹ֥אן מַרְעִיתֶךָ֮ נ֤וֹדֶ֥ה לְּךָ֗ לְע֫וֹלָ֥ם לְד֥וֹר וָדֹ֑ר נְ֝סַפֵּ֗ר תְּהִלָּתֶֽךָ׃");
				break;
		}

		if (jewishDateInfo.getJewishCalendar().getYomTovIndex() == JewishCalendar.EREV_YOM_KIPPUR) {
			addToSiddurHighlighted(
				"לַמְנַצֵּ֬חַ ׀ לִבְנֵי־קֹ֬רַח מִזְמֽוֹר׃ רָצִ֣יתָ יְהֹוָ֣ה אַרְצֶ֑ךָ שַׁ֝֗בְתָּ שְׁבִ֣ית יַעֲקֹֽב׃ נָ֭שָׂאתָ עֲוֺ֣ן עַמֶּ֑ךָ כִּסִּ֖יתָ כׇל־חַטָּאתָ֣ם סֶֽלָה׃ אָסַ֥פְתָּ כׇל־עֶבְרָתֶ֑ךָ הֱ֝שִׁיב֗וֹתָ מֵחֲר֥וֹן אַפֶּֽךָ׃ שׁ֭וּבֵנוּ אֱלֹהֵ֣י יִשְׁעֵ֑נוּ וְהָפֵ֖ר כַּעַסְךָ֣ עִמָּֽנוּ׃ הַלְעוֹלָ֥ם תֶּאֱנַף־בָּ֑נוּ תִּמְשֹׁ֥ךְ אַ֝פְּךָ֗ לְדֹ֣ר וָדֹֽר׃ הֲֽלֹא־אַ֭תָּה תָּשׁ֣וּב תְּחַיֵּ֑נוּ וְ֝עַמְּךָ֗ יִשְׂמְחוּ־בָֽךְ׃ הַרְאֵ֣נוּ יְהֹוָ֣ה חַסְדֶּ֑ךָ וְ֝יֶשְׁעֲךָ֗ תִּתֶּן־לָֽנוּ׃ אֶשְׁמְעָ֗ה מַה־יְדַבֵּר֮ הָאֵ֢ל ׀ יְהֹ֫וָ֥ה כִּ֤י ׀ יְדַבֵּ֬ר שָׁל֗וֹם אֶל־עַמּ֥וֹ וְאֶל־חֲסִידָ֑יו וְאַל־יָשׁ֥וּבוּ לְכִסְלָֽה׃ אַ֤ךְ קָר֣וֹב לִירֵאָ֣יו יִשְׁע֑וֹ לִשְׁכֹּ֖ן כָּב֣וֹד בְּאַרְצֵֽנוּ׃ חֶסֶד־וֶאֱמֶ֥ת נִפְגָּ֑שׁוּ צֶ֖דֶק וְשָׁל֣וֹם נָשָֽׁקוּ׃ אֱ֭מֶת מֵאֶ֣רֶץ תִּצְמָ֑ח וְ֝צֶ֗דֶק מִשָּׁמַ֥יִם נִשְׁקָֽף׃ גַּם־יְ֭הֹוָה יִתֵּ֣ן הַטּ֑וֹב וְ֝אַרְצֵ֗נוּ תִּתֵּ֥ן יְבוּלָֽהּ׃ צֶ֭דֶק לְפָנָ֣יו יְהַלֵּ֑ךְ וְיָשֵׂ֖ם לְדֶ֣רֶךְ פְּעָמָֽיו׃");
		}

		addInfoToSiddur(
			"בבית האבל אומרים  (We add in a mourner's house)",
			"\n\nלַמְנַצֵּ֬חַ ׀ לִבְנֵי־קֹ֬רַח מִזְמֽוֹר׃ שִׁמְעוּ־זֹ֭את כׇּל־הָעַמִּ֑ים הַ֝אֲזִ֗ינוּ כׇּל־יֹ֥שְׁבֵי חָֽלֶד׃ גַּם־בְּנֵ֣י אָ֭דָם גַּם־בְּנֵי־אִ֑ישׁ יַ֗֝חַד עָשִׁ֥יר וְאֶבְיֽוֹן׃ פִּ֭י יְדַבֵּ֣ר חׇכְמ֑וֹת וְהָג֖וּת לִבִּ֣י תְבוּנֽוֹת׃ אַטֶּ֣ה לְמָשָׁ֣ל אׇזְנִ֑י אֶפְתַּ֥ח בְּ֝כִנּ֗וֹר חִידָתִֽי׃ לָ֣מָּה אִ֭ירָא בִּ֣ימֵי רָ֑ע עֲוֺ֖ן עֲקֵבַ֣י יְסוּבֵּֽנִי׃ הַבֹּטְחִ֥ים עַל־חֵילָ֑ם וּבְרֹ֥ב עׇ֝שְׁרָ֗ם יִתְהַלָּֽלוּ׃ אָ֗ח לֹא־פָדֹ֣ה יִפְדֶּ֣ה אִ֑ישׁ לֹא־יִתֵּ֖ן לֵאלֹהִ֣ים כׇּפְרֽוֹ׃ וְ֭יֵקַר פִּדְי֥וֹן נַפְשָׁ֗ם וְחָדַ֥ל לְעוֹלָֽם׃ וִיחִי־ע֥וֹד לָנֶ֑צַח לֹ֖א יִרְאֶ֣ה הַשָּֽׁחַת׃ כִּ֤י יִרְאֶ֨ה ׀  חֲכָ֘מִ֤ים יָמ֗וּתוּ יַ֤חַד כְּסִ֣יל וָבַ֣עַר יֹאבֵ֑דוּ וְעָזְב֖וּ לַאֲחֵרִ֣ים חֵילָֽם׃ קִרְבָּ֤ם בָּתֵּ֨ימוֹ ׀ לְֽעוֹלָ֗ם מִ֭שְׁכְּנֹתָם לְד֣וֹר וָדֹ֑ר קָרְא֥וּ בִ֝שְׁמוֹתָ֗ם עֲלֵ֣י אֲדָמֽוֹת׃ וְאָדָ֣ם בִּ֭יקָר בַּל־יָלִ֑ין נִמְשַׁ֖ל כַּבְּהֵמ֣וֹת נִדְמֽוּ׃ זֶ֣ה דַ֭רְכָּם כֵּ֣סֶל לָ֑מוֹ וְאַחֲרֵיהֶ֓ם ׀ בְּפִיהֶ֖ם יִרְצ֣וּ סֶֽלָה׃ כַּצֹּ֤אן ׀ לִ֥שְׁא֣וֹל שַׁתּוּ֮ מָ֤וֶת יִ֫רְעֵ֥ם וַיִּרְדּ֘וּ בָ֤ם יְשָׁרִ֨ים ׀ לַבֹּ֗קֶר וצירם וְ֭צוּרָם לְבַלּ֥וֹת שְׁא֗וֹל מִזְּבֻ֥ל לֽוֹ׃ אַךְ־אֱלֹהִ֗ים יִפְדֶּ֣ה נַ֭פְשִׁי מִֽיַּד־שְׁא֑וֹל כִּ֖י יִקָּחֵ֣נִי סֶֽלָה׃ אַל־תִּ֭ירָא כִּֽי־יַעֲשִׁ֣ר אִ֑ישׁ כִּי־יִ֝רְבֶּ֗ה כְּב֣וֹד בֵּיתֽוֹ׃ כִּ֤י לֹ֣א בְ֭מוֹתוֹ יִקַּ֣ח הַכֹּ֑ל לֹֽא־יֵרֵ֖ד אַחֲרָ֣יו כְּבוֹדֽוֹ׃ כִּֽי־נַ֭פְשׁוֹ בְּחַיָּ֣יו יְבָרֵ֑ךְ וְ֝יוֹדֻ֗ךָ כִּי־תֵיטִ֥יב לָֽךְ׃ תָּ֭בוֹא עַד־דּ֣וֹר אֲבוֹתָ֑יו עַד־נֵ֗֝צַח לֹ֣א יִרְאוּ־אֽוֹר׃ אָדָ֣ם בִּ֭יקָר וְלֹ֣א יָבִ֑ין נִמְשַׁ֖ל כַּבְּהֵמ֣וֹת נִדְמֽוּ׃");

		addToSiddur(
			"הוֹשִׁיעֵ֨נוּ ׀ יְהֹ֘וָ֤ה אֱלֹהֵ֗ינוּ וְקַבְּצֵנוּ֮ מִֽן־הַגּ֫וֹיִ֥ם לְ֭הֹדוֹת לְשֵׁ֣ם קׇדְשֶׁ֑ךָ לְ֝הִשְׁתַּבֵּ֗חַ בִּתְהִלָּתֶֽךָ: בָּ֤רֽוּךְ יְהֹוָ֨ה אֱלֹהֵ֪י יִשְׂרָאֵ֡ל מִן־הָ֤עוֹלָ֨ם ׀ וְעַ֬ד הָעוֹלָ֗ם וְאָמַ֖ר כׇּל־הָעָ֥ם אָמֵ֗ן הַֽלְלוּיָֽהּ: בָּ֘ר֤וּךְ יְהֹוָ֨ה ׀ מִצִּיּ֗וֹן שֹׁ֘כֵ֤ן יְֽרוּשָׁלִָ֗ם הַֽלְלוּיָֽהּ: בָּר֤וּךְ ׀ יְהֹוָ֣ה אֱ֭לֹהִים אֱלֹהֵ֣י יִשְׂרָאֵ֑ל עֹשֵׂ֖ה נִפְלָא֣וֹת לְבַדּֽוֹ׃ וּבָר֤וּךְ ׀ שֵׁ֥ם כְּבוֹד֗וֹ לְע֫וֹלָ֥ם וְיִמָּלֵ֣א כְ֭בוֹדוֹ אֶת־כֹּ֥ל הָאָ֗רֶץ אָ֘מֵ֥ן ׀ וְאָמֵֽן:");

		if (jewishDateInfo.getJewishCalendar().isRoshChodesh()
		|| jewishDateInfo.getJewishCalendar().isCholHamoed()) {
			addToSiddur(
				"מחזירים ספר התורה למקומו ואומרים (The sefer torah is returned here)\n\n" +
				"יְהַלְל֤וּ ׀ אֶת־שֵׁ֬ם יְהֹוָ֗ה כִּֽי־נִשְׂגָּ֣ב שְׁמ֣וֹ לְבַדּ֑וֹ ה֝וֹד֗וֹ עַל־אֶ֥רֶץ וְשָׁמָֽיִם׃ וַיָּ֤רֶם קֶ֨רֶן ׀ לְעַמּ֡וֹ תְּהִלָּ֤ה לְֽכׇל־חֲסִידָ֗יו לִבְנֵ֣י יִ֭שְׂרָאֵל עַ֥ם קְרֹב֗וֹ הַֽלְלוּיָֽהּ׃ יְהֹוָה הוּא הָאֱלֹהִים, יְהֹוָה֙ ה֣וּא הָֽאֱלֹהִ֔ים בַּשָּׁמַ֣יִם מִמַּ֔עַל וְעַל־הָאָ֖רֶץ מִתָּ֑חַת אֵ֖ין עֽוֹד: אֵין־כָּמ֖וֹךָ בָאֱלֹהִ֥ים ׀ אֲדֹנָ֗י וְאֵ֣ין כְּֽמַעֲשֶֽׂיךָ׃ הֲשִׁיבֵ֨נוּ יְהֹוָ֤ה ׀ אֵלֶ֙יךָ֙ וְֽנָשׁ֔וּבָה חַדֵּ֥שׁ יָמֵ֖ינוּ כְּקֶֽדֶם׃");

			if (!jewishDateInfo.getJewishCalendar().isRoshChodesh()) {
				addToSiddur(
					"שׁוּבָה לִמְעוֹנָךְ וּשְׁכוֹן בְּבֵית מַאֲוָיָךְ, כִּי כָל־פֶּה וְכָל־לָשׁוֹן יִתְּנוּ הוֹד וְהָדָר לְמַלְכוּתָךְ: וּבְנֻחֹ֖ה יֹאמַ֑ר שׁוּבָ֣ה יְהֹוָ֔ה רִֽבְב֖וֹת אַלְפֵ֥י יִשְׂרָאל׃ השׁיבֵ֨נוּ יְהֹוָ֤ה ׀ אֵלֶ֙יךָ֙ וְֽנָשׁ֔ובָה חַדֵּ֥שׁ יָמֵ֖ינוּ כְּקֶֽדֶם׃");
			}

			addHalfKaddish(false);

			if (Utils.isLocaleHebrew()) {
				if (jewishDateInfo.getJewishCalendar().isRoshChodesh()) {
					addToSiddur("הסרת תפילין כאן");
				}
				addToSiddurHighlighted("מוסף אומרים כאן, לחץ כאן כדי להמשיך למוסף");
			} else {
				if (jewishDateInfo.getJewishCalendar().isRoshChodesh()) {
					addToSiddur("Remove your tefilin here");
				}
				addToSiddurHighlighted("Mussaf is said here, press here to go to Mussaf");
			}
			return siddur;
		}
		addKaddishYeheShelama();

		addToSiddur(
			"קַוֵּ֗ה אֶל־יְהֹ֫וָ֥ה חֲ֭זַק וְיַאֲמֵ֣ץ לִבֶּ֑ךָ וְ֝קַוֵּ֗ה אֶל־יְהֹוָֽה: אֵין־קָד֥וֹשׁ כַּיהֹוָ֖ה כִּ֣י אֵ֣ין בִּלְתֶּ֑ךָ וְאֵ֥ין צ֖וּר כֵּאלֹהֵֽינוּ׃ כִּ֤י מִ֣י אֱ֭לוֹהַּ מִבַּלְעֲדֵ֣י יְהֹוָ֑ה וּמִ֥י צ֝֗וּר זוּלָתִ֥י אֱלֹהֵֽינוּ׃ \n\n" +
			"אֵין כֵּאלֹהֵֽינוּ, אֵין כַּאדוֹנֵֽנוּ, אֵין כְּמַלְכֵּֽנוּ, אֵין כְּמוֹשִׁיעֵֽנוּ: מִי כֵּאלֹהֵֽינוּ, מִי כַּאדוֹנֵֽנוּ, מִי כְּמַלְכֵּֽנוּ, מִי כְּמוֹשִׁיעֵֽנוּ: נוֹדֶה לֵאלֹהֵֽינוּ, נוֹדֶה לַאדוֹנֵֽנוּ, נוֹדֶה לְמַלְכֵּֽנוּ, נוֹדֶה לְמוֹשִׁיעֵֽנוּ: בָּרוּךְ אֱלֹהֵֽינוּ, בָּרוּךְ אֲדוֹנֵֽנוּ, בָּרוּךְ מַלְכֵּֽנוּ, בָּרוּךְ מוֹשִׁיעֵֽנוּ: אַתָּה הוּא אֱלֹהֵֽינוּ, אַתָּה הוּא אֲדוֹנֵֽנוּ, אַתָּה הוּא מַלְכֵּֽנוּ, אַתָּה הוּא מוֹשִׁיעֵֽנוּ: אַתָּה תוֹשִׁיעֵֽנוּ, אַתָּ֣ה תָ֭קוּם תְּרַחֵ֣ם צִיּ֑וֹן כִּי־עֵ֥ת לְ֝חֶֽנְנָ֗הּ כִּי־בָ֥א מוֹעֵֽד:");

		addPitumHaketoret();

		addToSiddur(
			"תָּנָא דְבֵי אֵלִיָּהוּ, כָּל־הַשּׁוֹנֶה הֲלָכוֹת בְּכָל־יוֹם, מֻבְטָח לוֹ שֶׁהוּא בֶן־הָעוֹלָם הַבָּא, שֶׁנֶּאֱמַר הֲלִיכ֥וֹת עוֹלָ֖ם לֽוֹ׃ אַל־תִּקְרֵי הֲלִיכוֹת, אֶלָּא הֲלָכוֹת. אָמַר רִבִּי אֶלְעָזָר אָמַר רִבִּי חֲנִינָא תַּלְמִידֵי חֲכָמִים מַרְבִּים שָׁלוֹם בָּעוֹלָם, שֶׁנֶּאֱמַר וְכׇל־בָּנַ֖יִךְ לִמּוּדֵ֣י יְהֹוָ֑ה וְרַ֖ב שְׁל֥וֹם בָּנָֽיִךְ׃ אַל־תִּקְרֵי בָנָֽיִךְ אֶלָּא בוֹנָֽיִךְ: יְהִי־שָׁל֥וֹם בְּחֵילֵ֑ךְ שַׁ֝לְוָ֗ה בְּאַרְמְנוֹתָֽיִךְ׃ לְ֭מַעַן אַחַ֣י וְרֵעָ֑י אֲדַבְּרָה־נָּ֖א שָׁל֣וֹם בָּֽךְ׃ לְ֭מַעַן בֵּית־יְהֹוָ֣ה אֱלֹהֵ֑ינוּ אֲבַקְשָׁ֖ה ט֣וֹב לָֽךְ׃ וּרְאֵֽה־בָנִ֥ים לְבָנֶ֑יךָ שָׁ֝ל֗וֹם עַל־יִשְׂרָאֵֽל׃ שָׁל֣וֹם רָ֭ב לְאֹהֲבֵ֣י תוֹרָתֶ֑ךָ וְאֵֽין־לָ֥מוֹ מִכְשֽׁוֹל׃ יְֽהֹוָ֗ה עֹ֭ז לְעַמּ֣וֹ יִתֵּ֑ן יְהֹוָ֓ה ׀ יְבָרֵ֖ךְ אֶת־עַמּ֣וֹ בַשָּׁלֽוֹם׃ \n\n" +
			"ואומרים קדיש \"על ישראל\" (And we say Kaddish Al Yisrael)");
		addKaddishAlYisrael();
		addBarchu(true);
		addAlenu();

		if (jewishDateInfo.getJewishCalendar().isTishaBav()) {
			addCategoryToSiddur("קינות");
			addToSiddurHighlighted(
				"כולם חולצים את התפילין, והקהל יושב על הקרקע ומתחילים בקינות (Everyone removes their Tefilin, sits on the floor, and starts) \n" +
				"לְמִי אֶבְכֶּה וְכַף אַכֶּה וּבִבְכִי אֲמָרֵר וַהֲמוֹן מֵעַי אֲשַׁנֵּן: הֲלְמִקְדָּשׁ וְאָרוֹן אוֹ כְרוּבִים אֲשֶׁר עוֹרְבִים וְקִפּוֹד שָׁם יְקַנֵּן: וְעַל דּוּכָן אֲשֶׁר הוּכַן לְלֵוִי לְנַצֵּחַ בְּשִׁיר לָאֵל וְרַנֵּן: אֱהִי מַשְׁמִים עֲלֵי אוּרִים וְתֻמִּים אֲשֶׁר שָׁם כֹּהֲנֵי מִשְׁמָר יְכוֹנֵן: וְעַל הֶרֶג חֲכָמִים בֵּית אֱלֹהִים וּבָא קוֹסֵם קְסָמִים גַּם מְעוֹנֵן: וְאֵיכָה חָשְׁכָה אוֹר הַהֲלָכָה וְהַתַּלְמוּד כְּמוֹ גַלְמוּד מִי יְבוֹנֵן: וְסוֹד תּוֹרָה הֲיֵשׁ מוֹצִיא לְאוֹרָה וּמִי הוּא זֶה עֲלֵי הַדּוֹר יְגוֹנֵן: חֲלָלִים נָפְלוּ עוֹלְלִים וְיוֹנְקִים וְאֵין מֵקִים וְאֵין חוֹמֵל וְחוֹנֵן: לְזֹאת כָּל יוֹם וְכָל לַיִל אֲיֵילִיל בְּרוֹב חֶבֶל כְּמוֹ אָבֵל וְאוֹנֵן: וּמַר אֶסְפּוֹד וְאָח אֶקְרָא לְקִפּוֹד וּמִדְּמָעַי עֲפַר צִיּוֹן אֲחוֹנֵן: וְאֶחְדַּל מִשְּׁמוֹעַ קוֹל מְרַנֵּן וְאֵיכָה יָשְׁבָה בָדָד אֲקוֹנֵן:");

			addEicha();
			addToSiddur(
				"וָאָֽרֶץ שָׁפַל רוּמִי וְנִקְלָה כְבוֹדִי. לְעָפָר שָֽׁחָה נַפְשִׁי, וְקָֽצְרָה יָדִי. מִדֵּי זָכְרִי יְגוֹנַי. הוֹמִים גַּלֵּי נַפְשִׁי, וְקוֹדְחִים שְׁבִיבֵי יְקוֹדִי. הֲלָעַד יֶחֱשַׂף צִלִּי, וְיֵצַר צַֽעֲדִי? וְאַתָּה יְהֹוָה מָגֵן בַּעֲדִי: בַּעֲדִי רַבָּה שַׂר צָבָא וּמִלְחָמָה קִדֵּשׁ. יִפְעַת הוֹדִי חִלֵּל, כִּתֵּת וְהִדֵּשׁ. הֲלֹא בְּיוֹם זֶה אֶקְרָא צוֹם וַֽעֲצָרָה אֲקַדֵּשׁ בַּחֹֽדֶשׁ הַֽחֲמִישִׁי בְּתִשְׁעָה לַחֹֽדֶשׁ: \n\n" +
				"בַּחֹֽדֶשׁ הַֽחֲמִישִׁי אָנוּ וְאָֽבְלוּ פִּתְחֵי מְעוֹנַי. בְּתִשְׁעָה לַחֹֽדֶשׁ אָֽפְלוּ וְכָהוּ עֵינַי. בְּמַזַּל אַרְיֵה אֲרִי נֹהֵם, וְצָלְלוּ אָזְנָי, יוֹם וַיִּקְרָ֖א אַרְיֵ֑ה עַל־מִצְפֶּ֣ה ׀ אֲדֹנָ֗י: (יְהֹוָה אַל תִּקְצֹף עַד מְאֹד לְהַכְנִיעִי, וְאַל לָעַד תִּזְכּוֹר עָוֹן לְהַרְשִׁיעִי. אֱזוֹן נָא מִזְּבוּלֶךָ לְקוֹל שַׁוְעִי, מָגִנִּי וְקֶֽרֶן יִשְׁעִי:) \n\n" +
				"יָרַֽדְתִּי לְתַחְתִּיּוֹת, וְאָבַד נִצְחִי. סָֽרָה צְפִירַת תִּפְאַרְתִּי וְצִיצַת מִצְחִי. פָּקוּ מוֹרֵי פְּלִילִיָּה, וְעִבְּטוּ אָרְחִי. בָּחַֽלְתִּי נְאֻם סַלְעִי, וְנֶֽאֱסַף בְּחֶטְאִי יַרְחִי. חֻקֵּי זְמִרוֹת קְנוּיוֹת הֲסִירֽוֹתִי מִנִּכְחִי, וּלְכָל בָּהֵן חַיֵּי רוּחִי: רוּחִי חֻבָּֽלָה, יָמַי נִזְעָֽכוּ בְּרֹב כַּחְשִׁי. זַלְעָפָה אֲחָזַֽתְנִי, וְנִלְכַּֽדְתִּי בְמוֹקְשִׁי. נְהִי וּמִסְפֵּד אֲעוֹרֵר, וְקִינִים תֶּהְגֶּה נַפְשִׁי, מִדֵּי שָׁנָה בְשָׁנָה בַּחֹדֶשׁ הַחֲמִישִׁי: \n\n" +
				"בַּחֹֽדֶשׁ הַֽחֲמִישִׁי נֻתַּק אֵזוֹר כֹּחִי לְהַמְאִיכוֹ. בְּתִשְׁעָה לַחֹֽדֶשׁ נוֹתַֽרְתִּי כְּגֽוֹרֶן עֵת הִדְרִיכוֹ. בְּמַזַּל אַרְיֵה נֻגַּר עַמִּי סְחוֹב וְהַשְׁלִיכוֹ, יוֹם עָלָה אַרְיֵה מִסֻּבְּכוֹ: מִסֻּבְּכוֹ עָלָה וְהִשְׁקָֽנִי כּוֹס רַֽעַל. אֲכָלַֽנִי הֲמָמַֽנִי, וְאוֹתִי בְּמַסְגֵּר נָעַל: (נָא הַחֲיֵה רְדוּמֵֽינוּ בְּכוֹס תַּֽעַל, מֵמִית וּמְחַיֶּה מוֹרִיד שְׁאוֹל וַיַֽעַל:) \n\n" +
				"דּוֹק וְחוּג רָֽעֲשׁוּ, וַתִּשְׁכּוֹן עָלַי עֲנָנָה. וְכָל מְאוֹרֵי אוֹר קָֽדְרוּ, וְחַמָּה וּלְבָנָה. יוֹם רַבָּתִי בַגּוֹיִם הָֽיְתָה כְּאַלְמָנָה: וְדֻכְּאוּ לָאָרֶץ, וְאֻמְלָלוּ אַנְשֵׁי הָֽאֱמוּנָה. לָכֵן אֲקוֹנֵן בְּמָרָה, בְּכָל שָׁנָה וְשָׁנָה. מְלֵאֲתִי מִשְׁפָּט, אֵיכָה הָיְתָה לְזוֹנָה: יְפֵה נוֹף, מְשׂוֹשׂ כָּל הָאָֽרֶץ, עַם קִרְיַת חָנָה. הָיְתָה לְשַׁמָּה וְלִשְׁאִיָּה, וּלְמָשָׁל וְלִשְׁנִינָה. כָּל עַמָּהּ נֶֽאֱנָחִים, לֹא מָצְאוּ חֲנִינָה: דָּהֲמוּ גִבּוֹרֶֽיהָ מִפְּנֵי חֶֽרֶב הַיּוֹנָה. יָכִין וּבֽוֹעַז נֶעֱקָרוּ מִגּֽוֹרֶן אֲרַוְנָה. רָֽמְסוּ זָרִים, וְשָֽׁאֲגוּ בִּמְקוֹם הַשְּׁכִינָה:");
			addToSiddur(
				"שְׁכִינָה צוֹעֶֽקֶת בְּהָרֵֽעַ, שֽׁוּבוּ בָנִים חִדְלוּ הָרֵֽעַ. כִּי קָצַר הַמַּצָּע מֵֽהִשְׂתָּרֵֽעַ: יְהִירִים בְּהַכְנִיסָם צֶֽלֶם בִּמְעוֹנַי, יָֽצְאָה שְׁכִינָה מֵהֵיכָל לִפְנַי, וְנָֽאֲמָה אֵלְכָה וְאָשֽׁוּבָה לִמְכוֹנַי, עַד אֲשֶׁר יֶאְשְׁמוּ וּבִקְשׁוּ פָנַי: \n" +
				"וּמֵהֵיכַל עָֽלְתָה וְעַל הַכְּרוּב שָֽׁבָה, וְרָֽאֲתָה מִשְׁתַּֽחֲוִים לְכָל מַזָּל וְצָבָא, וְנָֽאֲמָה אֵלְכָה אֶל מְקוֹמִי וְאָשֽׁוּבָה, עַד אֲשֶׁר יֹֽאמְרוּ לְכוּ וְנָשֽׁוּבָה: עַד אֲשֶׁר יֶאְשְׁמוּ וּבִקְשׁוּ פָנָי: \n" +
				"סָרָה מִן הַכְּרוּב אֶל הַכְּרוּב הַשֵּׁנִי, וְרָֽאֲתָה פְנֵיהֶם לְשַּֽׁעַר הַקַּדְמוֹנִי, וְנָֽאֲמָה בַּמִּדְבָּר מִֽי יִתְּנֵֽנִי, עַד בַּצַּר לָהֶם יְשַֽׁחֲרֽוּנְנִי: \n" +
				"עַד אֲשֶׁר יֶאְשְׁמוּ וּבִקְשׁוּ פָנָי: \n" +
				"פָּֽנְתָה מִן הַכְּרוּב אֶל מִפְתַּן דּוּכָנַי, וְרָֽאֲתָה אֲחֹֽרֵיהֶם אֶל הֵיכַל יְהֹוָה, וְנָֽאֲמָה אֵלְכָה וְאֶֽעֱזְבָה לַֽהֲמוֹנָי, עַד אֲשֶׁר יְשֽׁוֹטְטוּ לְבַקֵּשׁ אֶת דְּבַר יְהֹוָה: עַד אֲשֶׁר יֶאְשְׁמוּ וּבִקְשׁוּ פָנָי: \n" +
				"הָֽלְכָה מִמִּפְתָּן לַֽחֲצַר הָֽעֲזָרָה, וְרָֽאֲתָה שֽׁוֹלְחִים אֶל אַפָּם הַזְּמוֹרָה, וְנָֽאֲמָה אֶת פָּנַי מֵהֶם אַסְתִּֽירָה, עַד אֲשֶׁר יֹאמְרוּ לָֽמָּה תִישָׁן עֽוּרָה: \n" +
				"עַד אֲשֶׁר יֶאְשְׁמוּ וּבִקְשׁוּ פָנָי: \n" +
				"עָֽלְתָה מֵהָֽעֲזָרָה אֶל הַגָּג בַּחֲרוֹנִים, וְרָֽאֲתָה אוֹתָם עוֹשִׂים כַּוָּנִים, עָֽזְבָה מְקוֹם קֹֽדֶשׁ וְנָֽאֲמָה בְּשִׁנּוּנִים, טוֹב שֶׁבֶת עַל פִּנַּת גַּג מֵאֵֽשֶׁת מְדָנִים:");
			addToSiddur(
				"בַּת צִיּוֹן שָׁמַֽעְתִּי מְמָרֶֽרֶת אֲמָרֶֽיהָ. אֲהָהּ כִּי כוֹס שָׁתִֽיתִי וּמָצִֽיתִי שְׁמָרֶֽיהָ. אֵלִי עֲדִינָה לַשְׁכִינָה אֲשֶׁר חָֽשְׁכוּ מְאוֹרֶֽיהָ. כִּבְתוּלָה חֲגֽוּרַת שַׂק עַל בַּֽעַל נְעוּרֶֽיהָ: יְיֵלִיל יַֽעַר לְבָנוֹן, אֲרָזֶֽיךָ אֵשׁ אָֽכְלָה. וְשַֽׁעַר צִיּוֹן יִסְפּוֹד, כִּי אֵל עָשָׂה כָלָה. וְתִתְפַּלֵּשׁ הָעֲזָרָה, כִּי שָֽׁבְתָה הָֽעוֹלָה. וְהַלִּשְׁכָּה תְּקוֹנֵן, כִּי אָֽפְסוּ סַנְהֶדְרֶֽיהָ: \n" +
				"אֵלִי עֲדִינָה לַשְּׁכִינָה אֲשֶׁר חָֽשְׁכוּ מְאוֹרֶֽיהָ. כִּבְתוּלָה חֲגֽוּרַת שַׂק עַל בַּֽעַל נְעוּרֶֽיהָ: \n" +
				"לִשְׁכַּת בִּירָה תִבְכֶּה אוֹי עַל זֶֽרַע אַֽהֲרֹן. וּבֵית קֹֽדֶשׁ הַקֳּדָשִׁים אוֹי עַל גְּנִיזַת אָרוֹן. וְהַפָּרֹֽכֶת תִּזְעַק אֵין לִמְקוֹמִי יִתְרוֹן. כִּי רָֽאֲתָה אַכְזָרִים גִּלּוּ אֶת סְתָרֶֽיהָ: \n" +
				"אֵלִי עֲדִינָה לַשְּׁכִינָה אֲשֶׁר חָֽשְׁכוּ מְאוֹרֶֽיהָ. כִּבְתוּלָה חֲגֽוּרַת שַׂק עַל בַּֽעַל נְעוּרֶֽיהָ: \n" +
				"וְהַמַּחְתָּה מְקוֹנֶֽנֶת אַיֵּה קְטֹֽרֶת סַמִּים? וְלֵב אַהֲרֹן יִקָּרַע עַל אוּרִים וְתֻּמִּים. וּמִזְבֵּֽחַ יִתְרַגֵּז עַל עוֹלוֹת וּשְׁלָמִים. מַדּוּעַ לֹא בְעִתָּהּ יָכִינוּ סוֹדְרֶֽיהָ? \n" +
				"אֵלִי עֲדִינָה לַשְּׁכִינָה אֲשֶׁר חָֽשְׁכוּ מְאוֹרֶֽיהָ. כִּבְתוּלָה חֲגֽוּרַת שַׂק עַל בַּֽעַל נְעוּרֶֽיהָ: \n" +
				"יְיֵלִיל כִּנּוֹר לְוִיִּם מִי יָעִיר נְגִינוֹתַי? וְתַֽעֲנֶה מְנוֹרָה טְהוֹרָה מִי יַֽעֲלֶה נֵֽרוֹתַי? וְהָאֹֽהֶל מִתְאוֹנֵן אֵין מֵקִים יְרִֽיעוֹתַי. וְהַתּוֹרָה תִּתְרַעֵם, כִּי חָֽדְלוּ שׁוֹחֲרֶֽיהָ: \n" +
				"אֵלִי עֲדִינָה לַשְּׁכִינָה אֲשֶׁר חָֽשְׁכוּ מְאוֹרֶֽיהָ. כִּבְתוּלָה חֲגֽוּרַת שַׂק עַל בַּֽעַל נְעוּרֶֽיהָ: \n" +
				"חוֹל יָחוּל הַשֻּׁלְחָן אֵי עוֹרְכֵי מַֽעֲרָכָה? וּכְהוּנָּה כֵּן תֶּהְגֶּה אֵיכָה שָֽׁבְתָה מְלָאכָה? וּבַת עַמִּי עַל כָּל זֹאת דִּמְעָתָהּ נִתָּכָה. כִּי לִפְנֵי צָרֶֽיהָ הָֽלְכוּ שְׁבִי שָׂרֶֽיהָ: \n" +
				"אֵלִי עֲדִינָה לַשְּׁכִינָה אֲשֶׁר חָֽשְׁכוּ מְאוֹרֶֽיהָ. כִּבְתוּלָה חֲגֽוּרַת שַׂק עַל בַּֽעַל נְעוּרֶֽיהָ:");
			addToSiddur(
				"דָּמְמוּ שְׂרָפִים מִזְּמָר. וְחַיּוֹת וְאוֹפַנִּים מִמִּשְׁמָר. יוֹם בּוֹ גְּזַר דִּין נֶחְתָּם וְנִגְמַר. מַלְאֲכֵי שָׁלוֹם יִבְכָּיוּן מַר: וְהַמְּאוֹרוֹת חָשְׁכוּ בְּצֵאתָם. וּצְבָא הַשָּׁמַיִם שַׂק הוּשַׁת כְּסוּתָם. וְהַחַיּוֹת נוֹהִים בִּבְכִיָתָם וְהָאוֹפַנִּים לְעֻמָּתָם: יוֹם יַד זָר בַּמִּקְדָּשׁ הִגְבִּיר. וְהִצִּית אֵשׁ בַּהֵיכָל וּבַדְּבִיר. שְׁתֵּי כְנָפַיִם מֵחַיּוֹת הֶעֱבִיר. וּבְמִסְתָּרִים קִינוֹת אַחְבִּיר:");
			addToSiddur(
				"בַּחֹֽדֶשׁ הַֽחֲמִישִׁי יָעֲצוּ הַתָּרִים לְהוֹצִיא דִבּוֹת. בְּתִשְׁעָה לַחֹֽדֶשׁ יְלָלָה הִשְׁמִֽיעוּ וְקוֹל בִּמְרִיבוֹת. בְּמַזַּל אַרְיֵה יָדַיִם רָפוּ וְלֹא מָֽצְאוּ תְשׁוּבוֹת. אָמַר עָצֵל שַֽׁחַל בַּדֶּֽרֶךְ, אֲרִי בֵּין הָֽרְחוֹבוֹת: הָֽרְחֹבוֹת מָֽלְאוּ הוֹ הוֹ וּמִסְפֵּד וִילֵיל. וְנֻפְּצוּ לַסֶּֽלַע יוֹנֵק וְעוֹלֵל. לָֽמָּה תִֽהְיֶה כְּאִישׁ נִדְהָם לַֽעֲדַת אֲרִיאֵל. וְאַתָּ֥ה קָד֑וֹשׁ י֝וֹשֵׁ֗ב תְּהִלּ֥וֹת יִשְׂרָאֵֽל: \n" +
				"בַּחֹֽדֶשׁ הַֽחֲמִישִׁי יָרוּ בְּכִלְיוֹתֵֽינוּ חֵץ בְּגַֽחַל. בְּתִשְׁעָה לַחֹֽדֶשׁ יָֽרְעָה נַפְשׁוֹתֵֽינוּ בְּבַֽחַל. בְּמַזַּל אַרְיֵה אֲרִי נוֹהֵם כְּנַֽהֲמַת יָם וְנַֽחַל. שַֽׁאֲגַת אַרְיֵה וְקוֹל שַֽׁחַל: שַֽׁחַל עָדָה וְשָׂם קוֹמָתִי מְגֻדַּֽעַת. אֲכָלַֽנִי הֲמָמַֽנִי וּכְרֵסוֹ מֵֽעֲדָנַי שׂוֹבַֽעַת. יָהּ הוֹדַע זְרוֹעֲךָ בְּגַֽאֲוָה מוֹדַֽעַת. הָאֵל הַֽמְלַמֵּד לְאָדָם דַּֽעַת: \n" +
				"בַּחֹֽדֶשׁ הַֽחֲמִישִׁי הוֹ הוֹ בְּכָל חוּצוֹת הֻקְרָא. בְּתִשְׁעָה לַחֹדֶשׁ הֲלֹא שֶֽׁבֶר עַל שֶֽׁבֶר נִקְרָא. בְּמַזַּל אַרְיֵה הֶגֶה וְקִנִים וָהִי וּמוֹרָא. אַרְיֵ֥ה שָׁאָ֖ג מִ֣י לֹ֣א יִירָ֑א:");
			addToSiddur(
				"מִזְמ֗וֹר לְאָ֫סָ֥ף אֱלֹהִ֡ים בָּ֤אוּ גוֹיִ֨ם | בְּֽנַֽחֲלָתֶ֗ךָ טִ֭מְּאוּ אֶת־הֵיכַ֣ל קָדְשֶׁ֑ךָ שָׂ֖מוּ אֶת־יְרֽוּשָׁלִַ֣ם לְעִיִּֽים: נָֽתְנ֡וּ אֶת־נִבְלַ֬ת עֲבָדֶ֗יךָ מַֽ֭אֲכָל לְע֣וֹף הַשָּׁמָ֑יִם בְּשַׂ֥ר חֲ֝סִידֶ֗יךָ לְחַיְתוֹ־אָֽרֶץ: שָֽׁפְכ֬וּ דָמָ֨ם | כַּמַּ֗יִם סְֽבִ֘יב֤וֹת יְ֝רֽוּשָׁלִַ֗ם וְאֵ֣ין קוֹבֵֽר: הָיִ֣ינוּ חֶ֭רְפָּה לִשְׁכֵנֵ֑ינוּ לַ֥עַג וָ֝קֶ֗לֶס לִסְבִֽיבוֹתֵֽינוּ: עַד־מָ֣ה יְ֭הֹוָה תֶּֽאֱנַ֣ף לָנֶ֑צַח תִּבְעַ֥ר כְּמוֹ־֝אֵ֗שׁ קִנְאָתֶֽךָ: שְׁפֹ֤ךְ חֲמָֽתְךָ֨ | אֶֽל־הַגּוֹיִם֮ אֲשֶׁ֪ר לֹא־יְדָ֫ע֥וּךָ וְעַ֥ל מַמְלָכ֑וֹת אֲשֶׁ֥ר בְּ֝שִׁמְךָ֗ לֹ֣א קָרָֽאוּ: כִּ֭י אָכַ֣ל אֶֽת־יַֽעֲקֹ֑ב וְאֶת־נָוֵ֥הוּ הֵשַֽׁמּוּ: אַֽל־תִּזְכָּר־לָנוּ֮ עֲוֹנֹ֪ת רִֽאשֹׁ֫נִ֥ים מַ֭הֵר יְקַדְּמ֣וּנוּ רַֽחֲמֶ֑יךָ כִּ֖י דַלּ֣וֹנוּ מְאֹֽד: עָזְרֵ֤נוּ | אֱלֹ֘הֵ֤י יִשְׁעֵ֗נוּ עַל־דְּבַ֥ר כְּבֽוֹד־שְׁמֶ֑ךָ וְהַצִּילֵ֭נוּ וְכַפֵּ֥ר עַל־חַ֝טֹּאתֵ֗ינוּ לְמַ֣עַן שְׁמֶֽךָ: לָ֤מָּה | יֹֽאמְר֣וּ הַגּוֹיִם֮ אַיֵּ֪ה אֱלֹֽהֵ֫יהֶ֥ם יִוָּדַ֣ע בַּגּוֹיִ֣ם לְעֵינֵ֑ינוּ נִ֝קְמַ֗ת דַּֽם־עֲבָדֶ֥יךָ הַשָּׁפֽוּךְ: תָּ֤ב֣וֹא לְפָנֶיךָ֮ אֶנְקַ֪ת אָ֫סִ֥יר כְּגֹ֣דֶל זְרֽוֹעֲךָ֑ ה֝וֹתֵ֗ר בְּנֵ֣י תְמוּתָֽה: וְהָ֘שֵׁ֤ב לִשְׁכֵנֵ֣ינוּ שִׁ֭בְעָתַיִם אֶל־חֵיקָ֑ם חֶרְפָּ֘תָ֤ם אֲשֶׁ֖ר חֵֽרְפ֣וּךָ אֲדֹנָֽי: וַֽאֲנַ֤חְנוּ עַמְּךָ֨ | וְצֹ֥אן מַרְעִיתֶךָ֮ נ֤וֹדֶ֥ה לְּךָ֗ לְע֫וֹלָ֥ם לְד֥וֹר וָדֹ֑ר נְ֝סַפֵּ֗ר תְּהִלָּתֶֽךָ:");
			addToSiddur(
				"עַד מָתַי יְהֹוָה, יוֹם זֶה לְעֻמָּתֶֽךָ, בְּמַר תְּיֵילִיל עֲדָתֶֽךָ, עַל בֵּית תְּפִלָּתֶֽךָ, אֲשֶׁר שָֽׂרְפוּ צָרֶֽיךָ, וְהָֽרְגוּ בְּנֵי בְרִיתֶֽךָ: \n" +
				"אֱלֹהִים בָּֽאוּ גוֹיִם בְּנַֽחֲלָתֶךָ: \n" +
				"עַד מָתַי יְהֹוָה, תִּשְׁכַּח שְׁאוֹן קָמֶֽיךָ, וְשִׁמְמוּת הֵיכָלֶֽךָ, וּנְפֻצוֹת לְאֻמֶּֽךָ, הַלְּחוּצִים עָלֶֽיךָ, הַֽהֲרוּגִים עַל שְׁמֶֽךָ? עַד מָתַי עָשַֽׁנְתָּ בִּתְפִלַּת עַמֶּֽךָ, אֲשֶׁר יֶהְגּוּ לְפָנֶֽיךָ עַל חָרְבַּן בֵּיתֶֽךָ? אֱלֹהִים בָּֽאוּ גוֹיִם בְּנַֽחֲלָתֶֽךָ: \n" +
				"עַד מָתַי יְהֹוָה, עָרִיצִים יָעֽוֹזּוּ, אֲשֶׁר אָכַל אֶת יַֽעֲקֹב, וּבְכָל עֵת יָבֽוֹזּוּ. אֲנִי אֶדְרוֹשׁ אֶת שְׁלוֹמָם, וְהֵם יִמְרְטוּ וְיָגֹֽזּוּ. בְּחֶרְפָּה הִכּוּ לְחָיַי, בְּשִׂפְתֵי שָׁוְא נָלֽוֹזוּ. עַד מָתַי יְהֹוָה רְשָׁעִים יַעֲלֹֽזוּ. עַד אָן יִצְעַק בַּשִּׁבְיָה עַבְדְּךָ בֶּן אֲמָתֶֽךָ: אֱלֹהִים בָּֽאוּ גוֹיִם בְּנַֽחֲלָתֶֽךָ: \n" +
				"עַד מָתַי יְהֹוָה, אֶשְׁכְּבָה בֵּין שְׁפָתַּֽיִם, וּבֵין תַּנּוּר וְכִירַֽיִם יִכְהוּ לִי עֵינַֽיִם? לוֹהֲטִים לִי יִשְׁאֲפוּ עֶֽרֶב וָבֹֽקֶר וְצָהֳרַֽיִם. עַד מָתַי אֶשְׁתּוֹמֵם עַל חָרְבַּן פַּעֲמַֽיִם? עַד מָתַי לֹא תְרַחֵם אֶת יְרֽוּשָׁלַֽיִם. עַד מָתַי יֶהְגֶּה בַצַּר שְׁאַר צֹאן מַרְעִיתֶֽךָ: אֱלֹהִים בָּֽאוּ גוֹיִם בְּנַֽחֲלָתֶֽךָ:");
			addToSiddur(
				"שְׂאִי קִינָה, בִּמְגִנָּה, בַּת צִיּוֹן וְנֽוּדִי. שְׁבִי דוּמָם, כִּי נִשְׁמָם, בֵּית מִקְדָּשִׁי וְהוֹדִי. וְכִי נִפְלַל, וְגַם צָלַל, הָאִיתוֹן וּטְדִי. \n" +
				"בָּרַח דּוֹדִי, וּבָא שׁוֹדְדִי, וְגַם גָּלָה כְבוֹדִי: \n" +
				"מִסְפֵּד מַר, בְּיוֹם הֵמַר, שַׁדַּי לִי אַגְדִּֽילָה. וְאֶחְגּוֹר שַׂק, בְּיוֹם נָשַׁק, שְׁבִיב אֵשׁ בְּבֵית הַתְּפִלָּה. וְכִי חֻלָּל, שֵׁם הֻלָּל, וְגַם לִשְׁכַּת הַגּוֹלָה. וְחָרַב מָחוֹז, הַמָּעוֹז, וְנִגְלָה בֵּית יְסוֹדִי: \n" +
				"בָּרַח דּוֹדִי, וּבָא שׁוֹדְדִי, וְגַם גָּלָה כְבוֹדִי: \n" +
				"וְאֵשׁ מַטָּה, לִי לִהֲטָה, בִּמְקוֹם אֵשׁ אוֹכֶֽלֶת. וְיוֹקֵד, בֵּית הַמּוֹקֵד, וְגַם אֶֽבֶן הַזֹּחֶֽלֶת. וְשָׁלַח אֵל, לְגַבְרִיאֵל, וְזָרַק אֵשׁ גַּחֶֽלֶת. אֵשׁ עַמִּים, הַזָּרִים, קוֹל נָֽתְנוּ בְּבֵית מוֹעֲדִי: בָּרַח דּוֹדִי, וּבָא שׁוֹדְדִי, וְגַם גָּלָה כְבוֹדִי: \n" +
				"אֵל קָרָא, בְּיוֹם עֶבְרָה, לְמִסְפֵּד בַּשָּׁמַֽיִם. וּמַלְאָכִים, בְּמַר בּוֹכִים, מְחֽוֹפְפִים בִּכְנָפַֽיִם. וּבָא אָב הֲמוֹן, לְבֵית אַרְמוֹן, וְיָדָיו עַל חֲלָצַֽיִם. וְאָמַר אֲהָהּ, וְעָנָה יָהּ, בְּמֶֽרֶר מֶה לִֽידִידִי: \n" +
				"בָּרַח דּוֹדִי, וּבָא שׁוֹדְדִי, וְגַם גָּלָה כְבוֹדִי: \n" +
				"לְמֶרְחַקִּים, וְעַד שְׁחָקִים, נִרְאֲתָה הַשַּׁלְהֶֽבֶת. וּבָה מִשְׁמָר, מוּל מִשְׁמָר, וְעָלוּ רוּם מַעֲזֶֽבֶת. וְלֹא נָסוּ, לָאֵשׁ קָֽפְצוּ, וְנִצְרְבוּ בָהּ צָרֶֽבֶת. מְתֵי כֹהֲנִים, וְהֵם שְׁמוֹנִים, אֶֽלֶף מְתֵי סוֹדִי: \n" +
				"בָּרַח דּוֹדִי, וּבָא שׁוֹדְדִי, וְגַם גָּלָה כְבוֹדִי: \n" +
				"וּבִי הֵעִיר, יַד שֵׂעִיר, בְּיוֹם זֶה עָלַי חַרְבּוֹ. וּבָא בִיתֵר, וְשָׁם בִּתֵּר, אַרְבַּע מֵאוֹת רִבּוֹא. וְקוֹל אִישׁ תָּם, בְּעַב נִסְתָּם, מִלִּפְנֵי אֵל לָבוֹא. הִכּֽוּנִי, פְּצָעֽוּנִי, וְגַם נָֽשְׂאוּ אֶת רְדִידִי: \n" +
				"בָּרַח דּוֹדִי, וּבָא שׁוֹדְדִי, וְגַם גָּלָה כְבוֹדִי: \n" +
				"וּבְיוֹם קְרָב, נָֽסוּ לְעָרָב, שְׁמוֹנִים אֶֽלֶף פְּרָחִים. שֽׁוֹקְקִים, לְמֵי מַשְׁקִים, וְהֶֽאֱכִילוּם מְלוּחִים. תָּלוּ עַֽיִן, אֱלֵי יַֽיִן, וְהֵמָּה נֹאדוֹת נְפוּחִים. וְאֵין מְנַחֵם, וְאֵין מְרַחֵם, וְאֵין מְקַבֵּץ לִנְדוּדִי: \n" +
				"בָּרַח דּוֹדִי, וּבָא שׁוֹדְדִי, וְגַם גָּלָה כְבוֹדִי:");
			addToSiddur(
				"גְּרוּשִׁים מִבֵּית תַּֽעֲנוּגֵיהֶם. עָֽיְפָה נַפְשִׁי מוּל הֲרוּגֵיהֶם. \n" +
				"לִבִּי לִבִּי עַל חַלְלֵיהֶם. מֵעַי מֵעַי עַל הֲרֽוּגֵיהֶם: \n" +
				"יוֹם צֵאת בְּתוּלוֹת מֵהֵֽיכָלֵיהֶן. וְאִמּוֹת שְׁכוּלוֹת מֵעֽוֹלְלֵיהֶן. עֲרוּמּוֹת שְׁלוּלוֹת בְּיַד שֽׁוֹלְלֵיהֶן. יוֹם הַצְּוָחָה רַבָּה עֲלֵיהֶן. יוֹם עוֹל נָֽשְׂאוּ בִּמְקוֹם חֲלֵיהֶן. שְׁבוּיוֹת חֶֽרֶב בְּיַד נֽוֹהֲגֵיהֶן: \n" +
				"לִבִּי לִבִּי עַל חַלְלֵיהֶם, מֵעַי מֵעַי עַל הֲרֽוּגֵיהֶם: \n" +
				"אֹֽזֶן תִּצַּל לְנַֽאֲקַת חָלָל. וְצַֽעֲקַת יוֹנֵק, וּבִכְיַת עוֹלָל. יוֹם אֲשֶׁר שֻׁפַּךְ דָּמָם כַּגָּלָל. וּבֵית הַתְּפִלָּה לָאָֽרֶץ חֻלָּל. וְסֵפֶר תּוֹרָה בְּדַם הִתְגּוֹלָל. וְהָיוּ לְשַׁמָּה פְּנֵי לוֹהֲגֵיהֶם: לִבִּי לִבִּי עַל חַלְלֵיהֶם, מֵעַי מֵעַי עַל הֲרֽוּגֵיהֶם: \n" +
				"יוֹם עוֹלְלַי לַסֶּֽלַע נֻפְּצוּ. וְנִפְזְרוּ שְׂרִידַי, וְלֹא נִתְקַבְּצוּ. וְעַם אֲשֶׁר שֵׁם אֱלֹהַי נִֽאֲצוּ. הֲדָרִי חִלְּלוּ, וְקָדְשִׁי שִׁקְּצוּ. יוֹם אֲשֶׁר כְּפִירִים אַֽחֲרַי רוֹצְצוּ. וְנָמַס לִבִּי לְקוֹל שֽׁוֹאֲגֵיהֶם: \n" +
				"לִבִּי לִבִּי עַל חַלְלֵיהֶם, מֵעַי מֵעַי עַל הֲרֽוּגֵיהֶם: \n" +
				"יְלָדִים אֲשֶׁר עֲלֵי תוֹלָע אֱמוּנִים. לְבוּשֵׁי שָׁנִים עִם כָּל עֲדָנִים. אֵיךְ נִדְחֲפוּ בֵּין מֽוֹכְרִים וְקוֹנִים. בִּידֵי אֲדוֹנִים לֹא רַֽחֲמָנִים. יוֹם בֹּא עֲלֵיהֶם הֲמוֹנִים הֲמוֹנִים. וְקַלּוּ כַּנֶּֽשֶׁר מַשִּֽׂיגֵיהֶם: \n" +
				"לִבִּי לִבִּי עַל חַלְלֵיהֶם, מֵעַי מֵעַי עַל הֲרֽוּגֵיהֶם: \n" +
				"קָהָל חֻבָּר כְּכוֹכְבֵי שָׁמַיְמָה. אֵיכָה נִפְזַר כְּחַרְשֵׂי אֲדָמָה. יָֽצְאוּ בַגּוֹלָה קֵֽדְמָה וְיָֽמָּה. אֵיכָה עָבַר בָּם חֶֽרֶב נְקָמָה. אֵיךְ הוּשָֽׂמָה גַּפְנָם לְשַׁמָּה. וְהִלְבִּֽינוּ שְׂרִֽיגֵיהֶם: לִבִּי לִבִּי עַל חַלְלֵיהֶם, מֵעַי מֵעַי עַל הֲרֽוּגֵיהֶם:");
			addToSiddur(
				"אֵיךְ נָוִי שֻׁדָּד. וְדוֹדִי עָף וְנָדַד. הָעִיר רַבָּתִי עָם, אֵיכָה יָֽשְׁבָה בָּדָד. בָּדָד כְּאַלְמָנָה. הָיְתָה נֶאֱמָנָה. \n" +
				"לָכֵן אֶשָּׂא קִינָה. בְּיוֹם זֶה בְּכָל שָׁנָה. אֶעֱשֶׂה מִסְפֵּד כַּתַּנִּים, וְאֵבֶל כִּבְנוֹת יַעֲנָה: \n" +
				"נוֹרָא בְּעֶבְרָתוֹ. בִּצַּע אֶמְרָתוֹ. בְּאֹהֶל בַּת צִיּוֹן שָׁפַךְ כָּאֵשׁ חֲמָתוֹ. חֲמָתוֹ מוּכָנָה. לַעֲדַת מִי מָנָה: \n" +
				"לָכֵן אֶשָּׂא קִינָה. בְּיוֹם זֶה בְּכָל שָׁנָה. אֶעֱשֶׂה מִסְפֵּד כַּתַּנִּים, וְאֵבֶל כִּבְנוֹת יַעֲנָה: \n" +
				"יוֹנְקִים אֶל שְׁדֵיהֶם. פָּעֲרוּ אֶת פִּיהֶם. עוֹלָלִים שָׁאֲלוּ לֶחֶם, פּוֹרֵשׂ אֵין לָהֶם. לָהֶם דַר מְעוֹנָה. לֹא נָתַן חֲנִינָה: \n" +
				"לָכֵן אֶשָּׂא קִינָה. בְּיוֹם זֶה בְּכָל שָׁנָה. אֶעֱשֶׂה מִסְפֵּד כַּתַּנִּים, וְאֵבֶל כִּבְנוֹת יַעֲנָה: \n" +
				"נִשְׂרַף הַהַרְאֵל. וּמִקְדָּשׁ וַאֲרִיאֵל. הָיָה אֲדֹנָי כְּאוֹיֵב בִּלַּע יִשְׂרָאֵל. יִשְׂרָאֵל שָׂנָא. עַמּוֹ אֲשֶׁר קָנָה: \n" +
				"לָכֵן אֶשָּׂא קִינָה. בְּיוֹם זֶה בְּכָל שָׁנָה. אֶעֱשֶׂה מִסְפֵּד כַּתַּנִּים, וְאֵבֶל כִּבְנוֹת יַעֲנָה: \n" +
				"דְּמָעַי אַזְרִימָה. וְקוֹל מַר אָרִימָה. מִיָּמִים יָמִימָה אָרִיד בְּשִׂיחִי וְאָהִימָה. אָהִימָה כְיוֹנָה. עַל פִּרְחֵי כְהוּנָה: \n" +
				"לָכֵן אֶשָּׂא קִינָה. בְּיוֹם זֶה בְּכָל שָׁנָה. אֶעֱשֶׂה מִסְפֵּד כַּתַּנִּים, וְאֵבֶל כִּבְנוֹת יַעֲנָה: \n" +
				"שָׂם לִי לַחֲרָדָה. אֶֽבֶן מוּסָדָה. הָרַס בְּעֶבְרָתוֹ מִבְצְרֵי בַת יְהוּדָה. יְהוּדָה בְכָל מְדִינָה. לְמָשָׁל וְלִשְׁנִינָה: \n" +
				"לָכֵן אֶשָּׂא קִינָה. בְּיוֹם זֶה בְּכָל שָׁנָה. אֶעֱשֶׂה מִסְפֵּד כַּתַּנִּים, וְאֵבֶל כִּבְנוֹת יַעֲנָה: \n" +
				"רוּחִי בִי חָלָה. בְּרֶֽתֶת וְחַלְחָלָה. וּבְכָל יוֹם וּבְכָל לַיְלָה. מֵעַי מֵעַי אוֹחִילָה. אוֹחִילָה בָּאֲנִינָה. בְּיָגוֹן וּמְגִינָה: \n" +
				"לָכֵן אֶשָּׂא קִינָה. בְּיוֹם זֶה בְּכָל שָׁנָה. אֶעֱשֶׂה מִסְפֵּד כַּתַּנִּים, וְאֵבֶל כִּבְנוֹת יַעֲנָה: \n" +
				"הֱצִיקוּנִי זָרִים. וְיַלְדֵי אַכְזָרִים. אָהֳלֵי יִשְׁמְעֵאלִים מוֹאָב וְהַגְרִים. הַגְרִים לִי עִנָּה. וְהִרְוָנִי לַעֲנָה: \n" +
				"לָכֵן אֶשָּׂא קִינָה. בְּיוֹם זֶה בְּכָל שָׁנָה. אֶעֱשֶׂה מִסְפֵּד כַּתַּנִּים, וְאֵבֶל כִּבְנוֹת יַעֲנָה:");
			addToSiddur(
				"אֲלֵיכֶם עֵדָה נֶאֱמָנָה. אֶשְׁאַל מִכֶּם טַעֲנָה. \n" +
				"מַה נִּשְׁתַּנָּה יוֹם זֶה מִכָּל הַשָּׁנָה: \n" +
				"מַדּוּעַ בְּיוֹם פֶּסַח מִתְפַּלְלִים בְּקוֹל עָרֵב. עַתָּה בַּעֲוֹנֹתֵינוּ קוֹל יְלָלָה כְּעֹרֵב. כִּי עִיר קֹדֶשׁ נִשְׁחָתָה בָּרְמָחִים וּבַחֶרֶב. אֵיכָה הָיְתָה כְּאַלְמָנָה. הָעִיר הַנֶּאֱמָנָה: מַה נִּשְׁתַּנָּה יוֹם זֶה מִכָּל הַשָּׁנָה: \n" +
				"מַדּוּעַ בְּיוֹם פֶּסַח כָּל יִשְׂרָאֵל שְׂמֵחִים. עַתָּה בַּעֲוֹנֹתֵינוּ אֲבֵלִים וְנֶאֱנָחִים. כִּי אֱמוּנִים עֲלֵי תוֹלָע הָרַג שַׂר טַבָּחִים. יוֹם מַר כְּלַעֲנָה הָיְתָה לְעֵדָה נֶאֱמָנָה: מַה נִּשְׁתַּנָּה יוֹם זֶה מִכָּל הַשָּׁנָה: \n" +
				"מַדּוּעַ בִּזְמַן קַדְמוֹן שִׁבְטֵי יְשׁוּרוּן שָׂרִים. עַתָּה בַּעֲוֹנֹתֵינוּ נְטוּשִׁים בְּיַד זָרִים. וּבְנֵי מוֹאָב וְהַגְרִים. לְהַשְׁמִיד וּלְהַחֲרִים. לוֹ נָזַמְתָּ בְּכָל שָׁנָה לְעַם קְטַנֵּי אֲמָנָה: מַה נִּשְׁתַּנָּה יוֹם זֶה מִכָּל הַשָּׁנָה: \n" +
				"מַדּוּעַ בִּזְמַן קַדְמוֹן הָיִינוּ רֹאשׁ לְאוּמִים. עַתָּה בַּעֲוֹנֹתֵינוּ תַּחַת כָּל הָעַמִּים. גְּרוּשִׁים וַעֲגוּמִים בְּיַד אַנְשֵׁי דָמִים. עַד מָתַי וְעַד אָנָה. רַבָּתַי עַם כְּאַלְמָנָה: מַה נִּשְׁתַּנָּה יוֹם זֶה מִכָּל הַשָּׁנָה:");
			addToSiddur(
				"אֵשׁ תּוּקַד בְּקִרְבִּי, בְּהַֽעֲלוֹתִי עַל לְבָבִי. בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"וְקִינוֹת אָעִֽירָה, יַעַן כִּי אַזְכִּֽירָה. בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"אָז יָֽשִׁיר מֹשֶׁה, שִׁיר לֹא יִנָּשֶׁה, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"וַיְקוֹנֵן יִרְמְיָה, וְנָהָה נְהִי נִֽהְיָה, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"בֵּיתִי הִתְכּוֹנָן, וְשָׁכַן הֶֽעָנָן, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"וַחֲמַת אֵל שָֽׁכְנָה, עָלַי כַּֽעֲנָנָה, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"גַּלֵּי יָם הָמוּ, וְכַֽחוֹמָה קָֽמוּ, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"מַֽיִם שָׁטְפוּ, עֲלֵי רֹאשִׁי צָֽפוּ, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"דָּגָן מִשָּׁמַֽיִם, וְצוּר יָזוּב מַֽיִם, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"לַֽעֲנָה וְתַמְרוּרִים, וּמַֽיִם הַמָּרִים, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"הַשְׁכֵּם וְהַֽעֲרֵב, סְבִיבוֹת הַר חוֹרֵב, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"קָרָא אֶל אֵֽבֶל, עַל נַֽהֲרוֹת בָּבֶל, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"וּמַרְאֵה כְּבוֹד אֲדֹנָי, כְּאֵשׁ אוֹכֶֽלֶת לְפָנַי, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"וְחֶֽרֶב לְטוּשָׁה, לַטֶּֽבַח נְטוּשָׁה, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"זֶֽבַח וּמִנְחָה, וְשֶֽׁמֶן הַמִּשְׁחָה, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"סְגֻלָּה לְקוּחָה, כַּצֹּאן לְטִבְחָה, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"חַגִּים וְשַׁבָּתוֹת, וּמוֹפְתִים וְאוֹתוֹת, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"תַּֽעֲנִית וְאֵֽבֶל, וּרְדוֹף הַהֶֽבֶל, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"טוֹבוּ אוֹהָלִים, לְאַרְבַּע הַדְּגָלִים, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"אָֽהֳלֵי יִשְׁמְעֵאלִים, וּמַֽחֲנוֹת הַזָּרִים, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"יוֹבֵל וּשְׁמִטָּה, וְאֶֽרֶץ שֽׁוֹקֵטָה, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"מָכוֹר לִצְמִיתוּת, וְכָרוֹת לִכְרִיתוּת, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"כַּפֹּֽרֶת וְאָרוֹן, וְאַבְנֵי זִכָּרוֹן, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"וְאַבְנֵי הַקָּלַע, וּכְלֵי הַבָּלַע, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"לְוִיִּם וְכֹהֲנִים, וְשִׁבְעִים זְקֵנִים, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"נֽוֹגְשִׂים וּמוֹנִים, וּמֽוֹכְרִים וְקוֹנִים, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"מֹשֶׁה יַרְעֵֽנִי, אַהֲרֹן יַנְחֵֽנִי, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"וּנְבוּכַדְנֶצַּר, וְאַדְרִיאָנוֹס קֵיסַר, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"נַעֲרוֹךְ מִלְחָמָה, וַיהֹוָה שָֽׁמָּה, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"רָחַק מִמֶּֽנּוּ, וְהִנֵּה אֵינֶֽנּוּ, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"סִתְרֵי פָרֹֽכֶת, וְסִדְרֵי מַעֲרֶֽכֶת, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"וְחֵמָה נִתֶּֽכֶת, עָלַי סוֹכֶֽכֶת. בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"עוֹלוֹת וּזְבָחִים, וְאִשֵּׁי נִיחוֹחִים, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"בַּחֶֽרֶב מְדֻקָּרִים, בְּנֵי צִיּוֹן הַיְקָרִים, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"פַּֽאֲרֵי מִגְבָּעוֹת, לְכָבוֹד נִקְבָּעוֹת, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"שְׁרִיקוֹת וּתְרוּעוֹת, לְקָלוֹן וּזְוָעוֹת, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"צִיצַת הַזָּהָב, וְהֶמְשֵׁל וָרַֽהַב, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"אָפֵס הָעֵֽזֶר, וְהֻשְׁלַךְ הַנֶּֽזֶר, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"קְדֻשָּׁה וּנְבוּאָה, וּשְׁכִינָה נֽוֹרָאָה, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"מְגוֹאֲלָה וּמוֹרָאָה, וְרֽוּחַ הַטֻּמְאָה, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"רִנָּה וִישׁוּעָה, וַֽחֲצֽוֹצְרוֹת תְּרוּעָה, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"וְזַֽעֲקַת עוֹלָל, עִם נַֽאֲקַת חָלָל, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"שֻׁלְחָן וּמְנוֹרָה, וְכָלִיל וּקְטוֹרָה, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"וֶֽאֱלִיל וְתֽוֹעֵבָה, וּפֶֽסֶל וּמַצֵּבָה, בְּצֵאתִי מִירֽוּשָׁלַֽיִם: \n" +
				"תּוֹרָה וּתְעוּדָה, וְסֵֽדֶר הָֽעֲבוֹדָה, בְּצֵאתִי מִמִּצְרַֽיִם: \n" +
				"וְחֶסְרוֹן הַתַּלְמִיד, וּבִטּוּל הַתָּמִיד, בְּצֵאתִי מִירֽוּשָׁלַֽיִם:");
			addToSiddur(
				"בַּת עַמִּי תְּיֵילִיל בִּיגוֹנֶיהָ. עַל חַנָּה וְעַל שִׁבְעָה בָּנֶיהָ. כִּי נִשְׁחֲטוּ שִׁבְעָתָם אֶל עֵינֶיהָ. וְהִיא נָפְלָה וּמֵתָה עַל בָּנֶיהָ: \n" +
				"וְהִיא נָפְלָה וּמֵתָה עַל בָּנֶיהָ: \n" +
				"נִמְשְׁכוּ עָזוֹב הָאֵל וְלַעֲבוֹד בֵּל. וְהֵעִידוּ יִחוּד לַמֵּכִין תֵּבֵל. אֵיךְ עֻזַּב לְאַכְזָר נַחֲלַת חֶבֶל. וְדִמְעוֹת אֵם יוֹרְדוֹת עַל פָּנֶיהָ: \n" +
				"וְהִיא נָפְלָה וּמֵתָה עַל בָּנֶיהָ: \n" +
				"לָרִאשׁוֹן פָּתַח זָר הָאַכְזָר. אִם תֹּאבֶה וְהִשְׁתַּחֲוִיתָ לְאֵל זָר. אֲכַבֶּדְךָ וּבִמְלוּכָה תְּהִי נֶעְזָר. אֵיךְ אֶעֱזוֹב אֵל בִּגְבוּרָה נֶאֱזָר. בְּסַּיִף הֻתָּז רֹאשׁוֹ וְנִגְזָר. נְשָׁקַתְהוּ אִמּוֹ בִּשְׁאוֹנֶיהָ: וְהִיא נָפְלָה וּמֵתָה עַל בָּנֶיהָ: \n" +
				"וְלַשֵּׁנִי פִּיֵּס בְּרוּחַ אוֹנוֹ. סְגוֹד לְפִסְלִי. כִּי עָצְמָה יַד יְמִינוֹ. לֹא אֶעֱבוֹד כִּי אִם לְיָחִיד הַשּׁוֹכֵן בִּמְעוֹנוֹ. אֲשֶׁר פָּדָה סְגוּלָּה מִמּוֹנֶיהָ: \n" +
				"וְהִיא נָפְלָה וּמֵתָה עַל בָּנֶיהָ: \n" +
				"וְלַצָּעִיר נָאַם קַח אֶת טַבַּעְתִּי. וְאַל תִּבְזֶה וְתַקֵּן אֶת תַּקָּנָתִי. וְאַל יֹאמְרוּ סְגָנַי כִּי הָפְרַעְתִּי. וְלַשֶּׁקֶר שְׁבוּעָתִי נִשְׁבַּעְתִּי. הֱשִׁיבוֹ לֹא בִלְשׁוֹנִי אֶעֱנֶהָ: וְהִיא נָפְלָה וּמֵתָה עַל בָּנֶיהָ: \n" +
				"קוֹל נִשְׁמַע צֹוֵח בִּמְעוֹנָה. אַשְׁרֵיכֶם שִׁבְעַתְכֶם נִינֵי חַנָּה. נַחֲלַתְכֶם בְּגַן עֵדֶן מוּכָנָה. כִּי עֲבַדְתֶּם אֱלֹהֵיכֶם בֶּאֱמוּנָה. \n" +
				"וְאֵם שְׂמֵחָה בְּעֵדֶן עִם נִינֶיהָ:");
			addToSiddur(
				"אֵיךְ נָוִי חַטָּאתִי הִשְׁמִימָה. וְדִמְעָתִי עַל לְחָיָי אַזְרִימָה. וּבְיוֹם זֶה נְהִי נִהְיָה אָרִימָה. וְאָהִימָה מִיָּמִים יָמִימָה: \n" +
				"אֲבֵל לֵב וְנִחוּם חָדַל חָדוֹל. וּמִכָּל כְּאֵב צִירִי נִבְדַּל בָּדוֹל. עַל בֵּן וּבַת רִבִּי יִשְׁמָעֵאל כֹּהֵן גָּדוֹל. לְזָכְרִי זֹאת יְקוֹד בְּלִבִּי אָשִׂימָה: וְאָהִימָה מִיָּמִים יָמִימָה: \n" +
				"עֵת נִשְׁבּוּ וְנָפְלוּ לִשְׁנֵי אֲדוֹנִים. וְהֵם שְׁכֵנִים זֶה לְעֻמַּת זֶה חוֹנִים. וַיְסַפְּרוּ זֶה לָזֶה עִנְיָנִים. חַד אָמַר מִשִּׁבְיַת צִיּוֹנִים. שָׁבִיתִי שִׁפְחָה לְבוּשָׁה שָׁנִים. כַּלְּבָנָה בְּזִיו וּקְלַסְתַּר פָּנִים. וּבְתוֹאַר כִּקְצִיעָה וִימִימָה: וְאָהִימָה מִיָּמִים יָמִימָה: \n" +
				"וְרֵעֵהוּ בְּעִנְיָן זֶה פִּי שְׁנַיִם. בְּעַד עַבְדּוֹ סִפֵּר לוֹ כִּפְלַיִם. גַּם אֲנִי בָאתִי מִשְּׁבִי יְרוּשָׁלַיִם. שָׁבִיתִי עֶבֶד עִם יְפֵה עֵינַיִם. כַּשֶּׁמֶשׁ בְּתָקְפּוֹ עֵת צָהֳרַיִם. בֹּא וּנְזַוְּגֵם וּנְחַלְּקֵם בִּנְתַּיִם. הַוְּלָדוֹת כְּכוֹכְבֵי שָׁמַיִם. לְשֵׁמַע אֹזֶן תִּצַּלְנָה אָזְנַיִם. בְּזָכְרִי זֹאת אֶת מַדָּי אַפְרִימָה: \n" +
				"וְאָהִימָה מִיָּמִים יָמִימָה: \n" +
				"כְּשֶׁהִסְכִּימוּ עַל זֹאת שְׁנֵיהֶם יַחַד. וְלָעֶרֶב זִוְּגוּם בְּחֶדֶר אֶחָד. וְהָאֲדוֹנִים בַּחוּץ מְרַנְּנִים יַחַד. וְהֵם בִּפְנִים מְקוֹנְנִים בְּפַחַת וָפַחַד. וּבְתוּגָה וַאֲנִינָה וּבִרְעִימָה: וְאָהִימָה מִיָּמִים יָמִימָה: \n" +
				"זֶה יִסְפּוֹד בִּיקוֹד לֵבָב יִמְסֶה. נִין אַהֲרֹן אֵיךְ לְשִׁפְחָה יִנָּשֵׂא. וְהִיא גַם הִיא תְּיֵלִיל בְּתִגְרַת שׁוֹסֶה. בַּת יוֹכֶבֶד אֵיךְ לְעֶבֶד תִּנָּשֵׂא. בְּיִשְׂרָאֵל כָּזֹאת לֹא תֵּעָשֶׂה. עַד בֹּקֶר בִּכְיָתָם לֹא הִדְמִימָה: \n" +
				"וְאָהִימָה מִיָּמִים יָמִימָה: \n" +
				"בְּהַצְפִּירוֹ זֶה אֶת זֶה הִכִּירוּ. אוֹי אָחִי וְאוֹי אָחוֹת הִגְבִּירוּ. נִתְחַבְּקוּ שְׁנֵיהֶם עֵת הִזְכִּירוּ. עַד יָצְאָה נִשְׁמָתָם בְּאֵימָה וּבְתוּגָה וּבִנְהִימָה. עַל אֵלֶּה יִבְכּוּ עָשׁ כְּסִיל וְכִימָה: וְאָהִימָה מִיָּמִים יָמִימָה:");
			addToSiddur(
				"יְהוּדָה וְיִשְׂרָאֵל. דְּעוּ מַר לִי מְאֹד. לָכֵן בְּחַטֹּאתַי. אֲנִי אֶרְעַד רְעוֹד: יִהְיֶה לְבָבִי בִי. בְּעֵת אֶשְׁמַע בְּכוֹת. וְעֵת שְׂחוֹק אֶרְאֶה. אֲזַי אֶסְלוֹד סְלוֹד: בֶּן אָח וְאָחוֹת אֵם. וְאַף גַּם כָּל שְׁאֵר. תִּבְכּוּ לְמִשְׁפָּחוֹת. וְגָדְדוּ בָם גְּדוֹד: דּוֹד טוֹב וְכָל אִישִׁים. וְגַם נָשִׁים בְּכוּ. וַאֲנִי בְּבִכְיָתִי. אֲזַי אַחֲרִיד חָרוֹד: חָֽסְרָה נְגִֽינָתִי. וְשִׂמְחָתִי בְּעוֹד. אֶזְכּוֹר לְמִקְדָּשׁ כִּי. אֲבַדְנֽוּהוּ אָבוֹד: חָֽסְרָה קְהִלַּת אֵל. וְלֽוֹמְדֵי דַת וָדִין. עַל זֹאת יְהוּדָה קוּם. וְיִשְׂרָאֵל סְפוֹד: חָֽסְרָה וְגַם קָצְרָה. יְחִֽידָתִי לְרוֹב. אַבְדָן קְהִלּוֹתַי. וְנִשְׁמְדוּ שָׁמוֹד: חָֽסְרָה יְדִֽיעָתִי. בְּקוֹרוֹת הַזְּמַן. אֶמְאַס לְקוֹל שִׁירִים. וּמָחוֹל גַּם רְקוֹד: חָֽסְרָה עֲצַת לוֹמְדִים. לְתוּשִׁיָּה וְצַר. הָרַג בְּחִֽירֵיהֶם. כְּמוֹ צֹאן וַעֲרוֹד: חָֽסְרָה חֲנִינַת אֵל. וְרַֽחֲמָיו נִשְׁכְּחוּ. הוּא לִי כְּמוֹ אַכְזָר. וְהֵמַר לִי מְאֹד: חָֽסְרָה זְכוּת אָבוֹת. וְלֹא תָלִיץ בְּעַד. זַרְעָם וְסַף גִּזְעָם. וְנֶחֶרְדוּ חֲרוֹד: חָֽסְרָה צְנִיעוּת כָּל. נְשֵׁי יַהְרוּת בְּיוֹם. נָֽפְלוּ בְיַד זָרִים. וְקָֽפְדוּ בָם קְפוֹד: חָֽסְרָה נֶֽחָמַת כָּל. יְהוּדָה כִּי יְאוּשׁ. צָמַח בְּלִבּוֹתָם. וְנֶעֱקַד בָּם עָקוֹד: חָֽסְרָה פְּקֻדַּת אֵל. עֲלֵי הֽוֹרְגִים בְּנֵי. עַמִּי וְגַם גּֽוֹזְלִים. וְחֽוֹשְׁדִים בָּם חֲשׁוֹד: חָֽסְרָה אֱמֶת תּוֹרָה. וְהַמִּצְוָה אֲשֶׁר. עִם רוֹב גְּאוֹן זָרִים. שְׁכוּחָה מִלְּמוֹד: חָֽסְרָה מְתִיקוּת. מִבְּנֵי עַמִּי וְלֹא. חָֽסְרָה מְרִֽירוּתָם. וְתִשְׁקוֹד בָּם שְׁקוֹד: חָֽסְרָה עֲרֵבוּתָם. וְטֽוֹבָתָם וְכָל. חָכְמַת חֲכָמֵיהֶם. וְנֶֽחֶלְדָה חֲלוֹד: חָֽסְרָה תְּשׁוּבַת אֵל. לְצַֽעֲקָתָם וְאֵין. עוֹנֶה וְאֵין חוֹמֵל. וְנִלְאָה מִפְּקוֹד: חָֽסְרָה שְׁכִינָה. מִשְּׁכוֹן מַטָּה בְּתוֹךְ. מִקְדָּשׁ וְיִשְׂרָאֵל. וְחָֽדְלָה מִן רְבוֹד: חָֽסְרָה עֲנוֹת קַדִּישׁ. וַעֲנוֹת בָּֽרְכוּ. בָּתֵּי כְנֵסִיּוֹת. חֲרֵבִים מִיְּסוֹד: חָֽסְרָה זְכִירַת צוּר. יְהֹוָה צְבָאוֹת. יָהּ וֵאלֹהִים אֵל. וְשִׁין דָּלֶת וְיוֹד: חָֽסְרָה נְבוּאָה בִּי. וְנִסְתָּם כָּל חָזוֹן. אוּרִים וְגַם תֻּמִּים. וְצִרוּף שֵׁם בְּסוֹד: חָֽסְרָה הֲגוֹת תּוֹרָה. יְלָדִים עֵת גְּמוֹר. שַׂק אֶחְגּוֹר עַל זֹאת. וְאֶפְדֶנּוּ אָפוֹד: חָֽסְרָה כְּבוֹד שַׁבָּת. כְּבוֹד מוֹעֵד בְּכֵן. חֹֽשֶׁךְ וְקַדְרוּת קַח. יְצוּעֵךְ בּוֹ רְפוֹד: חָֽסְרָה עֲרֵבוּת קוֹל. חֲזָנִים מִזְּמוֹר. מַפְטִיר וּמֽוּצָנִיף. וְגַם פַּיְטַן לְחוֹד: חָֽסְרָה כְּבוֹד מַלְכוּת. יְהוּדָה עַד מְלוֹךְ. הָאִישׁ בְּנוֹ דָּוִד. יְחַיֶּה עַם בְּסוֹד:");
			addToSiddur(
				"עֵינִי עֵינִי יוֹרְדָה מַּֽיִם. עַל חָרְבַּן יְרוּשָׁלַֽיִם: עֵינִי עֵינִי יוֹרְדָה מַּֽיִם. עַל חָרְבַּן יְרוּשָׁלַֽיִם: \n" +
				"אֶבְכֶּה לֵילִי וְיוֹמִי. עַל חַלְלֵי בַּת עַמִּי. וְאֶשְׁפּוֹךְ נַפְשִׁי וְדָמִי. לְיוֹשֵׁב בַּשָּׁמַֽיִם: \n" +
				"עֵינִי עֵינִי יוֹרְדָה מַּֽיִם. עַל חָרְבַּן יְרוּשָׁלַֽיִם: \n" +
				"נֶהְפַּךְ כָּל שִׁירִי לָאֵֽבֶל. נִשְׁבַּר כָּל כִּנּוֹר וְנֶֽבֶל. נָצוּר עָלַי כַּכֶּֽבֶל. לִבְנֵי יְהוּדָה וְאֶפְרַֽיִם: \n" +
				"עֵינִי עֵינִי יוֹרְדָה מַּֽיִם. עַל חָרְבַּן יְרוּשָׁלַֽיִם: \n" +
				"עָלַי צָרִים צָחֲקוּ. וְכָאֲרִי שֵׁן חָרְקוּ. וּבְפִיהֶם עָלַי שָׁרְקוּ. וְגַם סָפְקוּ כַפַּֽיִם: \n" +
				"עֵינִי עֵינִי יוֹרְדָה מַּֽיִם. עַל חָרְבַּן יְרוּשָׁלַֽיִם: \n" +
				"יְלָלָה נְהִי וְקִינִים. שְׂאִי נָא אֵם עַל בָּנִים. בַּחוּרִים וּזְקֵנִים. וְגַם יוֹנְקֵי שָׁדַֽיִם: \n" +
				"עֵינִי עֵינִי יוֹרְדָה מַּֽיִם. עַל חָרְבַּן יְרוּשָׁלַֽיִם: \n" +
				"זָנַח אֲדֹנָי מִזְבְּחוֹ. נִאֵר מִקְדַּשׁ מְנוּחוֹ. גַּם הִסְגִּיר בְּיַד זוֹנְחוֹ. חוֹמוֹת יְרוּשָׁלַֽיִם: \n" +
				"עֵינִי עֵינִי יוֹרְדָה מַּֽיִם. עַל חָרְבַּן יְרוּשָׁלַֽיִם: \n" +
				"יוֹם הֶחֱרִיב צַר קֹֽדֶשׁ. צִיּוֹן עִיר הַקֹּֽדֶשׁ. בְּתִשְׁעָה בְּאָב לַחֹֽדֶשׁ. רָפוּ כָל יָדַֽיִם: \n" +
				"עֵינִי עֵינִי יוֹרְדָה מַּֽיִם. עַל חָרְבַּן יְרוּשָׁלַֽיִם: \n" +
				"הַצּוּר עָזוֹב אַף וְחֵמָה. וְקוּם הֱיֵה לָֽנוּ לְחוֹמָה. וְהָאֵר אוֹר הַחַמָּה. לִהְיוֹת שִׁבְעָתַֽיִם: \n" +
				"עֵינִי עֵינִי יוֹרְדָה מַּֽיִם. עַל חָרְבַּן יְרוּשָׁלַֽיִם:");
			addToSiddur(
				"הָרַגְתָּ בְּיוֹם אַפֶּֽךָ. טָבַֽחְתָּ וְלֹא חָמַֽלְתָּ: הָרַגְתָּ בְּיוֹם אַפֶּֽךָ. טָבַֽחְתָּ וְלֹא חָמַֽלְתָּ: \n" +
				"מֵרֵאשִׁית גּוֹי קָדוֹשׁ הָיִֽינוּ, לְמַלְאֲכֵי יְהֹוָה דָּמִֽנוּ. וְעַתָּה כַּצֹּאן תָּעִֽינוּ. וְעָבַֽרְנוּ עַל מִצְוֹתֶֽיךָ: הָרַגְתָּ בְּיוֹם אַפֶּֽךָ. טָבַֽחְתָּ וְלֹא חָמַֽלְתָּ: \n" +
				"בָּא עָלֵֽינוּ שֶֽׁבֶר עַל שֶֽׁבֶר. כְּאִשָּׁה יוֹשֶֽׁבֶת עַל מַשְׁבֵּר. שָׁרְקוּ שֵׁן עָלַי כָּל עוֹבֵר. וּבָֽאוּ בְּנַחֲלָתֶֽךָ: הָרַגְתָּ בְּיוֹם אַפֶּֽךָ. טָבַֽחְתָּ וְלֹא חָמַֽלְתָּ: \n" +
				"מְצָאֽוּנִי רוֹב יְגוֹנִים. רֻטָּשָׁה אֵם עַל בָּנִים. לְקֶֽרַח בַּלַּֽיְלָה חוֹנִים. שְׁאָר צֹאן מַרְעִיתֶֽךָ: \n" +
				"הָרַגְתָּ בְּיוֹם אַפֶּֽךָ. טָבַֽחְתָּ וְלֹא חָמַֽלְתָּ: \n" +
				"הָרְגוּ בָּֽנוּ כָּל אוֹיְבֵֽינוּ. לָקְחוּ כָּל מַחֲמַדֵּי עֵינֵינוּ. וּבְרוֹב כָּל חַטֹּאתֵֽינוּ. הֶחֱרִֽיבוּ מִקְדָּשֶֽׁךָ: הָרַגְתָּ בְּיוֹם אַפֶּֽךָ. טָבַֽחְתָּ וְלֹא חָמַֽלְתָּ: \n" +
				"קִדְּמוּנִי יְמֵי עוֹנִי. וְעָרְבָה כָּל שְׂשׂוֹנִי. וּבְלֵיל נְדוֹד רַעְיוֹנִי. חָשַֽׁקְתִּי לִרְאוֹת פָּנֶיךָ: \n" +
				"הָרַגְתָּ בְּיוֹם אַפֶּֽךָ. טָבַֽחְתָּ וְלֹא חָמַֽלְתָּ: \n" +
				"הַנִּקְרֵאת סוֹעֲרָה עֲנִיָּה. צוֹעֶֽקֶת מִבּוֹר תַּחְתִּיָּה. שְׁלַח נָא אֶת אֵלִיָּה. וּנְקַלֵּס לִמְחוֹז חֶפְצֶֽךָ: שְׁלַח נָא אֶת אֵלִיָּה. וּנְקַלֵּס לִמְחוֹז חֶפְצֶֽךָ:");
			// The Kina Z'Eyvey Erev was not on Sefaria, I should probably go look for it
			// later, but for now, I will leave it. I don't believe too many people will
			// worry about one Kina missing, especially when so many have been removed
			addToSiddur(
				"שׁוֹמְרוֹן קוֹל תִּתֵּן מְצָאוּנִי עֲוֹנַי. לְאֶרֶץ אַחֶרֶת יְצָאוּנִי בָנַי. וְאָהֳלִיבָה תִּזְעַק נִשְׂרְפוּ אַרְמוֹנַי. וַתֹּאמֶר צִיּוֹן עֲזָבַנִי יְהֹוָה: \n" +
				"לֹא לָךְ אָהֳלִיבָה חֲשׁוֹב עָנְיֵךְ כְּעָנְיִי. הֲתַמְשִׁילִי שִׁבְרֵךְ לְשִׁבְרִי וּלְחָלְיִי. אֲנִי אָהֳלָה סוּרָה בָּגַדְתִּי בְּקָשְׁיִי. וְקָם עָלַי כַּחְשִׁי וְעָנָה בִּי מֶרְיִי. וּלְמִקְצַת יָמִים שִׁלַּמְתִּי נִשְׁיִי. וְתִגְלַת פִּלְאֶסֶר אָכַל אֶת פִּרְיִי. חֲמוּדוֹתַי פָּשַׁט וְגַם הִצִּיל עֶדְיִי. לְלַחְלַח וּלְחָבוֹר נָשָׂא אֶת שִׁבְיִי. דֹּמִּי אָהֳלִיבָה וְאַל תִּבְכִּי כְּבִכְיִי. אַנִי נַדְתִּי לְרָחוֹק וְדַי לִי דַיִּי. שְׁנוֹתַיִךְ אָרְכוּ וְלֹא אָרְכוּ שָׁנָי: וַתֹּאמֶר צִיּוֹן עֲזָבַנִי יְהֹוָה: \n" +
				"מְשִׁיבָה אָהֳלִיבָה. אַנִי כֵּן מָרַדְתִּי. וּבְאַלּוּף נְעוּרַי כְּאָהֳלָה בָּגַדְתִּי. דֹּמִּי אָהֳלָה כִּי יְגוֹנַי פָּקַדְתִּי. נָדַדְתְּ אַתְּ אַחַת וְרַבּוֹת נָדַדְתִּי. הִנֵּה בְּיַד כַּשְׂדִּים פַּעֲמַיִם נִלְכַּדְתִּי. וְנִשְׂרַף הַהֵיכָל אַשֶׁר בּוֹ נִכְבַּדְתִּי. וּשְׁבוּיַת עֲנִיָּה לְבָבֶל יָרַדְתִּי. וְשַׁבְתִּי לְצִיּוֹן עוֹד וְהֵיכָל יָסַדְתִּי. וְגַם זֹאת הַפַּעַם מְעַט לֹא עָמַדְתִּי. עַד לְקָחָנִי וְכִמְעַט אָבַדְתִּי. וְעַל כָּל הָאַרָצוֹת נָפוֹצוּ הֲמוֹנָי: וַתֹּאמֶר צִיּוֹן עֲזָבַנִי יְהֹוָה:");
			addToSiddur(
				"אֵלֶּה אֶזְכְּרָה וְנַפְשִׁי עָלַי אֶשְׁפְּכָה. כִּי בְלָעוּנִי זְאֵבִים כְּעוּגָה בְּלִי הֲפוּכָה. כִּי בִּימֵי קֵיסָר לֹא עָלְתָה אֲרוּכָה. לָעֲשָׂרָה הֲרוּגֵי מְלוּכָה: \n" +
				"בְּלָמְדוֹ סֵפֶר מִפִּי מְשׁוּלֵי עֲרֵמַת. וְהֵבִין וְדִקְדֵּק בְּדַת רְשׁוּמַת. וּפָתַח בְּאֵלֶּה הַמִּשְׁפָּטִים וְחָשַׁב מְזִמַּת. וְגוֹנֵב אִישׁ וּמְכָרוֹ. וְנִמְצָא בְיָדוֹ מוֹת יוּמַת: \n" +
				"גָּבַהּ לֵב בְּלִיַּעַל עוֹבֵד אֱלִילִים. וְצִוָּה לְמַלֹּאת פְּלַטְרוֹ מַנְעָלִים. וְקָרָא לַעֲשָׂרָה חֲכָמִים גְּדוֹלִים. מְבִינֵי דַת וּטְעָמֶיהָ בְּפִלְפּוּלִים: \n" +
				"דִּינוּ מִשְׁפָּט זֶה לַאֲשׁוּרוֹ. וְאַל תְּעַוְּתוּהוּ דִּין כָּזָב לְאָמְרוֹ. כִּי אִם הוֹצִיאוּהוּ לַאֲמִתּוֹ וְאוֹרוֹ. כִּי יִמָּצֵא אִישׁ גּוֹנֵב נֶפֶשׁ מֵאֶחָיו מִבְּנֵי יִשְׂרָאֵל. וְהִתְעַמֵּר בּוֹ וּמְכָרוֹ: \n" +
				"הֵם הֱשִׁיבוּהוּ וּמֵת הַגַּנָּב הַהוּא. נָאַם אַיֵּה אֲבוֹתֵיכֶם אֲשֶׁר אֲחִיכֶם מְכָרוּהוּ. לְאָרְכַת יִשְׁמְעֵאלִים סְחָרוּהוּ. וּבְעַד נְעָלַיִם נְתָנוּהוּ: \n" +
				"וְאַתֶּם קַבְּלוּ דִין שָׁמַיִם עֲלֵיכֶם. כִּי מִימוֹתָם לֹא נִמְצְאוּ כָּכֶם. וְאִם הֵם חַיִּים הֵבֵאתִי דִּינָם לִפְנֵיכֶם. וְאַתֶּם תִּשְׂאוּ עֲוֹן אֲבוֹתֵיכֶם: \n" +
				"זְמַן תְּנָה לָנוּ שְׁלֹשָׁה יָמִים. עַד שֶׁנֵּדַע אִם הַדָּבָר נִגְזַר מִמְּרוֹמִים. וְאִם אֲנַחְנוּ חַיָּבִים וַאֲשֵׁמִים. נְקַבֵּל גְּזֵרַת מָלֵא רַחֲמִים: \n" +
				"חָלוּ וְזָעוּ וְנָעוּ כֻלָּמוֹ. עַל רִבִּי יִשְׁמָעֵאל בֶּן אֱלִישָׁע כֹּהֵן גָּדוֹל נָשְׂאוּ עֵינֵימוֹ. לְהַזְכִּיר אֶת הַשֵּׁם לַעֲלוֹת לַאֲדוֹנֵימוֹ. לָדַעַת אִם יָצְאָה הַגְּזֵרָה מֵאֵת אֱלֹהֵימוֹ: \n" +
				"טִהַר רִבִּי יִשְׁמָעֵאל אֶת עַצְמוֹ וְהִזְכִּיר אֶת הַשֵּׁם בְּסִלּוּדִים. וְשָׁאַל אֶת הַמַּלְאָךְ לְבוּשׁ הַבַּדִּים. וְנָאַם קַבְּלוּ חֲכָמִים צַדִּיקִים וִידִידִים. כִּי שָׁמַעְתִּי מֵאַחֲרֵי הַפַּרְגּוֹד כִּי בְּזֹאת אַתֶּם נִלְכָּדִים: \n" +
				"יָרַד רִבִּי יִשְׁמָעֵאל וְהִגִּיד לַחֲבֵרָיו מַאֲמַר הָאֵל. וְצִוָּה בְּלִיַּעַל לְהָרְגָם בְּכֹח וָאֵל. וּשְׁנַיִם מֵהֶם הוֹצִיא תְחִלָּה שֶׁהֵם גְּדוֹלֵי יִשְׂרָאֵל. רִבִּי יִשְׁמָעֵאל בֶּן אֱלִישָׁע כֹּהֵן גָּדוֹל. וְרַבָּן שִׁמְעוֹן בֶּן גַּמְלִיאֵל: \n" +
				"כְּרוֹת רֹאשׁוֹ תְחִלָּה הִרְצָה מִמֶּנּוּ לִבְעוֹן. מֵרְאוֹת בְּמִיתַת מְשָׁרֵת לְדַר מָעוֹן. לְהַפִּיל גּוֹרָלוֹת צִוָּה צִפְעוֹן. וְנָפַל הַגּוֹרָל עַל רַבָּן שִׁמְעוֹן: \n" +
				"לִשְׁפּוֹךְ דָּמוֹ מִהַר כְּשׁוֹר פָּר. וְצָרַח עָלָיו רִבִּי יִשְׁמָעֵאל בְּקוֹל מַר כַּשּׁוֹפָר. הַלָּשׁוֹן הַמְּמַהֶרֶת לְדַבֵּר אִמְרֵי שֶׁפָר. אֵיכָה לוֹחֶכֶת אֶת הֶעָפָר: \n" +
				"מַר מְאֹד בָּכָה עָלָיו בַּחֲרָדָה. בַּת בְּלִיַּעַל לְקוֹל בִּכְיָתוֹ עָמְדָה. תּוֹאַר יָפְיוֹ בְּלִבָּהּ חָמְדָה. וְשָׁאֲלָה מֵאֵת אָבִיהָ מִיתָתוֹ לְהַעֲמִידָהּ: \n" +
				"נִאֵץ בְּלִיַּעַל דָּבָר זֶה לַעֲשׂוֹתוֹ. לְהַפְשִׁיט אֶת עוֹרוֹ מֵעַל פָּנָיו שָׁאֲלָה מֵאִתּוֹ. לֹא אֵחַר שׂוֹנֵא דָּבָר זֶה לַעֲשׂוֹתוֹ. וְצָרַח רִבִּי יִשְׁמָעֵאל בְּקוֹל מַר לְיוֹצֵר נִשְׁמָתוֹ: \n" +
				"שַׂרְפֵי מַעְלָה צָעֲקוּ בְמָרָה. זוֹ תוֹרָה וְזוֹ שְׂכָרָהּ. עוֹטֶה כַּשַּׂלְמָה אוֹרָה. אוֹיֵב מְנָאֵץ שִׁמְךָ אֵל גָּדוֹל וְנוֹרָא. וּמְחָרֵף וּמְגַדֵּף עַל דִּבְרֵי תוֹרָה: \n" +
				"עָנְתָה בַּת קוֹל מִשָּׁמַיִם. אִם יִהְיֶה קוֹל אַחֵר אֶהְפּוֹךְ עוֹלָם לְמַיִם. לְתוֹהוּ וָבֹהוּ אָשִׁית הֲדוֹמַיִם. גְּזֵרָה הִיא מִלְּפָנַי קַבְּלוּהָ מְקַיְּמֵי דָת יוֹמַיִם: \n" +
				"פְּקִידִים נֶהֶרְגוּ מֵאַחֲרֵי שֶׁבֶת בָּתֵּי כְנֵסִיּוֹת. מְלֵאִים מִצְוֹת כָּרִמּוֹן וְדוֹרְשִׁים בְּכָל זָוִיּוֹת. וְצִוָּה לְהוֹצִיא רִבִּי עֲקִיבָא דּוֹרֵשׁ כִּתְרֵי אוֹתִיּוֹת. וְסָרְקוּ אֶת בְּשָׂרוֹ בְּמַסְרֵקוֹת שֶׁל פִּיפִיּוֹת: \n" +
				"צִוָּה לְהוֹצִיא רִבִּי חֲנַנְיָה בֶּן תְּרַדְיוֹן מִבֵּית אוּלָמוֹ. בַּחֲבִילֵי זְמוֹרוֹת כָּרְכוּ גָּלְמוֹ. וּסְפוּגִין שֶׁל צֶמֶר שָׂמוּ עַל לִבּוֹ לְעַכֵּב עַצְמוֹ. מִיַּד נִשְׂרַף וְסֵפֶר תּוֹרָה עִמּוֹ: \n" +
				"קוֹנְנוּ עַם לֹא אַלְמָן. כִּי עֲנָוִים הוֹרָגוּ וְשֻׁפַּךְ דָּמָן. לְשֵׁם שָׁמַיִם מָסְרוּ עַצְמָן. בַּהֲרִיגַת רִבִּי חוּצְפִּית הַתּוּרְגְּמָן: \n" +
				"רְעָדָה תֶאֱחוֹז כָּל שׁוֹמְעֵי שָׁמוֹעַ. וְתַזִּיל כָּל עַיִן דֶּמַע דָּמוֹעַ. וְיֵהָפֵךְ לְאֶבֶל כָּל שַׁעֲשׁוּעַ. עַל הֲרִיגַת רִבִּי אֶלְעָזָר בֶּן שַׁמּוּעַ: \n" +
				"שִׁחֲתוּנוּ בְּנֵי עֲדִינָה שׁוֹמֵמָה. וְהֵרֵעוּ לָנוּ מִכָּל מַלְכֵי הָאֲדָמָה. וְהָרְגוּ מִמֶּנּוּ כַּמָּה וְכַמָּה. בַּהֲרִיגַת רִבִּי יְהוּדָה בֶּן דָּמָא: \n" +
				"תָּקְפוּ עָלֵינוּ מִצְוַת לְהָפֵר. וּמֵאֲנוּ לָקַחַת הוֹן וְכוֹפֶר. כִּי אִם נַפְשׁוֹת הֹגֵי אִמְרֵי שֶׁפֶר. כְּמוֹ רִבִּי יִשְׁבָּב הַסּוֹפֵר: \n" +
				"יְחִיתוּנִי צוֹרְרַי וּמְעַנָּי. וּמָלְאוּ כְרֵיסָם מֵעֲדָנָי. וְהִשְׁקוּנִי רוֹשׁ וּמַר וְלַעֲנַי. בַּהֲרִיגַת רִבִּי חֲנִינָא בֶּן חֲכִינָאי: \n" +
				"דִּבַּרְתָּ בֵּית יַעֲקֹב אֵשׁ וּבֵית יוֹסֵף לֶהָבָה. הֵן עַתָּה אֵשׁ אוּרָם כָּבָה. כִּי הֵם הִסְכִּימוּ לַהֲרוֹג עֲשָׂרָה צַדִּיקִים בְּאֵיבָה. עִם רִבִּי יְהוּדָה בֶּן בָּבָא: \n" +
				"נַאֲקַת חָלָל בְּכָל דּוֹר בְּכִלָּיוֹן וָחֶרֶץ. סוּרוּ טָמֵא קָרְאוּ לָמוֹ כְּטוּמְאַת הַשֶּׁרֶץ. מֵאַיִן יָבֹא עֶזְרִי לַעֲמֹד בַּפֶּרֶץ. עֶ֭זְרִי מֵעִ֣ם יְהֹוָ֑ה עֹ֝שֵׂ֗ה שָׁמַ֥יִם וָאָֽרֶץ:");
			addToSiddur(
				"אָֽמְרָה צִיּוֹן מְצָאֽוּנִי עֲוֹנַי, לְאֶֽרֶץ אַחֶֽרֶת יְצָאֽוּנִי בָנַי. וְאִם גָּֽבְרוּ פְשָׁעַי, וְהִרְבֵּֽיתִי זְדוֹנַי, אַיֵּה חֲסָדֶֽיךָ הָרִֽאשׁוֹנִים אֲדֹנָי: וַיֹּֽאמֶר יְהֹוָה צִיּוֹן בֵּית מְנֽוּחָתִי, סְגֻלַּת עַמִּים אוֹתָךְ קָרָֽאתִי. לֹא אָבִית לְתֽוֹכַחְתִּי. לְזֹאת חֲמָתִי שָׁפַֽכְתִּי, עַל עָזְבֵךְ אֶת תּוֹרָתִי: אָֽמְרָה צִיּוֹן תִּקְוָתִי אֻמְלָֽלָה. חָֽשְׁכוּ מְאוֹרַי, וְשִׁמְשִׁי אָפֵלָה, בְּשָׁמְעִי קוֹל יְתוֹמַי צֽוֹעֲקִים בְּחַלְחָלָה: הֲשָׁכַח חַנּוֹת אֵל, אִם קָפַץ בְּאַף רַֽחֲמָיו סֶֽלָה: וַיֹּֽאמֶר יְהֹוָה הִרְבֵּית שִׁקּוּצַֽיִךְ, נִמְאַֽסְתְּ בְּרוֹב מַעֲלַֽיִךְ בּוֹעֲלַיִךְ עֹשַֽׂיִךְ, וּבָֽגְדוּ בָךְ בּוֹגְדַֽיִךְ, יוֹצְאֵי מֵעַֽיִךְ. מִהֲרוּ בָּנָֽיִךְ מְהָרְסַֽיִךְ וּמַֽחֲרִיבַֽיִךְ: אָֽמְרָה צִיּוֹן לְמִי אֶבְכֶּה תְחִלָּה, אִם לְשִׁמְמוּת קָדְשִׁי, אוֹ לְגָלוּת הַנִּפְלָא. אִם לְךָ צוּר קְדוֹשִׁי, אֲשֶׁר עָשִֽׂיתָ כָלָה, סַכֹּֽתָה בֶּֽעָנָן לָךְ מֵֽעֲבוֹר תְּפִלָּה: וַיֹּֽאמֶר יְהֹוָה הֵן נִלְכַּדְתְּ בְּמוֹקְשֵׁךְ, וּבְעֽוֹצֶם בִּצְעֵךְ חָרַב מִקְדָּשֵׁךְ, וְחַטֹּאת נְעוּרֵךְ פָּקַד צוּר קְדוֹשֵׁךְ, יַֽעַן שָׂטִית טֻמְאָה תַּֽחַת אִישֵׁךְ: אָֽמְרָה צִיּוֹן מָה אֶעֱנֶה וּמַה אוֹמַר, כִּי בְּרֹב עֲוֹנַי גִּילִי לְאֵֽבֶל הוּמַר, וְעַל שִׁמְמוּת מְכוֹנִי אֶצְעַק בְּלֵב חֳמַרְמָר, הִנֵּה לְשָׁלוֹם מַר לִי מַר: וַיֹּֽאמֶר יְהֹוָה מִבְטָחֵךְ נִכְחַד, כִּי צָרֵךְ וְעָרֵךְ נוֹסְדוּ יַֽחַד. גִּלִּֽיתִי אָזְנֵךְ בְּמוֹרָא וָפַֽחַד דִּבְרֵי הַנְּבִיאִים פֶּֽה אֶחָד: אָֽמְרָה צִיּוֹן אֽוֹיָה לִּי עַל עֲוֹנָי, כִּי בֶֽאֱמֶת וָצֶֽדֶק חָֽרְבוּ אַרְמוֹנָי, אַךְ אִם פָּשַֽׁעְתִּי, וְרַבּוּ עֲוֹנָי, הַלְעֽוֹלָמִים יִזְנַח אֲדֹנָי:");
			addToSiddur(
				"לִשְׁכִינָה עָלְתָה. וִילָלָה כִּי רָבְתָה. אַלְלַי לִי אוֹיָה לִי: \n" +
				"לִשְׂרֵפַת תּוֹרָה. שְׂאוּ קִינָה מָרָה. אַלְלַי לִי אוֹיָה לִי: \n" +
				"לְבָתֵּי כְנֵסִיּוֹת. וּבַעֲלֵי תוּשִׁיּוֹת. אַלְלַי לִי אוֹיָה לִי: \n" +
				"לְהֶרֶג בַּחוּרִים. וּשְׁחִיטַת הַכְּשֵׁרִים. אַלְלַי לִי אוֹיָה לִי: \n" +
				"לְחָרְבַּן מִקְדָּשִׁים. שְׂאוּ קִינִים קָשִׁים. אַלְלַי לִי אוֹיָה לִי: \n" +
				"לְהָרוֹת וּמְנִיקוֹת. נַפְשׁוֹתָם שׁוֹקֵקוֹת. אַלְלַי לִי אוֹיָה לִי: \n" +
				"לְיוֹנְקֵי שָׁדַיִם. כִּי צָמְאוּ לַמַּיִם. אַלְלַי לִי אוֹיָה לִי: \n" +
				"אוֹי לְעוֹצֶם חָרְבַּן. לְתִינוֹקוֹת שֶׁל בֵּית רַבָּן. אַלְלַי לִי אוֹיָה לִי:");
			addToSiddur(
				"אַלְלַי לִי אַלְלַי. עַל רוֹעַ מַעֲלָלַי. אַלְלַי לִי אַלְלַי. עַל שְׁבִי עוֹלְלַי: \n" +
				"אֵיכָה כָּלוּ בְיָגוֹן חַיָּי. וְכָל בְּלִי שֵׁם בִּי יָדוֹן. הָיִיתִי כְּעֶבֶד וְהֵם מוֹשְׁלִים. וְלֹא אֵדָע מִי לִי אָדוֹן. זֶה רוֹדֶה וְזֶה מְרַדֶּה. וְזֶה עוֹשֶׂה בְּעֶבְרַת זָדוֹן. אוֹי לִי אִמִּי כִּי יְלִדְתִּינִי. אִישׁ רִיב וְאִישׁ מָדוֹן: \n" +
				"אַלְלַי לִי אַלְלַי. עַל רוֹעַ מַעֲלָלַי. אַלְלַי לִי אַלְלַי. עַל שְׁבִי עוֹלְלַי: \n" +
				"בָּכֹה אֶבְכֶּה לַיְלָה וְיוֹמָם. כִּי אָרְכוּ קִצֵּי שִׁבְרִי. לָמָּה לֹא מֵרֶחֶם מוֹתַתְנִי. וּתְהִי לִי אִמִּי קִבְרִי. כִּי חֶרְפַּת אָדָם לוֹקֵחַ. כָּל הַנִּקְרָא בְּשֵׁם עִבְרִי. נַחְלָה מַכָּתִי אוֹי לִי עַל שִׁבְרִי: \n" +
				"אַלְלַי לִי אַלְלַי. עַל רוֹעַ מַעֲלָלַי. אַלְלַי לִי אַלְלַי. עַל שְׁבִי עוֹלְלַי: \n" +
				"גָּלֹה הִגְלָנִי מְדַכְּאִי. וּדְרָכַי בְּגָזִית גָּדַר. פִּתְאוֹם נֵרִי כָּבָה. וְשִׁמְשִׁי בְּעוֹד יוֹם קָדַר. גָּלָה כָבוֹד מִיִּשְׂרָאֵל. לֹא תוֹאַר לוֹ וְלֹא הָדָר. עֵין שִׁמְשִׁי חָשַׁךְ. וּמְאוֹרִי קָדוֹר קָדַר. אוֹיָה לִּי כִּי גַרְתִּי מֶשֶׁךְ שָׁכַנְתִּי עִם אָהֳלֵי קֵדָר: \n" +
				"אַלְלַי לִי אַלְלַי. עַל רוֹעַ מַעֲלָלַי. אַלְלַי לִי אַלְלַי. עַל שְׁבִי עוֹלְלַי: \n" +
				"דִּמָּה כְבוֹדִי לַחֲצִיר גַּגּוֹת. שֶׁיָּבֵשׁ לִפְנֵי כָל חָצִיר. כְּסוּחָה הָשְׁלַכְתִּי וָאֶהִי דוֹמֶן לְכָל יְצִיר. קָרְאוּ אַחֲרַי שִׁלְחוּ מַגָּל כִּי בָשַׁל קָצִיר. \n" +
				"אַלְלַי לִי כִּי הָיִיתִי כְּאָסְפֵי קַיִץ כְּעוֹלְלוֹת בָּצִיר:");
			addToSiddur(
				"הַנּוֹתֵן בַּיָּם דָּרֶךְ. וּבְמַיִם עַזִּים נְתִיבָה. הָחִישׁ יְשׁוּעָתֵנוּ. וְאֶת יְרִיבֵנוּ רִיבָה. וְגַם אֶת אַחֲרִיתֵנוּ. מֵרֵאשִׁיתֵנוּ הֵטִיבָה. הֲשִׁיבֵ֨נוּ יְהֹוָ֤ה ׀ אֵלֶ֙יךָ֙ וְֽנָשׁ֔וּבָה: כַּכָּתוּב הֲשִׁיבֵ֨נוּ יְהֹוָ֤ה ׀ אֵלֶ֙יךָ֙ וְֽנָשׁ֔וּבָה חַדֵּ֥שׁ יָמֵ֖ינוּ כְּקֶֽדֶם׃");
			addToSiddur(
				"עַד אָנָה בִּכְיָה בְּצִיּוֹן וּמִסְפֵּד בִּירוּשָׁלַיִם. תָּקוּם תְּרַחֵם צִיּוֹן תִּבְנֶה חוֹמוֹת יְרוּשָׁלַיִם: כַּכָּתוּב. אַתָּ֣ה תָ֭קוּם תְּרַחֵ֣ם צִיּ֑וֹן כִּי־עֵ֥ת לְ֝חֶֽנְנָ֗הּ כִּי־בָ֥א מוֹעֵֽד׃ וְנֶאֱמַר. וּפְדוּיֵ֨י יְהֹוָ֜ה יְשֻׁב֗וּן וּבָ֤אוּ צִיּוֹן֙ בְּרִנָּ֔ה וְשִׂמְחַ֥ת עוֹלָ֖ם עַל־רֹאשָׁ֑ם שָׂשׂ֤וֹן וְשִׂמְחָה֙ יַשִּׂ֔יגוּ וְנָ֖סוּ יָג֥וֹן וַאֲנָחָֽה׃");
			addToSiddur("יש אומרים (Some say)");
			addToSiddur(
				"כְּדִכְתִיב. כִּֽי־נִחַ֨ם יְהֹוָ֜ה צִיּ֗וֹן נִחַם֙ כָּל־חָרְבֹתֶ֔יהָ וַיָּ֤שֶׂם מִדְבָּרָהּ֙ כְּעֵ֔דֶן וְעַרְבָתָ֖הּ כְּגַן־יְהֹוָ֑ה שָׂשׂ֤וֹן וְשִׂמְחָה֙ יִמָּ֣צֵא בָ֔הּ תּוֹדָ֖ה וְק֥וֹל זִמְרָֽה׃ הִתְנַעֲרִ֧י מֵעָפָ֛ר ק֥וּמִי שְּׁבִ֖י יְרֽוּשָׁלִָ֑ם הִֽתְפַּתְּחִי֙ מוֹסְרֵ֣י צַוָּארֵ֔ךְ שְׁבִיָּ֖ה בַּת־צִיּֽוֹן׃");
			addKaddishTitkabal(false);// Chazon Ovadiah Page 391
			addToSiddur("יש אנשים שקוראים כאן את הספר איוב/Some read the entire Iyov here");
			// Some add the entire Iyov here. Not gonna do that because they can pick up a
			// tanach to do that, and it will make this class even bigger than necessary
		}

		return siddur;
	}

	private void addShirShelYom(boolean removeHashir) {
		switch (jewishDateInfo.getJewishCalendar().getDayOfWeek()) {
			case 1:
				addToSiddur(
					"הַיּוֹם יוֹם אֶחָד בְּשַׁבַּת קוֹדֶשׁ, הַשִּׁיר שֶׁהָיוּ הַלְוִיִּם אוֹמְרִים עַל הַדּוּכָן: \n\n"
						.replace(removeHashir ? ", הַשִּׁיר שֶׁהָיוּ הַלְוִיִּם אוֹמְרִים עַל הַדּוּכָן" : "",
										"")
					+
					"לְדָוִ֗ד מִ֫זְמ֥וֹר לַֽ֭יהֹוָה הָאָ֣רֶץ וּמְלוֹאָ֑הּ תֵּ֝בֵ֗ל וְיֹ֣שְׁבֵי בָֽהּ׃ כִּי־ה֭וּא עַל־יַמִּ֣ים יְסָדָ֑הּ וְעַל־נְ֝הָר֗וֹת יְכוֹנְנֶֽהָ׃ מִֽי־יַעֲלֶ֥ה בְהַר־יְהֹוָ֑ה וּמִי־יָ֝קוּם בִּמְק֥וֹם קׇדְשֽׁוֹ׃ נְקִ֥י כַפַּ֗יִם וּֽבַר־לֵ֫בָ֥ב אֲשֶׁ֤ר ׀ לֹא־נָשָׂ֣א לַשָּׁ֣וְא נַפְשִׁ֑י וְלֹ֖א נִשְׁבַּ֣ע לְמִרְמָֽה׃ יִשָּׂ֣א בְ֭רָכָה מֵאֵ֣ת יְהֹוָ֑ה וּ֝צְדָקָ֗ה מֵאֱלֹהֵ֥י יִשְׁעֽוֹ׃ זֶ֭ה דּ֣וֹר דֹּרְשָׁ֑ו מְבַקְשֵׁ֨י פָנֶ֖יךָ יַעֲקֹ֣ב סֶֽלָה׃ שְׂא֤וּ שְׁעָרִ֨ים ׀ רָֽאשֵׁיכֶ֗ם וְֽ֭הִנָּשְׂאוּ פִּתְחֵ֣י עוֹלָ֑ם וְ֝יָב֗וֹא מֶ֣לֶךְ הַכָּבֽוֹד׃ מִ֥י זֶה֮ מֶ֤לֶךְ הַכָּ֫ב֥וֹד יְ֭הֹוָה עִזּ֣וּז וְגִבּ֑וֹר יְ֝הֹוָ֗ה גִּבּ֥וֹר מִלְחָמָֽה׃ שְׂא֤וּ שְׁעָרִ֨ים ׀ רָֽאשֵׁיכֶ֗ם וּ֭שְׂאוּ פִּתְחֵ֣י עוֹלָ֑ם וְ֝יָבֹ֗א מֶ֣לֶךְ הַכָּבֽוֹד׃ מִ֤י ה֣וּא זֶה֮ מֶ֤לֶךְ הַכָּ֫ב֥וֹד יְהֹוָ֥ה צְבָא֑וֹת ה֤וּא מֶ֖לֶךְ הַכָּב֣וֹד סֶֽלָה");
				break;
			case 2:
				addToSiddur(
					"הַיּוֹם יוֹם שֵׁנִי בְּשַׁבַּת קוֹדֶשׁ, הַשִּׁיר שֶׁהָיוּ הַלְוִיִּם אוֹמְרִים עַל הַדּוּכָן: \n\n"
						.replace(removeHashir ? ", הַשִּׁיר שֶׁהָיוּ הַלְוִיִּם אוֹמְרִים עַל הַדּוּכָן" : "",
										"")
					+
					"שִׁ֥יר מִ֝זְמ֗וֹר לִבְנֵי־קֹֽרַח׃ גָּ֘ד֤וֹל יְהֹוָ֣ה וּמְהֻלָּ֣ל מְאֹ֑ד בְּעִ֥יר אֱ֝לֹהֵ֗ינוּ הַר־קׇדְשֽׁוֹ׃ יְפֵ֥ה נוֹף֮ מְשׂ֢וֹשׂ כׇּל־הָ֫אָ֥רֶץ הַר־צִ֭יּוֹן יַרְכְּתֵ֣י צָפ֑וֹן קִ֝רְיַ֗ת מֶ֣לֶךְ רָֽב׃ אֱלֹהִ֥ים בְּאַרְמְנוֹתֶ֗יהָ נוֹדַ֥ע לְמִשְׂגָּֽב׃ כִּֽי־הִנֵּ֣ה הַ֭מְּלָכִים נ֥וֹעֲד֑וּ עָבְר֥וּ יַחְדָּֽו׃ הֵ֣מָּה רָ֭אוּ כֵּ֣ן תָּמָ֑הוּ נִבְהֲל֥וּ נֶחְפָּֽזוּ׃ רְ֭עָדָה אֲחָזָ֣תַם שָׁ֑ם חִ֗֝יל כַּיּוֹלֵדָֽה׃ בְּר֥וּחַ קָדִ֑ים תְּ֝שַׁבֵּ֗ר אֳנִיּ֥וֹת תַּרְשִֽׁישׁ׃ כַּאֲשֶׁ֤ר שָׁמַ֨עְנוּ ׀ כֵּ֤ן רָאִ֗ינוּ בְּעִיר־יְהֹוָ֣ה צְ֭בָאוֹת בְּעִ֣יר אֱלֹהֵ֑ינוּ אֱלֹ֘הִ֤ים יְכוֹנְנֶ֖הָ עַד־עוֹלָ֣ם סֶֽלָה׃ דִּמִּ֣ינוּ אֱלֹהִ֣ים חַסְדֶּ֑ךָ בְּ֝קֶ֗רֶב הֵיכָלֶֽךָ׃ כְּשִׁמְךָ֤ אֱלֹהִ֗ים כֵּ֣ן תְּ֭הִלָּתְךָ עַל־קַצְוֵי־אֶ֑רֶץ צֶ֗֝דֶק מָלְאָ֥ה יְמִינֶֽךָ׃ יִשְׂמַ֤ח ׀ הַר־צִיּ֗וֹן תָּ֭גֵלְנָה בְּנ֣וֹת יְהוּדָ֑ה לְ֝מַ֗עַן מִשְׁפָּטֶֽיךָ׃ סֹ֣בּוּ צִ֭יּוֹן וְהַקִּיפ֑וּהָ סִ֝פְר֗וּ מִגְדָּלֶֽיהָ׃ שִׁ֤יתוּ לִבְּכֶ֨ם ׀ לְֽחֵילָ֗ה פַּסְּג֥וּ אַרְמְנוֹתֶ֑יהָ לְמַ֥עַן תְּ֝סַפְּר֗וּ לְד֣וֹר אַֽחֲרֽוֹן׃ כִּ֤י זֶ֨ה ׀ אֱלֹהִ֣ים אֱ֭לֹהֵינוּ עוֹלָ֣ם וָעֶ֑ד ה֖וּא יְנַהֲגֵ֣נוּ עַל־מֽוּת׃");
				break;
			case 3:
				addToSiddur(
					"הַיּוֹם יוֹם שְׁלִישִׁי בְּשַׁבַּת קוֹדֶשׁ, הַשִּׁיר שֶׁהָיוּ הַלְוִיִּם אוֹמְרִים עַל הַדּוּכָן: \n\n"
						.replace(removeHashir ? ", הַשִּׁיר שֶׁהָיוּ הַלְוִיִּם אוֹמְרִים עַל הַדּוּכָן" : "",
										"")
					+
					"מִזְמ֗וֹר לְאָ֫סָ֥ף אֱֽלֹהִ֗ים נִצָּ֥ב בַּעֲדַת־אֵ֑ל בְּקֶ֖רֶב אֱלֹהִ֣ים יִשְׁפֹּֽט׃ עַד־מָתַ֥י תִּשְׁפְּטוּ־עָ֑וֶל וּפְנֵ֥י רְ֝שָׁעִ֗ים תִּשְׂאוּ־סֶֽלָה׃ שִׁפְטוּ־דַ֥ל וְיָת֑וֹם עָנִ֖י וָרָ֣שׁ הַצְדִּֽיקוּ׃ פַּלְּטוּ־דַ֥ל וְאֶבְי֑וֹן מִיַּ֖ד רְשָׁעִ֣ים הַצִּֽילוּ׃ לֹ֤א יָדְע֨וּ ׀ וְלֹ֥א יָבִ֗ינוּ בַּחֲשֵׁכָ֥ה יִתְהַלָּ֑כוּ יִ֝מּ֗וֹטוּ כׇּל־מ֥וֹסְדֵי אָֽרֶץ׃ אֲֽנִי־אָ֭מַרְתִּי אֱלֹהִ֣ים אַתֶּ֑ם וּבְנֵ֖י עֶלְי֣וֹן כֻּלְּכֶֽם׃ אָ֭כֵן כְּאָדָ֣ם תְּמוּת֑וּן וּכְאַחַ֖ד הַשָּׂרִ֣ים תִּפֹּֽלוּ׃ קוּמָ֣ה אֱ֭לֹהִים שׇׁפְטָ֣ה הָאָ֑רֶץ כִּֽי־אַתָּ֥ה תִ֝נְחַ֗ל בְּכׇל־הַגּוֹיִֽם׃");
				break;
			case 4:
				addToSiddur(
					"הַיּוֹם יוֹם רְבִיעִי בְּשַׁבַּת קוֹדֶשׁ, הַשִּׁיר שֶׁהָיוּ הַלְוִיִּם אוֹמְרִים עַל הַדּוּכָן: \n\n"
						.replace(removeHashir ? ", הַשִּׁיר שֶׁהָיוּ הַלְוִיִּם אוֹמְרִים עַל הַדּוּכָן" : "",
										"")
					+
					"אֵל־נְקָמ֥וֹת יְהֹוָ֑ה אֵ֖ל נְקָמ֣וֹת הוֹפִֽיעַ׃ הִ֭נָּשֵׂא שֹׁפֵ֣ט הָאָ֑רֶץ הָשֵׁ֥ב גְּ֝מ֗וּל עַל־גֵּאִֽים׃ עַד־מָתַ֖י רְשָׁעִ֥ים ׀ יְהֹוָ֑ה עַד־מָ֝תַ֗י רְשָׁעִ֥ים יַעֲלֹֽזוּ׃ יַבִּ֣יעוּ יְדַבְּר֣וּ עָתָ֑ק יִ֝תְאַמְּר֗וּ כׇּל־פֹּ֥עֲלֵי אָֽוֶן׃ עַמְּךָ֣ יְהֹוָ֣ה יְדַכְּא֑וּ וְֽנַחֲלָתְךָ֥ יְעַנּֽוּ׃ אַלְמָנָ֣ה וְגֵ֣ר יַהֲרֹ֑גוּ וִ֖יתוֹמִ֣ים יְרַצֵּֽחוּ׃ וַ֭יֹּ֣אמְרוּ לֹ֣א יִרְאֶה־יָּ֑הּ וְלֹא־יָ֝בִ֗ין אֱלֹהֵ֥י יַעֲקֹֽב׃ בִּ֭ינוּ בֹּעֲרִ֣ים בָּעָ֑ם וּ֝כְסִילִ֗ים מָתַ֥י תַּשְׂכִּֽילוּ׃ הֲנֹ֣טַֽע אֹ֭זֶן הֲלֹ֣א יִשְׁמָ֑ע אִֽם־יֹ֥צֵֽר עַ֗֝יִן הֲלֹ֣א יַבִּֽיט׃ הֲיֹסֵ֣ר גּ֭וֹיִם הֲלֹ֣א יוֹכִ֑יחַ הַֽמְלַמֵּ֖ד אָדָ֣ם דָּֽעַת׃ יְֽהֹוָ֗ה יֹ֭דֵעַ מַחְשְׁב֣וֹת אָדָ֑ם כִּי־הֵ֥מָּה הָֽבֶל׃ אַשְׁרֵ֤י ׀ הַגֶּ֣בֶר אֲשֶׁר־תְּיַסְּרֶ֣נּוּ יָּ֑הּ וּֽמִתּוֹרָתְךָ֥ תְלַמְּדֶֽנּוּ׃ לְהַשְׁקִ֣יט ל֭וֹ מִ֣ימֵי רָ֑ע עַ֤ד יִכָּרֶ֖ה לָרָשָׁ֣ע שָֽׁחַת׃ כִּ֤י ׀ לֹא־יִטֹּ֣שׁ יְהֹוָ֣ה עַמּ֑וֹ וְ֝נַחֲלָת֗וֹ לֹ֣א יַעֲזֹֽב׃ כִּֽי־עַד־צֶ֭דֶק יָשׁ֣וּב מִשְׁפָּ֑ט וְ֝אַחֲרָ֗יו כׇּל־יִשְׁרֵי־לֵֽב׃ מִֽי־יָק֣וּם לִ֭י עִם־מְרֵעִ֑ים מִי־יִתְיַצֵּ֥ב לִ֗֝י עִם־פֹּ֥עֲלֵי אָֽוֶן׃ לוּלֵ֣י יְ֭הֹוָה עֶזְרָ֣תָה לִּ֑י כִּמְעַ֓ט ׀ שָׁכְנָ֖ה דוּמָ֣ה נַפְשִֽׁי׃ אִם־אָ֭מַרְתִּי מָ֣טָה רַגְלִ֑י חַסְדְּךָ֥ יְ֝הֹוָ֗ה יִסְעָדֵֽנִי׃ בְּרֹ֣ב שַׂרְעַפַּ֣י בְּקִרְבִּ֑י תַּ֝נְחוּמֶ֗יךָ יְֽשַׁעַשְׁע֥וּ נַפְשִֽׁי׃ הַֽ֭יְחׇבְרְךָ כִּסֵּ֣א הַוּ֑וֹת יֹצֵ֖ר עָמָ֣ל עֲלֵי־חֹֽק׃ יָ֭גוֹדּוּ עַל־נֶ֣פֶשׁ צַדִּ֑יק וְדָ֖ם נָקִ֣י יַרְשִֽׁיעוּ׃ וַיְהִ֬י יְהֹוָ֣ה לִ֣י לְמִשְׂגָּ֑ב וֵ֝אלֹהַ֗י לְצ֣וּר מַחְסִֽי׃ וַיָּ֤שֶׁב עֲלֵיהֶ֨ם ׀ אֶת־אוֹנָ֗ם וּבְרָעָתָ֥ם יַצְמִיתֵ֑ם יַ֝צְמִיתֵ֗ם יְהֹוָ֥ה אֱלֹהֵֽינוּ׃");
				break;
			case 5:
				addToSiddur(
					"הַיּוֹם יוֹם חֲמִישִׁי בְּשַׁבַּת קוֹדֶשׁ, הַשִּׁיר שֶׁהָיוּ הַלְוִיִּם אוֹמְרִים עַל הַדּוּכָן: \n\n"
						.replace(removeHashir ? ", הַשִּׁיר שֶׁהָיוּ הַלְוִיִּם אוֹמְרִים עַל הַדּוּכָן" : "",
										"")
					+
					"לַמְנַצֵּ֬חַ ׀ עַֽל־הַגִּתִּ֬ית לְאָסָֽף׃ הַ֭רְנִינוּ לֵאלֹהִ֣ים עוּזֵּ֑נוּ הָ֝רִ֗יעוּ לֵאלֹהֵ֥י יַעֲקֹֽב׃ שְֽׂאוּ־זִ֭מְרָה וּתְנוּ־תֹ֑ף כִּנּ֖וֹר נָעִ֣ים עִם־נָֽבֶל׃ תִּקְע֣וּ בַחֹ֣דֶשׁ שׁוֹפָ֑ר בַּ֝כֵּ֗סֶה לְי֣וֹם חַגֵּֽנוּ׃ כִּ֤י חֹ֣ק לְיִשְׂרָאֵ֣ל ה֑וּא מִ֝שְׁפָּ֗ט לֵאלֹהֵ֥י יַעֲקֹֽב׃ עֵ֤דוּת ׀ בִּיה֘וֹסֵ֤ף שָׂמ֗וֹ בְּ֭צֵאתוֹ עַל־אֶ֣רֶץ מִצְרָ֑יִם שְׂפַ֖ת לֹא־יָדַ֣עְתִּי אֶשְׁמָֽע׃ הֲסִיר֣וֹתִי מִסֵּ֣בֶל שִׁכְמ֑וֹ כַּ֝פָּ֗יו מִדּ֥וּד תַּעֲבֹֽרְנָה׃ בַּצָּרָ֥ה קָרָ֗אתָ וָאֲחַ֫לְּצֶ֥ךָּ אֶ֭עֶנְךָ בְּסֵ֣תֶר רַ֑עַם אֶבְחׇנְךָ֨ עַל־מֵ֖י מְרִיבָ֣ה סֶֽלָה׃ שְׁמַ֣ע עַ֭מִּי וְאָעִ֣ידָה בָּ֑ךְ יִ֝שְׂרָאֵ֗ל אִם־תִּֽשְׁמַֽע־לִֽי׃ לֹא־יִהְיֶ֣ה בְ֭ךָ אֵ֣ל זָ֑ר וְלֹ֥א תִ֝שְׁתַּחֲוֶ֗ה לְאֵ֣ל נֵכָֽר׃ אָֽנֹכִ֨י ׀ יְהֹ֘וָ֤ה אֱלֹהֶ֗יךָ הַֽ֭מַּעַלְךָ מֵאֶ֣רֶץ מִצְרָ֑יִם הַרְחֶב־פִּ֗֝יךָ וַאֲמַלְאֵֽהוּ׃ וְלֹֽא־שָׁמַ֣ע עַמִּ֣י לְקוֹלִ֑י וְ֝יִשְׂרָאֵ֗ל לֹא־אָ֥בָה לִֽי׃ וָ֭אֲשַׁלְּחֵהוּ בִּשְׁרִיר֣וּת לִבָּ֑ם יֵ֝לְכ֗וּ בְּֽמוֹעֲצ֖וֹתֵיהֶֽם׃ ל֗וּ עַ֭מִּי שֹׁמֵ֣עַֽ לִ֑י יִ֝שְׂרָאֵ֗ל בִּדְרָכַ֥י יְהַלֵּֽכוּ׃ כִּ֭מְעַט אוֹיְבֵיהֶ֣ם אַכְנִ֑יעַ וְעַ֥ל צָ֝רֵיהֶ֗ם אָשִׁ֥יב יָדִֽי׃ מְשַׂנְאֵ֣י יְ֭הֹוָה יְכַחֲשׁוּ־ל֑וֹ וִיהִ֖י עִתָּ֣ם לְעוֹלָֽם׃ וַֽ֭יַּאֲכִילֵהוּ מֵחֵ֣לֶב חִטָּ֑ה וּ֝מִצּ֗וּר דְּבַ֣שׁ אַשְׂבִּיעֶֽךָ׃");
				break;
			case 6:
				addToSiddur(
					"הַיּוֹם יוֹם הַשִּׁשִּׁי בְּשַׁבַּת קוֹדֶשׁ, הַשִּׁיר שֶׁהָיוּ הַלְוִיִּם אוֹמְרִים עַל הַדּוּכָן: \n\n"
						.replace(removeHashir ? ", הַשִּׁיר שֶׁהָיוּ הַלְוִיִּם אוֹמְרִים עַל הַדּוּכָן" : "",
										"")
					+
					"יְהֹוָ֣ה מָלָךְ֮ גֵּא֢וּת לָ֫בֵ֥שׁ לָבֵ֣שׁ יְ֭הֹוָה עֹ֣ז הִתְאַזָּ֑ר אַף־תִּכּ֥וֹן תֵּ֝בֵ֗ל בַּל־תִּמּֽוֹט׃ נָכ֣וֹן כִּסְאֲךָ֣ מֵאָ֑ז מֵעוֹלָ֣ם אָֽתָּה׃ נָשְׂא֤וּ נְהָר֨וֹת ׀  יְֽהֹוָ֗ה נָשְׂא֣וּ נְהָר֣וֹת קוֹלָ֑ם יִשְׂא֖וּ נְהָר֣וֹת דׇּכְיָֽם׃ מִקֹּל֨וֹת ׀  מַ֤יִם רַבִּ֗ים אַדִּירִ֣ים מִשְׁבְּרֵי־יָ֑ם אַדִּ֖יר בַּמָּר֣וֹם יְהֹוָֽה׃ עֵֽדֹתֶ֨יךָ ׀ נֶאֶמְנ֬וּ מְאֹ֗ד לְבֵיתְךָ֥ נַאֲוָה־קֹ֑דֶשׁ יְ֝הֹוָ֗ה לְאֹ֣רֶךְ יָמִֽים׃");
				break;
		}
	}

	private void addChanukaTorahReading() {
		switch (jewishDateInfo.getJewishCalendar().getDayOfChanukah()) {
			case 1:
				addToSiddurHighlighted(
					"וַיְדַבֵּ֥ר יְהֹוָ֖ה אֶל־מֹשֶׁ֥ה לֵּאמֹֽר׃ דַּבֵּ֤ר אֶֽל־אַהֲרֹן֙ וְאֶל־בָּנָ֣יו לֵאמֹ֔ר כֹּ֥ה תְבָרְכ֖וּ אֶת־בְּנֵ֣י יִשְׂרָאֵ֑ל אָמ֖וֹר לָהֶֽם׃ יְבָרֶכְךָ֥ יְהֹוָ֖ה וְיִשְׁמְרֶֽךָ׃ יָאֵ֨ר יְהֹוָ֧ה ׀ פָּנָ֛יו אֵלֶ֖יךָ וִֽיחֻנֶּֽךָּ׃ יִשָּׂ֨א יְהֹוָ֤ה ׀ פָּנָיו֙ אֵלֶ֔יךָ וְיָשֵׂ֥ם לְךָ֖ שָׁלֽוֹם׃ וַיְהִ֡י בְּיוֹם֩ כַּלּ֨וֹת מֹשֶׁ֜ה לְהָקִ֣ים אֶת־הַמִּשְׁכָּ֗ן וַיִּמְשַׁ֨ח אֹת֜וֹ וַיְקַדֵּ֤שׁ אֹתוֹ֙ וְאֶת־כׇּל־כֵּלָ֔יו וְאֶת־הַמִּזְבֵּ֖חַ וְאֶת־כׇּל־כֵּלָ֑יו וַיִּמְשָׁחֵ֖ם וַיְקַדֵּ֥שׁ אֹתָֽם׃ וַיַּקְרִ֙יבוּ֙ נְשִׂיאֵ֣י יִשְׂרָאֵ֔ל רָאשֵׁ֖י בֵּ֣ית אֲבֹתָ֑ם הֵ֚ם נְשִׂיאֵ֣י הַמַּטֹּ֔ת הֵ֥ם הָעֹמְדִ֖ים עַל־הַפְּקֻדִֽים׃ וַיָּבִ֨יאוּ אֶת־קׇרְבָּנָ֜ם לִפְנֵ֣י יְהֹוָ֗ה שֵׁשׁ־עֶגְלֹ֥ת צָב֙ וּשְׁנֵ֣י עָשָׂ֣ר בָּקָ֔ר עֲגָלָ֛ה עַל־שְׁנֵ֥י הַנְּשִׂאִ֖ים וְשׁ֣וֹר לְאֶחָ֑ד וַיַּקְרִ֥יבוּ אוֹתָ֖ם לִפְנֵ֥י הַמִּשְׁכָּֽן׃ [לוי]: וַיֹּ֥אמֶר יְהֹוָ֖ה אֶל־מֹשֶׁ֥ה לֵּאמֹֽר׃ קַ֚ח מֵֽאִתָּ֔ם וְהָי֕וּ לַעֲבֹ֕ד אֶת־עֲבֹדַ֖ת אֹ֣הֶל מוֹעֵ֑ד וְנָתַתָּ֤ה אוֹתָם֙ אֶל־הַלְוִיִּ֔ם אִ֖ישׁ כְּפִ֥י עֲבֹדָתֽוֹ׃ וַיִּקַּ֣ח מֹשֶׁ֔ה אֶת־הָעֲגָלֹ֖ת וְאֶת־הַבָּקָ֑ר וַיִּתֵּ֥ן אוֹתָ֖ם אֶל־הַלְוִיִּֽם׃ אֵ֣ת ׀ שְׁתֵּ֣י הָעֲגָל֗וֹת וְאֵת֙ אַרְבַּ֣עַת הַבָּקָ֔ר נָתַ֖ן לִבְנֵ֣י גֵרְשׁ֑וֹן כְּפִ֖י עֲבֹדָתָֽם׃ וְאֵ֣ת ׀ אַרְבַּ֣ע הָעֲגָלֹ֗ת וְאֵת֙ שְׁמֹנַ֣ת הַבָּקָ֔ר נָתַ֖ן לִבְנֵ֣י מְרָרִ֑י כְּפִי֙ עֲבֹ֣דָתָ֔ם בְּיַד֙ אִֽיתָמָ֔ר בֶּֽן־אַהֲרֹ֖ן הַכֹּהֵֽן׃ וְלִבְנֵ֥י קְהָ֖ת לֹ֣א נָתָ֑ן כִּֽי־עֲבֹדַ֤ת הַקֹּ֙דֶשׁ֙ עֲלֵהֶ֔ם בַּכָּתֵ֖ף יִשָּֽׂאוּ׃ וַיַּקְרִ֣יבוּ הַנְּשִׂאִ֗ים אֵ֚ת חֲנֻכַּ֣ת הַמִּזְבֵּ֔חַ בְּי֖וֹם הִמָּשַׁ֣ח אֹת֑וֹ וַיַּקְרִ֧יבוּ הַנְּשִׂיאִ֛ם אֶת־קׇרְבָּנָ֖ם לִפְנֵ֥י הַמִּזְבֵּֽחַ׃ וַיֹּ֥אמֶר יְהֹוָ֖ה אֶל־מֹשֶׁ֑ה נָשִׂ֨יא אֶחָ֜ד לַיּ֗וֹם נָשִׂ֤יא אֶחָד֙ לַיּ֔וֹם יַקְרִ֙יבוּ֙ אֶת־קׇרְבָּנָ֔ם לַחֲנֻכַּ֖ת הַמִּזְבֵּֽחַ׃ [ישראל]: וַיְהִ֗י הַמַּקְרִ֛יב בַּיּ֥וֹם הָרִאשׁ֖וֹן אֶת־קׇרְבָּנ֑וֹ נַחְשׁ֥וֹן בֶּן־עַמִּינָדָ֖ב לְמַטֵּ֥ה יְהוּדָֽה׃ וְקׇרְבָּנ֞וֹ קַֽעֲרַת־כֶּ֣סֶף אַחַ֗ת שְׁלֹשִׁ֣ים וּמֵאָה֮ מִשְׁקָלָהּ֒ מִזְרָ֤ק אֶחָד֙ כֶּ֔סֶף שִׁבְעִ֥ים שֶׁ֖קֶל בְּשֶׁ֣קֶל הַקֹּ֑דֶשׁ שְׁנֵיהֶ֣ם ׀ מְלֵאִ֗ים סֹ֛לֶת בְּלוּלָ֥ה בַשֶּׁ֖מֶן לְמִנְחָֽה׃ כַּ֥ף אַחַ֛ת עֲשָׂרָ֥ה זָהָ֖ב מְלֵאָ֥ה קְטֹֽרֶת׃ פַּ֣ר אֶחָ֞ד בֶּן־בָּקָ֗ר אַ֧יִל אֶחָ֛ד כֶּֽבֶשׂ־אֶחָ֥ד בֶּן־שְׁנָת֖וֹ לְעֹלָֽה׃ שְׂעִיר־עִזִּ֥ים אֶחָ֖ד לְחַטָּֽאת׃ וּלְזֶ֣בַח הַשְּׁלָמִים֮ בָּקָ֣ר שְׁנַ֒יִם֒ אֵילִ֤ם חֲמִשָּׁה֙ עַתּוּדִ֣ים חֲמִשָּׁ֔ה כְּבָשִׂ֥ים בְּנֵֽי־שָׁנָ֖ה חֲמִשָּׁ֑ה זֶ֛ה קׇרְבַּ֥ן נַחְשׁ֖וֹן בֶּן־עַמִּינָדָֽב׃");
				break;
			case 2:
				addToSiddurHighlighted(
					"בַּיּוֹם֙ הַשֵּׁנִ֔י הִקְרִ֖יב נְתַנְאֵ֣ל בֶּן־צוּעָ֑ר נְשִׂ֖יא יִשָּׂשכָֽר׃ הִקְרִ֨ב אֶת־קׇרְבָּנ֜וֹ קַֽעֲרַת־כֶּ֣סֶף אַחַ֗ת שְׁלֹשִׁ֣ים וּמֵאָה֮ מִשְׁקָלָהּ֒ מִזְרָ֤ק אֶחָד֙ כֶּ֔סֶף שִׁבְעִ֥ים שֶׁ֖קֶל בְּשֶׁ֣קֶל הַקֹּ֑דֶשׁ שְׁנֵיהֶ֣ם ׀ מְלֵאִ֗ים סֹ֛לֶת בְּלוּלָ֥ה בַשֶּׁ֖מֶן לְמִנְחָֽה׃ כַּ֥ף אַחַ֛ת עֲשָׂרָ֥ה זָהָ֖ב מְלֵאָ֥ה קְטֹֽרֶת׃ פַּ֣ר אֶחָ֞ד בֶּן־בָּקָ֗ר אַ֧יִל אֶחָ֛ד כֶּֽבֶשׂ־אֶחָ֥ד בֶּן־שְׁנָת֖וֹ לְעֹלָֽה׃ שְׂעִיר־עִזִּ֥ים אֶחָ֖ד לְחַטָּֽאת׃ וּלְזֶ֣בַח הַשְּׁלָמִים֮ בָּקָ֣ר שְׁנַ֒יִם֒ אֵילִ֤ם חֲמִשָּׁה֙ עַתֻּדִ֣ים חֲמִשָּׁ֔ה כְּבָשִׂ֥ים בְּנֵי־שָׁנָ֖ה חֲמִשָּׁ֑ה זֶ֛ה קׇרְבַּ֥ן נְתַנְאֵ֖ל בֶּן־צוּעָֽר׃");
				break;
			case 3:
				addToSiddurHighlighted(
					"בַּיּוֹם֙ הַשְּׁלִישִׁ֔י נָשִׂ֖יא לִבְנֵ֣י זְבוּלֻ֑ן אֱלִיאָ֖ב בֶּן־חֵלֹֽן׃ קׇרְבָּנ֞וֹ קַֽעֲרַת־כֶּ֣סֶף אַחַ֗ת שְׁלֹשִׁ֣ים וּמֵאָה֮ מִשְׁקָלָהּ֒ מִזְרָ֤ק אֶחָד֙ כֶּ֔סֶף שִׁבְעִ֥ים שֶׁ֖קֶל בְּשֶׁ֣קֶל הַקֹּ֑דֶשׁ שְׁנֵיהֶ֣ם ׀ מְלֵאִ֗ים סֹ֛לֶת בְּלוּלָ֥ה בַשֶּׁ֖מֶן לְמִנְחָֽה׃ כַּ֥ף אַחַ֛ת עֲשָׂרָ֥ה זָהָ֖ב מְלֵאָ֥ה קְטֹֽרֶת׃ פַּ֣ר אֶחָ֞ד בֶּן־בָּקָ֗ר אַ֧יִל אֶחָ֛ד כֶּֽבֶשׂ־אֶחָ֥ד בֶּן־שְׁנָת֖וֹ לְעֹלָֽה׃ שְׂעִיר־עִזִּ֥ים אֶחָ֖ד לְחַטָּֽאת׃ וּלְזֶ֣בַח הַשְּׁלָמִים֮ בָּקָ֣ר שְׁנַ֒יִם֒ אֵילִ֤ם חֲמִשָּׁה֙ עַתֻּדִ֣ים חֲמִשָּׁ֔ה כְּבָשִׂ֥ים בְּנֵי־שָׁנָ֖ה חֲמִשָּׁ֑ה זֶ֛ה קׇרְבַּ֥ן אֱלִיאָ֖ב בֶּן־חֵלֹֽן׃");
				break;
			case 4:
				addToSiddurHighlighted(
					"בַּיּוֹם הָרְבִיעִי נָשִׂיא לִבְנֵי רְאוּבֵן אֱלִיצוּר בֶּן־שְׁדֵיאוּר: קָרְבָּנוֹ קַעֲרַת־כֶּסֶף אַחַת שְׁלֹשִׁים וּמֵאָה מִשְׁקָלָהּ מִזְרָק אֶחָד כֶּסֶף שִׁבְעִים שֶׁקֶל בְּשֶׁקֶל הַקֹּדֶשׁ שְׁנֵיהֶם מְלֵאִים סֹלֶת בְּלוּלָה בַשֶּׁמֶן לְמִנְחָה: כַּף אַחַת עֲשָׂרָה זָהָב מְלֵאָה קְטֹרֶת: פַּר אֶחָד בֶּן־בָּקָר אַיִל אֶחָד כֶּבֶשׂ אֶחָד בֶּן־שְׁנָתוֹ לְעֹלָה: שְׂעִיר־עִזִּים אֶחָד לְחַטָּאת: וּלְזֶבַח הַשְּׁלָמִים בָּקָר שְׁנַיִם אֵילִם חֲמִשָּׁה עַתֻּדִים חֲמִשָּׁה כְּבָשִׂים בְּנֵי־שָׁנָה חֲמִשָּׁה זֶה קָרְבַּן אֱלִיצוּר בֶּן־שְׁדֵיאוּר:");
				break;
			case 5:
				addToSiddurHighlighted(
					"בַּיּוֹם֙ הָרְבִיעִ֔י נָשִׂ֖יא לִבְנֵ֣י רְאוּבֵ֑ן אֱלִיצ֖וּר בֶּן־שְׁדֵיאֽוּר׃ קׇרְבָּנ֞וֹ קַֽעֲרַת־כֶּ֣סֶף אַחַ֗ת שְׁלֹשִׁ֣ים וּמֵאָה֮ מִשְׁקָלָהּ֒ מִזְרָ֤ק אֶחָד֙ כֶּ֔סֶף שִׁבְעִ֥ים שֶׁ֖קֶל בְּשֶׁ֣קֶל הַקֹּ֑דֶשׁ שְׁנֵיהֶ֣ם ׀ מְלֵאִ֗ים סֹ֛לֶת בְּלוּלָ֥ה בַשֶּׁ֖מֶן לְמִנְחָֽה׃ כַּ֥ף אַחַ֛ת עֲשָׂרָ֥ה זָהָ֖ב מְלֵאָ֥ה קְטֹֽרֶת׃ פַּ֣ר אֶחָ֞ד בֶּן־בָּקָ֗ר אַ֧יִל אֶחָ֛ד כֶּֽבֶשׂ־אֶחָ֥ד בֶּן־שְׁנָת֖וֹ לְעֹלָֽה׃ שְׂעִיר־עִזִּ֥ים אֶחָ֖ד לְחַטָּֽאת׃ וּלְזֶ֣בַח הַשְּׁלָמִים֮ בָּקָ֣ר שְׁנַ֒יִם֒ אֵילִ֤ם חֲמִשָּׁה֙ עַתֻּדִ֣ים חֲמִשָּׁ֔ה כְּבָשִׂ֥ים בְּנֵֽי־שָׁנָ֖ה חֲמִשָּׁ֑ה זֶ֛ה קׇרְבַּ֥ן אֱלִיצ֖וּר בֶּן־שְׁדֵיאֽוּר׃");
				break;
			case 6:
				addToSiddurHighlighted(
					"בַּיּוֹם֙ הַשִּׁשִּׁ֔י נָשִׂ֖יא לִבְנֵ֣י גָ֑ד אֶלְיָסָ֖ף בֶּן־דְּעוּאֵֽל׃ קׇרְבָּנ֞וֹ קַֽעֲרַת־כֶּ֣סֶף אַחַ֗ת שְׁלֹשִׁ֣ים וּמֵאָה֮ מִשְׁקָלָהּ֒ מִזְרָ֤ק אֶחָד֙ כֶּ֔סֶף שִׁבְעִ֥ים שֶׁ֖קֶל בְּשֶׁ֣קֶל הַקֹּ֑דֶשׁ שְׁנֵיהֶ֣ם ׀ מְלֵאִ֗ים סֹ֛לֶת בְּלוּלָ֥ה בַשֶּׁ֖מֶן לְמִנְחָֽה׃ כַּ֥ף אַחַ֛ת עֲשָׂרָ֥ה זָהָ֖ב מְלֵאָ֥ה קְטֹֽרֶת׃ פַּ֣ר אֶחָ֞ד בֶּן־בָּקָ֗ר אַ֧יִל אֶחָ֛ד כֶּֽבֶשׂ־אֶחָ֥ד בֶּן־שְׁנָת֖וֹ לְעֹלָֽה׃ שְׂעִיר־עִזִּ֥ים אֶחָ֖ד לְחַטָּֽאת׃ וּלְזֶ֣בַח הַשְּׁלָמִים֮ בָּקָ֣ר שְׁנַ֒יִם֒ אֵילִ֤ם חֲמִשָּׁה֙ עַתֻּדִ֣ים חֲמִשָּׁ֔ה כְּבָשִׂ֥ים בְּנֵי־שָׁנָ֖ה חֲמִשָּׁ֑ה זֶ֛ה קׇרְבַּ֥ן אֶלְיָסָ֖ף בֶּן־דְּעוּאֵֽל׃");
				break;
			case 7:
				addToSiddurHighlighted(
					"בַּיּוֹם֙ הַשְּׁבִיעִ֔י נָשִׂ֖יא לִבְנֵ֣י אֶפְרָ֑יִם אֱלִֽישָׁמָ֖ע בֶּן־עַמִּיהֽוּד׃ קׇרְבָּנ֞וֹ קַֽעֲרַת־כֶּ֣סֶף אַחַ֗ת שְׁלֹשִׁ֣ים וּמֵאָה֮ מִשְׁקָלָהּ֒ מִזְרָ֤ק אֶחָד֙ כֶּ֔סֶף שִׁבְעִ֥ים שֶׁ֖קֶל בְּשֶׁ֣קֶל הַקֹּ֑דֶשׁ שְׁנֵיהֶ֣ם ׀ מְלֵאִ֗ים סֹ֛לֶת בְּלוּלָ֥ה בַשֶּׁ֖מֶן לְמִנְחָֽה׃ כַּ֥ף אַחַ֛ת עֲשָׂרָ֥ה זָהָ֖ב מְלֵאָ֥ה קְטֹֽרֶת׃ פַּ֣ר אֶחָ֞ד בֶּן־בָּקָ֗ר אַ֧יִל אֶחָ֛ד כֶּֽבֶשׂ־אֶחָ֥ד בֶּן־שְׁנָת֖וֹ לְעֹלָֽה׃ שְׂעִיר־עִזִּ֥ים אֶחָ֖ד לְחַטָּֽאת׃ וּלְזֶ֣בַח הַשְּׁלָמִים֮ בָּקָ֣ר שְׁנַ֒יִם֒ אֵילִ֤ם חֲמִשָּׁה֙ עַתֻּדִ֣ים חֲמִשָּׁ֔ה כְּבָשִׂ֥ים בְּנֵֽי־שָׁנָ֖ה חֲמִשָּׁ֑ה זֶ֛ה קׇרְבַּ֥ן אֱלִישָׁמָ֖ע בֶּן־עַמִּיהֽוּד׃");
				break;
			case 8:
				addToSiddurHighlighted(
					"בַּיּוֹם֙ הַשְּׁמִינִ֔י נָשִׂ֖יא לִבְנֵ֣י מְנַשֶּׁ֑ה גַּמְלִיאֵ֖ל בֶּן־פְּדָהצֽוּר׃ קׇרְבָּנ֞וֹ קַֽעֲרַת־כֶּ֣סֶף אַחַ֗ת שְׁלֹשִׁ֣ים וּמֵאָה֮ מִשְׁקָלָהּ֒ מִזְרָ֤ק אֶחָד֙ כֶּ֔סֶף שִׁבְעִ֥ים שֶׁ֖קֶל בְּשֶׁ֣קֶל הַקֹּ֑דֶשׁ שְׁנֵיהֶ֣ם ׀ מְלֵאִ֗ים סֹ֛לֶת בְּלוּלָ֥ה בַשֶּׁ֖מֶן לְמִנְחָֽה׃ כַּ֥ף אַחַ֛ת עֲשָׂרָ֥ה זָהָ֖ב מְלֵאָ֥ה קְטֹֽרֶת׃ פַּ֣ר אֶחָ֞ד בֶּן־בָּקָ֗ר אַ֧יִל אֶחָ֛ד כֶּֽבֶשׂ־אֶחָ֥ד בֶּן־שְׁנָת֖וֹ לְעֹלָֽה׃ שְׂעִיר־עִזִּ֥ים אֶחָ֖ד לְחַטָּֽאת׃ וּלְזֶ֣בַח הַשְּׁלָמִים֮ בָּקָ֣ר שְׁנַ֒יִם֒ אֵילִ֤ם חֲמִשָּׁה֙ עַתֻּדִ֣ים חֲמִשָּׁ֔ה כְּבָשִׂ֥ים בְּנֵי־שָׁנָ֖ה חֲמִשָּׁ֑ה זֶ֛ה קׇרְבַּ֥ן גַּמְלִיאֵ֖ל בֶּן־פְּדָהצֽוּר׃ בַּיּוֹם֙ הַתְּשִׁיעִ֔י נָשִׂ֖יא לִבְנֵ֣י בִנְיָמִ֑ן אֲבִידָ֖ן בֶּן־גִּדְעֹנִֽי׃ קׇרְבָּנ֞וֹ קַֽעֲרַת־כֶּ֣סֶף אַחַ֗ת שְׁלֹשִׁ֣ים וּמֵאָה֮ מִשְׁקָלָהּ֒ מִזְרָ֤ק אֶחָד֙ כֶּ֔סֶף שִׁבְעִ֥ים שֶׁ֖קֶל בְּשֶׁ֣קֶל הַקֹּ֑דֶשׁ שְׁנֵיהֶ֣ם ׀ מְלֵאִ֗ים סֹ֛לֶת בְּלוּלָ֥ה בַשֶּׁ֖מֶן לְמִנְחָֽה׃ כַּ֥ף אַחַ֛ת עֲשָׂרָ֥ה זָהָ֖ב מְלֵאָ֥ה קְטֹֽרֶת׃ פַּ֣ר אֶחָ֞ד בֶּן־בָּקָ֗ר אַ֧יִל אֶחָ֛ד כֶּֽבֶשׂ־אֶחָ֥ד בֶּן־שְׁנָת֖וֹ לְעֹלָֽה׃ שְׂעִיר־עִזִּ֥ים אֶחָ֖ד לְחַטָּֽאת׃ וּלְזֶ֣בַח הַשְּׁלָמִים֮ בָּקָ֣ר שְׁנַ֒יִם֒ אֵילִ֤ם חֲמִשָּׁה֙ עַתֻּדִ֣ים חֲמִשָּׁ֔ה כְּבָשִׂ֥ים בְּנֵי־שָׁנָ֖ה חֲמִשָּׁ֑ה זֶ֛ה קׇרְבַּ֥ן אֲבִידָ֖ן בֶּן־גִּדְעֹנִֽי׃ בַּיּוֹם֙ הָעֲשִׂירִ֔י נָשִׂ֖יא לִבְנֵ֣י דָ֑ן אֲחִיעֶ֖זֶר בֶּן־עַמִּישַׁדָּֽי׃ קׇרְבָּנ֞וֹ קַֽעֲרַת־כֶּ֣סֶף אַחַ֗ת שְׁלֹשִׁ֣ים וּמֵאָה֮ מִשְׁקָלָהּ֒ מִזְרָ֤ק אֶחָד֙ כֶּ֔סֶף שִׁבְעִ֥ים שֶׁ֖קֶל בְּשֶׁ֣קֶל הַקֹּ֑דֶשׁ שְׁנֵיהֶ֣ם ׀ מְלֵאִ֗ים סֹ֛לֶת בְּלוּלָ֥ה בַשֶּׁ֖מֶן לְמִנְחָֽה׃ כַּ֥ף אַחַ֛ת עֲשָׂרָ֥ה זָהָ֖ב מְלֵאָ֥ה קְטֹֽרֶת׃ פַּ֣ר אֶחָ֞ד בֶּן־בָּקָ֗ר אַ֧יִל אֶחָ֛ד כֶּֽבֶשׂ־אֶחָ֥ד בֶּן־שְׁנָת֖וֹ לְעֹלָֽה׃ שְׂעִיר־עִזִּ֥ים אֶחָ֖ד לְחַטָּֽאת׃ וּלְזֶ֣בַח הַשְּׁלָמִים֮ בָּקָ֣ר שְׁנַ֒יִם֒ אֵילִ֤ם חֲמִשָּׁה֙ עַתֻּדִ֣ים חֲמִשָּׁ֔ה כְּבָשִׂ֥ים בְּנֵֽי־שָׁנָ֖ה חֲמִשָּׁ֑ה זֶ֛ה קׇרְבַּ֥ן אֲחִיעֶ֖זֶר בֶּן־עַמִּישַׁדָּֽי׃ בְּיוֹם֙ עַשְׁתֵּ֣י עָשָׂ֣ר י֔וֹם נָשִׂ֖יא לִבְנֵ֣י אָשֵׁ֑ר פַּגְעִיאֵ֖ל בֶּן־עׇכְרָֽן׃ קׇרְבָּנ֞וֹ קַֽעֲרַת־כֶּ֣סֶף אַחַ֗ת שְׁלֹשִׁ֣ים וּמֵאָה֮ מִשְׁקָלָהּ֒ מִזְרָ֤ק אֶחָד֙ כֶּ֔סֶף שִׁבְעִ֥ים שֶׁ֖קֶל בְּשֶׁ֣קֶל הַקֹּ֑דֶשׁ שְׁנֵיהֶ֣ם ׀ מְלֵאִ֗ים סֹ֛לֶת בְּלוּלָ֥ה בַשֶּׁ֖מֶן לְמִנְחָֽה׃ כַּ֥ף אַחַ֛ת עֲשָׂרָ֥ה זָהָ֖ב מְלֵאָ֥ה קְטֹֽרֶת׃ פַּ֣ר אֶחָ֞ד בֶּן־בָּקָ֗ר אַ֧יִל אֶחָ֛ד כֶּֽבֶשׂ־אֶחָ֥ד בֶּן־שְׁנָת֖וֹ לְעֹלָֽה׃ שְׂעִיר־עִזִּ֥ים אֶחָ֖ד לְחַטָּֽאת׃ וּלְזֶ֣בַח הַשְּׁלָמִים֮ בָּקָ֣ר שְׁנַ֒יִם֒ אֵילִ֤ם חֲמִשָּׁה֙ עַתֻּדִ֣ים חֲמִשָּׁ֔ה כְּבָשִׂ֥ים בְּנֵֽי־שָׁנָ֖ה חֲמִשָּׁ֑ה זֶ֛ה קׇרְבַּ֥ן פַּגְעִיאֵ֖ל בֶּן־עׇכְרָֽן׃ בְּיוֹם֙ שְׁנֵ֣ים עָשָׂ֣ר י֔וֹם נָשִׂ֖יא לִבְנֵ֣י נַפְתָּלִ֑י אֲחִירַ֖ע בֶּן־עֵינָֽן׃ קׇרְבָּנ֞וֹ קַֽעֲרַת־כֶּ֣סֶף אַחַ֗ת שְׁלֹשִׁ֣ים וּמֵאָה֮ מִשְׁקָלָהּ֒ מִזְרָ֤ק אֶחָד֙ כֶּ֔סֶף שִׁבְעִ֥ים שֶׁ֖קֶל בְּשֶׁ֣קֶל הַקֹּ֑דֶשׁ שְׁנֵיהֶ֣ם ׀ מְלֵאִ֗ים סֹ֛לֶת בְּלוּלָ֥ה בַשֶּׁ֖מֶן לְמִנְחָֽה׃ כַּ֥ף אַחַ֛ת עֲשָׂרָ֥ה זָהָ֖ב מְלֵאָ֥ה קְטֹֽרֶת׃ פַּ֣ר אֶחָ֞ד בֶּן־בָּקָ֗ר אַ֧יִל אֶחָ֛ד כֶּֽבֶשׂ־אֶחָ֥ד בֶּן־שְׁנָת֖וֹ לְעֹלָֽה׃ שְׂעִיר־עִזִּ֥ים אֶחָ֖ד לְחַטָּֽאת׃ וּלְזֶ֣בַח הַשְּׁלָמִים֮ בָּקָ֣ר שְׁנַ֒יִם֒ אֵילִ֤ם חֲמִשָּׁה֙ עַתֻּדִ֣ים חֲמִשָּׁ֔ה כְּבָשִׂ֥ים בְּנֵֽי־שָׁנָ֖ה חֲמִשָּׁ֑ה זֶ֛ה קׇרְבַּ֥ן אֲחִירַ֖ע בֶּן־עֵינָֽן׃ זֹ֣את ׀ חֲנֻכַּ֣ת הַמִּזְבֵּ֗חַ בְּיוֹם֙ הִמָּשַׁ֣ח אֹת֔וֹ מֵאֵ֖ת נְשִׂיאֵ֣י יִשְׂרָאֵ֑ל קַעֲרֹ֨ת כֶּ֜סֶף שְׁתֵּ֣ים עֶשְׂרֵ֗ה מִֽזְרְקֵי־כֶ֙סֶף֙ שְׁנֵ֣ים עָשָׂ֔ר כַּפּ֥וֹת זָהָ֖ב שְׁתֵּ֥ים עֶשְׂרֵֽה׃ שְׁלֹשִׁ֣ים וּמֵאָ֗ה הַקְּעָרָ֤ה הָֽאַחַת֙ כֶּ֔סֶף וְשִׁבְעִ֖ים הַמִּזְרָ֣ק הָאֶחָ֑ד כֹּ֚ל כֶּ֣סֶף הַכֵּלִ֔ים אַלְפַּ֥יִם וְאַרְבַּע־מֵא֖וֹת בְּשֶׁ֥קֶל הַקֹּֽדֶשׁ׃ כַּפּ֨וֹת זָהָ֤ב שְׁתֵּים־עֶשְׂרֵה֙ מְלֵאֹ֣ת קְטֹ֔רֶת עֲשָׂרָ֧ה עֲשָׂרָ֛ה הַכַּ֖ף בְּשֶׁ֣קֶל הַקֹּ֑דֶשׁ כׇּל־זְהַ֥ב הַכַּפּ֖וֹת עֶשְׂרִ֥ים וּמֵאָֽה׃ כׇּל־הַבָּקָ֨ר לָעֹלָ֜ה שְׁנֵ֧ים עָשָׂ֣ר פָּרִ֗ים אֵילִ֤ם שְׁנֵים־עָשָׂר֙ כְּבָשִׂ֧ים בְּנֵֽי־שָׁנָ֛ה שְׁנֵ֥ים עָשָׂ֖ר וּמִנְחָתָ֑ם וּשְׂעִירֵ֥י עִזִּ֛ים שְׁנֵ֥ים עָשָׂ֖ר לְחַטָּֽאת׃ וְכֹ֞ל בְּקַ֣ר ׀ זֶ֣בַח הַשְּׁלָמִ֗ים עֶשְׂרִ֣ים וְאַרְבָּעָה֮ פָּרִים֒ אֵילִ֤ם שִׁשִּׁים֙ עַתֻּדִ֣ים שִׁשִּׁ֔ים כְּבָשִׂ֥ים בְּנֵי־שָׁנָ֖ה שִׁשִּׁ֑ים זֹ֚את חֲנֻכַּ֣ת הַמִּזְבֵּ֔חַ אַחֲרֵ֖י הִמָּשַׁ֥ח אֹתֽוֹ׃ וּבְבֹ֨א מֹשֶׁ֜ה אֶל־אֹ֣הֶל מוֹעֵד֮ לְדַבֵּ֣ר אִתּוֹ֒ וַיִּשְׁמַ֨ע אֶת־הַקּ֜וֹל מִדַּבֵּ֣ר אֵלָ֗יו מֵעַ֤ל הַכַּפֹּ֙רֶת֙ אֲשֶׁר֙ עַל־אֲרֹ֣ן הָעֵדֻ֔ת מִבֵּ֖ין שְׁנֵ֣י הַכְּרֻבִ֑ים וַיְדַבֵּ֖ר אֵלָֽיו׃ וַיְדַבֵּ֥ר יְהֹוָ֖ה אֶל־מֹשֶׁ֥ה לֵּאמֹֽר׃ דַּבֵּר֙ אֶֽל־אַהֲרֹ֔ן וְאָמַרְתָּ֖ אֵלָ֑יו בְּהַעֲלֹֽתְךָ֙ אֶת־הַנֵּרֹ֔ת אֶל־מוּל֙ פְּנֵ֣י הַמְּנוֹרָ֔ה יָאִ֖ירוּ שִׁבְעַ֥ת הַנֵּרֽוֹת׃ וַיַּ֤עַשׂ כֵּן֙ אַהֲרֹ֔ן אֶל־מוּל֙ פְּנֵ֣י הַמְּנוֹרָ֔ה הֶעֱלָ֖ה נֵרֹתֶ֑יהָ כַּֽאֲשֶׁ֛ר צִוָּ֥ה יְהֹוָ֖ה אֶת־מֹשֶֽׁה׃ וְזֶ֨ה מַעֲשֵׂ֤ה הַמְּנֹרָה֙ מִקְשָׁ֣ה זָהָ֔ב עַד־יְרֵכָ֥הּ עַד־פִּרְחָ֖הּ מִקְשָׁ֣ה הִ֑וא כַּמַּרְאֶ֗ה אֲשֶׁ֨ר הֶרְאָ֤ה יְהֹוָה֙ אֶת־מֹשֶׁ֔ה כֵּ֥ן עָשָׂ֖ה אֶת־הַמְּנֹרָֽה׃");
				break;
			default:
				break;
		}
	}

	private void addFastSelichot() {
		if (!jewishDateInfo.getJewishCalendar().isTaanis())
			return;

		addCategoryToSiddur("סליחות");
		boolean isDachuy = (jewishDateInfo.getJewishCalendar().getJewishMonth() == JewishDate.TISHREI
				&& jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 4
				&& jewishDateInfo.getJewishCalendar().getDayOfWeek() == Calendar.SUNDAY)
				||
				(jewishDateInfo.getJewishCalendar().getJewishMonth() == JewishDate.ADAR
						&& !jewishDateInfo.getJewishCalendar().isJewishLeapYear()
						&& (jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 11
								|| jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 12)
						&& jewishDateInfo.getJewishCalendar().getDayOfWeek() == Calendar.THURSDAY)
				||
				(jewishDateInfo.getJewishCalendar().getJewishMonth() == JewishDate.ADAR_II
						&& jewishDateInfo.getJewishCalendar().isJewishLeapYear()
						&& (jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 11
								|| jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 12)
						&& jewishDateInfo.getJewishCalendar().getDayOfWeek() == Calendar.THURSDAY);

		switch (jewishDateInfo.getJewishCalendar().getYomTovIndex()) {
			case JewishCalendar.FAST_OF_GEDALYAH:
				addToSiddurHighlighted(
					"עַל יְדֵי רַחֲמֶיךָ הָרַבִּים סְלַח לָנוּ אָבִֽינוּ, כִּי בְרוֹב אִוַּלְתֵּנוּ שָׁגִֽינוּ: מְחֹל לָנוּ מַלְכֵּנוּ, כִּי רַבּוּ עֲוֹנֵֽינוּ: אֵל אֶרֶךְ אַפַּיִם אַתָּה, וְדֶרֶךְ תְּשׁוּבָה לָנוּ הוֹרֵיתָ: גְּדֻלַּת רַחֲמֶיךָ וַחֲסָדֶיךָ, תִּזְכּוֹר הַיּוֹם לְזֶרַע יְדִידֶיךָ: תֵּפֶן אֵלֵֽינוּ בְּרַחֲמִים, כִּי אַתָּה הוּא בַּעַל הָרַחֲמִים: בְּתַחֲנוּן וּבִתְפִלָּה נְקַדֵּם, כְּמוֹ שֶׁהוֹדַעְתָּ לֶעָנָו מִקֶּדֶם: וּמֵחֲרוֹן אַפְּךָ תָּשׁוּב, כְּמוֹ בְּתוֹרָֽתְךָ כָּתוּב: וּבְצֵל כְּנָפֶיךָ נֶחֱסֶה וְנִתְלוֹנָן, כְּיוֹם וַיֵּ֤רֶד יְהֹוָה֙ בֶּֽעָנָ֔ן: תַּעֲבֹר עַל פֶּשַׁע וְתִמְחֹל אָשָׁם, כְּיוֹם וַיִּתְיַצֵּ֥ב עִמּ֖וֹ שָׁ֑ם: תַּאֲזִין שֶׁוַע וְתָּקְשִׁיב בְּרָצוֹן מַאֲמָר, כְּיוֹם וַיִּקְרָ֥א בְשֵׁ֖ם יְהֹוָֽה: וְשָׁם נֶאֱמַר: \n\n" +
					vayavor + "\n\n" +
					"אָֽבְלָה נַפְשִׁי וְחָשַׁךְ תָּאֳרִי, בֵּית תִּפְאַרְתִּי נִשְׂרַף בְּיַד הָאֲרִי, גַּם פְּלֵטִים אֲשֶׁר עָֽזְבוּ שְׁאֵרִי, דּוֹעֲכוּ הַיּוֹם בִּשְׁלֹשָׁה בְתִשְׁרִי: הַמַּיִם הַזֵּדוֹנִים שְׁטָפוּנוּ בְּדָלְקָם, וּבוֹסְסוּ צָרִים מִקְדָּשִׁי וּבָֽזְזוּ חֶלְקָם, זִקְנֵי שְׁאֵרִית אֲשֶׁר נִמְלְטוּ בְּיוֹם נָקָם, חֻבְּלוּ הַיּוֹם עִם גְּדַלְיָה בֶּן אֲחִיקָם: טוֹרְפוּ עֲנִיֵּי עַם הָאָרֶץ, יֶתֶר הַגָּזָם אָכַל הָאַרְבֶּה בְּמֶרֶץ, כּוֹרְמִים וְיוֹגְבִים אֲשֶׁר הִפְקִיד נְגִיד הָאָרֶץ, לֻקְּטוּ הַיּוֹם וְלֹא הָיָה בָהֶם גּוֹדֵר גָּדֵר וְעוֹמֵד בַּפֶּרֶץ: מָה אֲסַפֵּר וְאַנְחוֹתַי עֲצוּמוֹת, נָֽקְטָה נַפְשִׁי וּמִקְהֲלוֹתַי עֲגוּמוֹת, שְׂרִידַי אֲשֶׁר נִשְׁאֲרוּ מֵחֶרֶב וְחֵמוֹת, עוֹד הֵם לֹא נִתְקַיְּמוּ וְנוֹתְצוּ בַחוֹמוֹת: פָּנֶיךָ עַד אָנָה מִמֶּנּוּ תַסְתִּיר, צַוְחָתֵנוּ תִּשְׁמַע וְכַבְלֵנוּ תַתִּיר, קָדוֹשׁ הַבִּיטָה בְעֹנְיֵנוּ כִּי אֵין לָנוּ מַכְתִּיר, רְאֵה דַלּוּתֵנוּ וְשֶׁבַח לְפָנֶיךָ נַעְתִּיר: שֻׁדַּדְנוּ מִדּוֹר לְדוֹר וּמִקֵּץ לְקֵץ, שֹׁרֶשׁ צֶפַע אוֹתָנוּ עִקֵּץ, תַּקִּיף לְמִשְׁפָּטֶיךָ הָעִירָה וְהָקֵץ, וּתְכַפֵּר חַטֹּאתֵֽינוּ וְתֹאמַר לְקָרֵב קֵץ: יֶהֱמוּ רַחֲמֶיךָ עַל מְעוּטֵי עַמִּים, וְשַׂגְּבֵם בְּחַסְדֶּךָ לְעֵינֵי כָל לְאֻמִּים, פְּלָאֶיךָ הַרְאֵם שׁוֹכֵן מְרוֹמִים, אֵל מֶלֶךְ יוֹשֵׁב עַל כִּסֵּא רַחֲמִים:"
						.replace(isDachuy ? "בִּשְׁלֹשָׁה בְתִשְׁרִי" : "@",
							"בַּיּ֣וֹם שְׁלֹשָׁה בְתִשְׁרִי"));
				break;
			case JewishCalendar.TENTH_OF_TEVES:
				addToSiddurHighlighted(
					"וָאָרֶץ שָׁפַל רוּמִי, וְגָדַל שִׁבְרִי, מְשׁוֹמֵם אֵשֵׁב, יוֹם סָמַךְ הָאֲרִי, עַל צְבִי הַר קֹדֶשׁ צִיּוֹן עִירִי, לָכֵן אֲקוֹנֵן וְאֶתְאַבֵּל בַּחֹדֶשׁ הָעֲשִׂירִי: בַּחֹדֶשׁ הָעֲשִׂירִי אַרְיֵה עָלָה בְחֵמָה, בֶּעָשׂוֹר לַחֹדֶשׁ בָּנָה עָלַי חוֹמָה, גָּשׁ הוּא וְכָל־עַמּוֹ לַעֲשׂוֹת בְּעַמִּי נְקָמָה, וַיַּעַרְכוּ אִתָּם מִלְחָמָה: מִלְחָמָה שִׁית מִשְׂגַּבִּי וּמוֹשִׁיעִי, בְּאוֹיְבִי וּמַכְנִיעִי, כּוֹס מָלֵא מֶסֶךְ הַשְׁקֵם יְהֹוָה רוֹעִי, מָגִּנִּי וְקֶרֶן יִשְׁעִי: \n\n" +
					"בַּחֹדֶשׁ הָעֲשִׂירִי דְּלָקַנִי אוֹיֵב בַּחֶרֶב, בֶּעָשׂוֹר לַחֹדֶשׁ הֵכִין עָלַי אוֹרֵב, וְעַל זֹאת אֲקוֹנֵן וְגִילִי עָרֵב, אוֹי לָנוּ כִּי פָנָה הַיּוֹם, כִּי יִנָּטוּ צִלְלֵי־עָרֶב: עֶרֶב יֵהָפֵךְ לְבֹקֶר וּבוֹגְדִים אַל יַעֲלוּ עָל, חֹן עַל עַמְּךָ וְלִכְאֵבָם הַעֲלֵה תַעַל, זְכֹר־לִי בְּרִית אָבוֹת, בְּפָּרְשִׂי לְךָ כַּף וְשַׁעַל, מֵמִית וּמְחַיֶּה, מוֹרִיד שְׁאוֹל וַיָּעַל: \n\n" +
					"בַּחֹדֶשׁ הָעֲשִׂירִי זְאֵב עֲרָבוֹת עַל עַמִּי נוֹהֵם, בֶּעָשׂוֹר לַחֹדֶשׁ חָנָה בְחֵילוֹ עֲלֵיהם, טָרֹף טֹרַף כָּל־הַיּוֹצֵא מֵהֶם, נָמֵר שֹׁקֵד עַל עָרֵיהֶם: עָרֵיהֶם שָֽׂרְפוּ בָאֵשׁ בִּרְבוֹת תְּלָאוֹת, רוּמָה יְהֹוָה בְּעֻזֶּךָ זֵדִים לְהַשְׁאוֹת, בּוֹשׁ יֵבוֹשׁוּ בַּעֲשׂוֹתְךָ עִמָּנוּ לְטוֹבָה אוֹת, קְדוֹשׁ יִשְׂרָאֵל יְהֹוָה צְבָאוֹת: \n\n" +
					"בַּחֹדֶשׁ הָעֲשִׂירִי יְדֵי צַר הֶחֱזִֽיקוּ מָגֵן וְצִנָּה, בֶּעָשׂוֹר לַחֹדֶשׁ כְּאִישׁ עָרוּךְ לַמִּלְחָמָה עַל קִרְיָה נֶאֱמָנָה, לְזֹאת חִגְרִי שַׂק עֵדָה עֲדִינָה, גָּזִּי נִזְרֵךְ וְהַשְׁלִיכִי, וּשְׂאִי עַל שְׁפָיִם קִינָה: קִינָה דוֹבֵר עַמְּךָ בְּיוֹם זֶה לְעֻמָּתֶךָ, וְעַפְעַפֵּֽינוּ יִזְּלוּ מַיִם עַל חָרְבָּן בֵּיתֶךָ, יוֹם נָקָם תָּעִיר לְצָּרִים הוֹמִים בְּבֵיתֶךָ, דְּרָכֶיךָ יְהֹוָה הוֹדִיעֵנִי וְלַמְּדֵנִי אוֹרְחוֹתֶיךָ: \n\n" +
					"בַּחֹדֶשׁ הָעֲשִׂירִי מֹנַי שָֽׁפְכוּ עַל עִירִי סוֹלְלָה, בֶּעָשׂוֹר לַחֹדֶשׁ נִזְרִי הַשְׁלַךְ וְתִפְאַרְתִּי נָֽפְלָה, סְבָבוּנִי הָעֹשִׂים מַכָּתִי נַחְלָה, מֵעַי מֵעַי אוֹחִילָה: אוֹחִילָה יוֹם זֶה לְנַעֲרָץ בְּסוֹד קְדוֹשִׁים רַבָּה, וַאֲחַלֶּה פָנָיו לַעֲבֹר עַל פֶּשַׁע וְחוֹבָה, אַל תֵּפֶן לְרִשְׁעֵנוּ וּמְחֵה חַטָּאת כְּתוּבָה, הֲשִׁיבֵנוּ יְהֹוָה אֵלֶיךָ וְנָשׁוּבָה: \n\n" +
					"עַל יְדֵי רַחֲמֶיךָ הָרַבִּים סְלַח לָנוּ אָבִֽינוּ, כִּי בְרֹב אִוַּלְתֵּנוּ שָׁגִֽינוּ: מְחֹל לָנוּ מַלְכֵּנוּ, כִּי רַבּוּ עֲוֹנֵֽינוּ: אֵל אֶרֶךְ אַפַּיִם אַתָּה, וְדֶרֶךְ תְּשׁוּבָה לָנוּ הוֹרֵיתָ: גְּדֻלַּת רַחֲמֶיךָ וַחֲסָדֶיךָ, תִּזְכֹּר הַיּוֹם לְזֶרַע יְדִידֶיךָ: תֵּפֶן אֵלֵֽינוּ בְּרַחֲמִים, כִּי אַתָּה הוּא בַּעַל הָרַחֲמִים: בְּתַחֲנוּן וּבִתְפִלָּה נְקַדֵּם, כְּמוֹ שֶׁהוֹדַעְתָּ לֶעָנָו מִקֶּדֶם: וּמֵחֲרוֹן אַפְּךָ תָּשׁוּב, כְּמוֹ בְּתוֹרָֽתְךָ כָּתוּב: וּבְצֵל כְּנָפֶיךָ נֶחֱסֶה וְנִתְלוֹנָן, כְּיוֹם וַיֵּ֤רֶד יְהֹוָה֙ בֶּֽעָנָ֔ן: תַּעֲבוֹר עַל פֶּשַׁע וְתִמְחֹל אָשָׁם, כְּיוֹם וַיִּתְיַצֵּ֥ב עִמּ֖וֹ שָׁ֑ם: תַּאֲזִין שֶׁוַע וְתַקְשִׁיב בְּרָצוֹן מַאֲמָר, כְּיוֹם וַיִּקְרָ֥א בְשֵׁ֖ם יְהֹוָֽה: וְשָׁם נֶאֱמַר: \n\n"
					+
					vayavor + "\n\n" +
					"על סדר א\"ב \n\n" +
					"אָז בְּבוֹא יוֹם פְּקֻדַּת גֵּיא הַמַּחֲזֶה, בַּחֲרוֹת אַף יְהֹוָה בְּרִשְׁפֵּי אַזֶּה, גִּלָּה בְּיַד בֶּן־בּוּזִי הַחוֹזֶה: כְּתׇוב־לְךָ֙ אֶת־שֵׁ֣ם הַיּ֔וֹם אֶת־עֶ֖צֶם הַיּ֣וֹם הַזֶּ֑ה: דִּבַּרְתִּי בְּאֵשׁ קִנְאָתִי בֵּית מְרִי לִסְפּוֹת, הִנְנִי אֵלֶיהָ בְּאַף וְרוּחַ זִלְעָפוֹת: וְשַׂמְתִּיהָ לְמָשָׁל וְלִשְׁנִינָה וְלַחֲרָפוֹת, שְׁפֹת הַסִּיר שְׁפֹת: זַלְעָפָה אָחֲזָה צִיּוֹן וְהֵיכָלֶיהָ, חָֽרְדָה רוּחָהּ נָמוֹגוּ חֲיָלֶיהָ, טֹרַף לִבָּהּ עֵת קְרֹא אֵלֶיהָ, אֱסֹ֤ף נְתָחֶ֙יהָ֙ אֵלֶ֔יהָ: יְרִיבֶיהָ אַעֲנִיק שְׁבִי וּמַלְקֹחַ, כֹּהֲנֶיהָ וּמֶרְקָחֶיהָ אֲשֶׁר רָֽקְחָה רָקֹחַ, לִשְׁבִי עוֹלָם מֵאֵין פְּקַח קֹחַ, מִבְחַ֤ר הַצֹּאן֙ לָק֔וֹחַ: מָֽשְׁלוּ בָךְ לָעֲגוּ מוֹשֶׁלֶת עַמִּים, נִקְרֵאת אָז נוֹדַעַתְ, מְאוּסַת עוֹלָמִים, שׂוֹטְנִים יַעֲנוּ בָךְ וְעָלַיִךְ נוֹאֲמִים, אוֹי֮ עִ֣יר הַדָּמִים֒: עָֽבְרָה עֲבֵרָה סָרָה הֵפֵרָה בְּרִית יָהּ, פָּֽשְׁעָה רָֽשְׁעָה טָֽבְעָה בְּבוֹר תַּחְתִּיָּה, צָעֲקָה וְלֹא שָׁמַע אֵל בִּכְיָהּ, כִּ֤י דָמָהּ֙ בְּתוֹכָ֣הּ הָיָ֔ה: קוֹל עֲשׁוּקֶיהָ שְׁמַע מִיַּד עוֹשְׁקָם, רִגְשָׁתָם וְצַוְחָתָם לֹא תָשִׁיב רֵיקָם, שִׁבְעָתַיִם תְּשַׁלֵּם כְּפָעֳלָם אֶל חֵיקָם, שֶׁ֨בַע ׀ יִפּ֣וֹל צַדִּ֣יק וָקָ֑ם: תָּעִֽינוּ בְרִשְׁעֵנוּ אֵל גָּדוֹל וְנוֹרָא, וְאִם גָּֽבְרוּ פְשָׁעֵֽינוּ חֶמְלָֽתְךָ גָֽבְרָה, רִחַמְתָּ וְכִמְעַט קָט כִּלִּיתָם בְּעֶבְרָה, צָרָ֖ה וְיָג֣וֹן אֶמְצָֽא, וּבְשֵֽׁם־יְהֹוָ֥ה אֶקְרָ֑א: יֶהֱמוּ רַחֲמֶיךָ עַל מְעוּטֵי עַמִּים, וְשַׂגְּבֵם בְּחַסְדְּךָ, לְעֵינֵי כָל־לְאֻמִּים, פְּלָאֶיךָ הַרְאֵם צוּר שׁוֹכֵן מְרוֹמִים, אֵל מֶלֶךְ יוֹשֵׁב עַל כִּסֵּא רַחֲמִים: \n\n" +
					"שְׁעֵה עֶלְיוֹן, לְקוֹל אֶבְיוֹן, וְשַׁוְעָתוֹ אַל תִּבְזֶה: לְבָבוֹ מַר, בְּיוֹם נֶאֱמַר, לְבֶן בּוּזִי הַחוֹזֶה: כְּתׇוב־לְךָ֙ אֶת־שֵׁ֣ם הַיּ֔וֹם אֶת־עֶ֖צֶם הַיּ֣וֹם הַזֶּ֑ה: יָהּ צְבָאוֹת, זְכוֹר תְּלָאוֹת, אֲשֶׁר צַר לִי מאֹד עֲלֵיהֶן: בְּמַזַּל גְּדִי, הֲלֹא בַעֲדִי, נֶאֶסְפוּ שְׁלֹשְׁתֵּיהֶן: וּבוֹ שֵׂיוֹת, הַדְּחוּיוֹת, חַל הַנֶּגֶף בָּהֶן: וּבוֹ סָמַךְ, מְנָאֵץ שְׁמָךְ, עַל קִרְיַת מְשׂוֹשֵׂיהֶן: וּבוֹ נֶאֱסַף רֹאשׁ הַסָּף, הוּא עֶזְרָא הַכֹּהֵן: כָּל־אֵלֶּה, קְרָאוּנִי וְרַבּוֹת כָּזֶה וְכָזֶה: אֲרִי עָלַז, בְּיוֹם הַלָּז, וְחֵץ קִלְקֵל לְמוּל עִירִי: וְקָם עֲשִׂירִי, בָּעֲשִׂירִי, לְשַׁחֵת כָּל־שְׁאָר הָעֲשִׂירִי: לְאַבֵּד כָֹּל, פְּרִי אֶשְׁכֹּל, וְלִלְקוֹט עִנְּבֵי נְזִירִי: וְעוֹד קָשׁוּר, אֲנִי לְאַשּׁוּר, אֲשֶׁר נִצָּב עַל צִירִי: אֲנִי נִגְדָּע, וְלֹא אֵדַע, לְמִי אֶבְכֶּה הֲזֶה אוֹ זֶה: סְמֹךְ עַמָּךְ, בְּיוֹם סָמַךְ, אֲרִי עַל עִיר צְבִי קֹדֶשׁ: שְׁעֵה שַׁוְעָם, מְחֵה פִשְׁעָם, בֶּעָשׂוֹר לַחֹדֶשׁ: וְהַמְּלוּכָה, הַנְּסוּכָה, כִּימֵי קֶדֶם חַדֵּשׁ: וְלִתְהִלָּה, כְּבַתְּחִלָּה, שִׁמְךָ יָהּ בָּנוּ קַדֵּשׁ: וְכָל־שׂוֹנֵא, וּמִתְאַנֶּה, בְּעֹז אַפְּךָ הָדֵּשׁ: וְיִלָּֽכְדוּ, וְיֹאבְדוּ, כְּיוֹם בָּרָק בְּעִיר קֶדֶשׁ: וְשׁוּב עֶלְיוֹן, לְעִיר צִיּוֹן, עַיִן בְּעַיִן נֶחֱזֶה: וְאָז נֹאמַר, בְּטוּב מַאֲמָר, הִנֵּה אֱלֹהֵֽינוּ זֶה: \n\n" +
					"יוֹשֵׁב בַּשָּׁמַיִם, שְׁעֵה בָּאֵי בָאֵשׁ וּבַמָּיִם: וְחֹן עַל עַם אֲשֶׁר לָקוּ, בְחַטֹּאתָם כִּפְלָיִם: בְּיוֹם הֵחֵל צַר לָצוּר מְחוֹלַת מַחֲנַיִם, סָמַךְ מֶלֶךְ בָּבֶל אֶל יְרוּשָׁלָיִם: הָעוֹנֶה בַּמֵּצָר, עֱנוּת עָנִי אַל תִּבְזֶה: בְּיוֹם צוֹם הָעֲשִׂירִי, עֱנוּתֵנוּ תֶּחֱזֶה: יוֹם הִזְהַרְתָּ בַּמַּחֲזֶה, לְבֶן־בּוּזִי הַחוֹזֶה: כְּתׇוב־לְךָ֙ אֶת־שֵׁ֣ם הַיּ֔וֹם אֶת־עֶ֖צֶם הַיּ֣וֹם הַזֶּ֑ה: יוֹם בּוֹ שָׁקַד שַׁחַל, וְנָמֵר עַל דְּלַתָיִם: יוֹם סָֽמְּכוּ עַל אַרְמוֹן נַחֲלַת צְבִי וָשֶׁפֶר, וּבוֹ הוּחַל הַנֶּגֶף בְּמַכְפִּישֵׁי בָּאֵפֶר: וְגַם בּוֹ נֶאֱסַף, עֶזְרָא הַכֹּהֵן הַסּוֹפֵר: וְלֵב מְתֵי קִרְיַת סֵפֶר, בּוֹ הָיָה לְמָיִם, סָמַךְ מֶלֶךְ בָּבֶל אֶל יְרוּשָׁלָיִם:");
				break;
			case JewishCalendar.FAST_OF_ESTHER:
				addToSiddurHighlighted(
					"עַל יְדֵי רַחֲמֶיךָ הָרַבִּים סְלַח לָנוּ אָבִֽינוּ, כִּי בְרֹב אִוַּלְתֵּנוּ שָׁגִֽינוּ: מְחֹל לָנוּ מַלְכֵּנוּ, כִּי רַבּוּ עֲוֹנֵֽינוּ: אֵל אֶרֶךְ אַפַּיִם אַתָּה, וְדֶרֶךְ תְּשׁוּבָה לָנוּ הוֹרֵיתָ: גְּדֻלַּת רַחֲמֶיךָ וַחֲסָדֶיךָ, תִּזְכֹּר הַיּוֹם לְזֶרַע יְדִידֶיךָ: תֵּפֶן אֵלֵֽינוּ בְּרַחֲמִים, כִּי אַתָּה הוּא בַּעַל הָרַחֲמִים: בְּתַחֲנוּן וּבִתְפִלָּה נְקַדֵּם, כְּמוֹ שֶׁהוֹדַעְתָּ לֶעָנָו מִקֶּדֶם: וּמֵחֲרוֹן אַפְּךָ תָּשׁוּב, כְּמוֹ בְּתוֹרָֽתְךָ כָּתוּב: וּבְצֵל כְּנָפֶיךָ נֶחֱסֶה וְנִתְלוֹנָן, כְּיוֹם וַיֵּרֶד יְהֹוָה בֶּעָנָן: תַּעֲבֹר עַל פֶּשַׁע וְתִמְחֹל אָשָׁם, כְּיוֹם וַיִּתְיַצֵּב עִמּוֹ שָׁם: תַּאֲזִין שֶׁוַע וְתַּקְשִׁיב בְּרָצוֹן מַאֲמָר, כְּיוֹם וַיִּקְרָא בְשֵׁם, יְהֹוָה: וְשָׁם נֶאֱמַר: \n\n" +
					vayavor + "\n\n" +
					"אֲגָגִי בְּהַעֲמִיקוֹ מַחֲשֶׁבֶת זְמָמוֹ, בְּהִוָּֽסְדוֹ עַל עַם קָדוֹשׁ לְאַבְּדוֹ וּלְהַחֲרִימוֹ, יְמִינִי גָעָה בְּבִכְיָה לְצוּר שׁוֹכֵן מְרוֹמוֹ, כִּ֠י לֹֽא־יִטֹּ֤שׁ יְהֹוָה֙ אֶת־עַמּ֔וֹ: אֲגָגִי דִמָּה לְכַלּוֹת שְׁאֵרִית יִשְׂרָאֵל וּלְאַבְּדֵנוּ, הִפִּ֣יל פּוּר֩ ה֨וּא הַגּוֹרָ֜ל בְּיוֹם זֶה לְגַדְּעֵנוּ, יְמִינִי וְלֹא קָם וְלֹא זָע מִמֶּנּוּ, וְהַבּוֹטֵ֥חַ בַּֽיהֹוָ֑ה חֶ֗֝סֶד יְסוֹבְבֶֽנּוּ׃ אֲגָגִי זְדוֹנוֹ הִשִּׁיאוֹ בְּעֵצָה נִבְעָרָה, חָשׁ לִשְׁקוֹל עֲשֶׂרֶת אֲלָפִים לְאַבֵּד שֶׂה פְזוּרָה, יְמִינִי טִהַר לִבּוֹ בְּצוֹם וַעֲצָרָה, ט֣וֹב יְהֹוָ֔ה לְמָע֖וֹז בְּי֣וֹם צָרָ֑ה: אֲגָגִי יָצָא שָׂמֵחַ מִבֵּית מַעֲדַנּוֹת, כּוֹנֵן עֵץ לִתְלוֹת עָלָיו אִישׁ אֱמוּנוֹת, יְמִינִי לָבַשׁ חֵן וְנִסְמָךְ עַל עוֹטֶה גְאוֹנוֹת, אֲבִ֣י יְ֭תוֹמִים וְדַיַּ֣ן אַלְמָנ֑וֹת: אֲגָגִי מִהַר קְרוֹא חֲכָמָיו וּמִדְינֵי אִשָּׁה, נָפוֹל תִּפּוֹל לְפָנָיו יְעָצוּהוּ לְבוּשָׁה, יְמִינִי סוֹד הוֹדִיעַ לַהֲדַסָּה וּמַלְכוּת לָֽבְשָׁה, וֶֽאֱסָרָהּ֙ אֲשֶׁ֣ר אָֽסְרָ֣ה עַל־נַפְשָׁ֔הּ: אֲגָגִי עֵת בּוֹאוֹ לְמִשְׁתֶּה מְסִבָּה, פִּיהָ פָּֽתְחָה בְחָכְמָה אֲהוּבָה נְדִיבָה, יְמִינִי צָהַל בִּרְאוֹתוֹ מַפָּלַת הָמָן בְּחִבָּה, אֵ֣ל נַ֭עֲרָץ בְּסוֹד־קְדֹשִׁ֣ים רַבָּ֑ה: קָדוֹשׁ הַנֶּעֶרָץ בְּסוֹד שַׂרְפֵי מְעוֹנָי, רוֹמְמוֹתֶךָ יִפְצְחוּ עֲדַת אֱמוּנָי, לִישׁוּעָתְךָ֖ קִוִּ֥יתִי יְהֹוָֽה, כֵּ֠ן יֹאבְד֤וּ כׇל־אוֹיְבֶיךָ֙ יְהֹוָ֔ה: יֶהֱמוּ נָא רַחֲמֶיךָ עַל מְעוּטֵי עַמִּים, וְשַׂגְּבֵם בְּחַסְדְּךָ לְעֵינֵי כָל־לְאֻמִים, פְּלָאֶיךָ הַרְאֵם צוּר שׁוֹכֵן מְרוֹמִים, אֵל מֶלֶךְ יוֹשֵׁב עַל כִּסֵּא רַחֲמִים: יִחַלְתָּ עֲבָדֶיךָ בְּחֶזְיוֹנֵי כִתְבֵיהֶם, לְתִתָּם לְרַחֲמִים לִפְנֵי כָל־שׁוֹבֵיהֶם, וְדִבַּרְתָּ עַל לִבָּם לְרַפֹּאת מַכְאוֹבֵיהֶם, וְאַף־גַּם־זֹ֠את בִּֽהְיוֹתָ֞ם בְּאֶ֣רֶץ אֹֽיְבֵיהֶ֗ם: צִמְּתַתְנִי אָז אַרְיֵה מִגֶּפֶן פּוֹרִיָּה, הִגְלָנִי וְהֶעֱלָנִי אֶל אֶרֶץ מַאְפֵלְיָה, הִקְדַּמְתָּ אַרְבָּעָה הוֹגֵי דַת תּוּשִׁיָּה, דָּנִיֵּאל חֲנַנְיָה מִישָׁאֵל וַעֲזַרְיָה, זֶה נִצַּל מֵאֲרָיוֹת וְאֵלֶּה מִלַּהֲבֵיהֶם: חָשׁ הָאַיִל וְהַחֲזִיר בִּמְהוּמָה וּמְבוּסָה, כִּמְעַט אוֹרִי קָדַר וּמְאוֹר שִׁמְשִׁי כֻּסָּה, תָּמַכְתָּ יַד יְמִינִי בִּימִינִי וַהֲדַסָּה, וְחִצִּים אֲשֶׁר דָּֽרְכוּ לִי, שָׁבוּ בְּלֵב רוֹבֵיהֶם: קָם עָלַי בְּפִשְׁעִי הַנָּבָל הַבַּעַר, גְּרוֹנוֹ עָלַי פָּעַר, כַּחֲזִיר בְּתוֹךְ הַיָּעַר, הִקְדַּמְתָּ לִי מְשִׁיבֵי מִלְחֶמֶת דַּת שָׁעַר, וְהִנְנִי מִשְׁתַּעְשֵׁעַ בְּשִׂכְלָם וּבְנִיבֵיהֶם, וְאַף־גַּם־זֹ֠את בִּֽהְיוֹתָ֞ם בְּאֶ֣רֶץ אֹֽיְבֵיהֶ֗ם: \n\n"
							.replace(isDachuy ? "בְּיוֹם זֶה לְגַדְּעֵנוּ" : "@",
									"בְּיוֹם אֶחָֽד לְגַדְּעֵנוּ")
					+
					"וְאַף־גַּם־זֹ֠את בִּֽהְיוֹתָ֞ם בְּאֶ֣רֶץ אֹֽיְבֵיהֶ֗ם לֹֽא־מְאַסְתִּ֤ים וְלֹֽא־גְעַלְתִּים֙ לְכַלֹּתָ֔ם לְהָפֵ֥ר בְּרִיתִ֖י אִתָּ֑ם כִּ֛י אֲנִ֥י יְהֹוָ֖ה אֱלֹהֵיהֶֽם׃ וְזָכַרְתִּ֖י אֶת־בְּרִיתִ֣י יַעֲק֑וֹב וְאַף֩ אֶת־בְּרִיתִ֨י יִצְחָ֜ק וְאַ֨ף אֶת־בְּרִיתִ֧י אַבְרָהָ֛ם אֶזְכֹּ֖ר וְהָאָ֥רֶץ אֶזְכֹּֽר׃ מִֽן־הַ֭מֵּצַר קָרָ֣אתִי יָּ֑הּ עָנָ֖נִי בַמֶּרְחָ֣ב יָֽהּ׃ יְהֹוָ֣ה לִ֭י לֹ֣א אִירָ֑א מַה־יַּעֲשֶׂ֖ה לִ֣י אָדָֽם׃ יְהֹוָ֣ה לִ֭י בְּעֹזְרָ֑י וַ֝אֲנִ֗י אֶרְאֶ֥ה בְשֹׂנְאָֽי׃ ט֗וֹב לַחֲס֥וֹת בַּיהֹוָ֑ה מִ֝בְּטֹ֗חַ בָּאָדָֽם׃ ט֗וֹב לַחֲס֥וֹת בַּיהֹוָ֑ה מִ֝בְּטֹ֗חַ בִּנְדִיבִֽים׃ כׇּל־גּוֹיִ֥ם סְבָב֑וּנִי בְּשֵׁ֥ם יְ֝הֹוָ֗ה כִּ֣י אֲמִילַֽם׃ דָּחֹ֣ה דְחִיתַ֣נִי לִנְפֹּ֑ל וַ֖יהֹוָ֣ה עֲזָרָֽנִי׃ \n\n" +
					"יְהִירִים קָמוּ בְּכָל־דּוֹר, וְהָאֱלֹהִים שְׁמָרַנִי, עָלָה אַרְיֵה תְּחִלָּה, בְּכָל־פֵּאוֹת זֵרָנִי, קָם אַחֲרָיו דּוֹב שַׁכּוּל וְלִמְזַנֵּב מְכָרָנִי, דָּחֹ֣ה דְחִיתַ֣נִי לִנְפֹּ֑ל וַ֖יהֹוָ֣ה עֲזָרָֽנִי׃ אָז בְּצֵאתִי מִפֶּרֶךְ, בָּא נָחָשׁ עֲלֵי דֶּרֶךְ, עַל עָיֵף וְיָגֵעַ לְהָבִיא בְלִבּוֹ מֹרֶךְ, גָּדַעְתָּ וְהִכִּיתָ אוֹתוֹ שׁוֹק עַל יָרֶךְ, יוֹם הֵרִים יָד עָנָו עֲלֵיהֶם הִגְבִּירָנִי, דָּחֹ֣ה דְחִיתַ֣נִי לִנְפֹּ֑ל וַ֖יהֹוָ֣ה עֲזָרָֽנִי׃ בְּקוּם הָמָן הָאֲגָגִי, כַּתַּנִּין לְבַלְּעֵנִי, וְכָתַב שִׂטְנָה עָלָי, בְּיוֹם אֶחָד לְגַדְּעֵנִי, שָׁלַח מִשָּׁמַיִם אֵל וַיּוֹשִׁיעֵנִי, לְמִחְיָה הִשְׁאִירָנִי וְעֹז וְיֶשַׁע אִזְּרָנִי, דָּחֹ֣ה דְחִיתַ֣נִי לִנְפֹּ֑ל וַ֖יהֹוָ֣ה עֲזָרָֽנִי׃ שִׁמְךָ מִגְדַּל מִבְטָחִי, אֵל מִבֶּטֶן גּוֹחִי, וְחִלַּצְתָּ אֶת־רוּחִי, מִמָּוֶת וּמִשֶּׁחִי, אֶת־עֵינִי מִן דִּמְעָה, וְאֶת־רַגְלִי מִדֶּחִי, וּבְאֶרֶץ מַדּוּחִי, אֵל אֱלֹהִים הִפְרָנִי, דָּחֹ֣ה דְחִיתַ֣נִי לִנְפֹּ֑ל וַ֖יהֹוָ֣ה עֲזָרָֽנִי׃ \n\n" +
					"דָּחֹ֣ה דְחִיתַ֣נִי לִנְפֹּ֑ל וַ֖יהֹוָ֣ה עֲזָרָֽנִי׃ עָזִּ֣י וְזִמְרָ֣ת יָ֑הּ וַֽיְהִי־לִ֗֝י לִישׁוּעָֽה׃ ק֤וֹל ׀ רִנָּ֬ה וִישׁוּעָ֗ה בְּאׇהֳלֵ֥י צַדִּיקִ֑ים יְמִ֥ין יְ֝הֹוָ֗ה עֹ֣שָׂה חָֽיִל׃ יְמִ֣ין יְ֭הֹוָה רוֹמֵמָ֑ה יְמִ֥ין יְ֝הֹוָ֗ה עֹ֣שָׂה חָֽיִל׃ לֹא־אָמ֥וּת כִּֽי־אֶחְיֶ֑ה וַ֝אֲסַפֵּ֗ר מַעֲשֵׂ֥י יָֽהּ׃ יַסֹּ֣ר יִסְּרַ֣נִּי יָּ֑הּ וְ֝לַמָּ֗וֶת לֹ֣א נְתָנָֽנִי׃ פִּתְחוּ־לִ֥י שַׁעֲרֵי־צֶ֑דֶק אָבֹא־בָ֗֝ם אוֹדֶ֥ה יָֽהּ׃ זֶה־הַשַּׁ֥עַר לַיהֹוָ֑ה צַ֝דִּיקִ֗ים יָבֹ֥אוּ בֽוֹ׃ א֭וֹדְךָ כִּ֣י עֲנִיתָ֑נִי וַתְּהִי־לִ֗֝י לִישׁוּעָֽה׃ לוּלֵ֣י יְ֭הֹוָה שֶׁהָ֣יָה לָ֑נוּ יֹאמַר־נָ֗֝א יִשְׂרָאֵֽל׃ \n\n" +
					"אֵיךְ זָרִים, אַכְזָרִים, כַּדְּבוֹרִים סְבָבוּנוּ, בְּקוּם הָמָן, בְּזֶה הַזְּמָן, כְּשֹׁד שַׁלְמָן שְׁדָדוּנוּ. בְּרֹב מַעַל, סַף רַעַל, בְּלִי תַעַל הִשְׁקוּנוּ. לוּלֵ֣י יְ֭הֹוָה שֶׁהָ֣יָה לָ֑נוּ, אֲ֭זַי חַיִּ֣ים בְּלָע֑וּנוּ: אֵיךְ דִּמוּ, וְזָֽמְמוּ, בְּלִבָּם נִינָם יַחַד. בְּמַחֲשָׁבַת, לְהַחְרִיב בַּת, יִשְׂרָאֵל גּוֹי אֶחָד. בְּסוֹד סוֹדָם, לְהַשְׁמִידָם, לְהַכְחִידָם, כְּמוֹ כַחַד. וּבֵין תַּנּוּר וְכִירַיִם, הַמַּיִם שְׁטָפוּנוּ. לוּלֵ֣י יְ֭הֹוָה שֶׁהָ֣יָה לָ֑נוּ, אֲ֭זַי חַיִּ֣ים בְּלָע֑וּנוּ: קָם צוֹרֵר, וְלִי עוֹרֵר, אֵיבָתוֹ וְשִׂנְאָתוֹ. וְדָת הֶעֱמִיד, וְקֵץ לַשְׁמִיד, עֲדַת שַׁדַּי וְנַחֲלָתוֹ. וְצוּר חָמַל, וְטוֹב גָּמַל, וְהֶרְאָה אֶת־גְּבוּרָתוֹ. לְהַאֲבִידוֹ, לְהַכְחִידוֹ, וּבָנָיו אֲשֶׁר עִנּוּנוּ. חָשַׁב צָר, בְּעֵת מֵצָר, וְהִפִּיל פּוּר גּוֹרָלוֹ. וְצוּר הִקְשִׁיב, וְאָז הֵשִׁיב, בְּרֹאשׁוֹ אֶת תַּגְמוּלוֹ. וְאֵל נֶאְדָּר, בְּחֹדֶשׁ אֲדָר, עֹז הֶרְאָה לִקְהָלוֹ. בְּמוֹ רֶצַח, עֲדֵי נֶצַח, הִכָּה אֲשֶׁר הִכּוּנוּ. לוּלֵ֣י יְ֭הֹוָה שֶׁהָ֣יָה לָ֑נוּ, אֲ֭זַי חַיִּ֣ים בְּלָע֑וּנוּ: \n\n" +
					"לוּלֵ֣י יְ֭הֹוָה שֶׁהָ֣יָה לָ֑נוּ יֹאמַר־נָ֗֝א יִשְׂרָאֵֽל׃ לוּלֵ֣י יְ֭הֹוָה שֶׁהָ֣יָה לָ֑נוּ בְּק֖וּם עָלֵ֣ינוּ אָדָֽם׃ אֲ֭זַי חַיִּ֣ים בְּלָע֑וּנוּ בַּחֲר֖וֹת אַפָּ֣ם בָּֽנוּ׃ אֲ֭זַי הַמַּ֣יִם שְׁטָפ֑וּנוּ נַ֗֝חְלָה עָבַ֥ר עַל־נַפְשֵֽׁנוּ׃ אֲ֭זַי עָבַ֣ר עַל־נַפְשֵׁ֑נוּ הַ֝מַּ֗יִם הַזֵּידוֹנִֽים׃ בָּר֥וּךְ יְהֹוָ֑ה שֶׁלֹּ֥א נְתָנָ֥נוּ טֶ֗֝רֶף לְשִׁנֵּיהֶֽם׃ נַפְשֵׁ֗נוּ כְּצִפּ֥וֹר נִמְלְטָה֮ מִפַּ֢ח י֫וֹקְשִׁ֥ים הַפַּ֥ח נִשְׁבָּ֗ר וַאֲנַ֥חְנוּ נִמְלָֽטְנוּ׃ עֶ֭זְרֵנוּ בְּשֵׁ֣ם יְהֹוָ֑ה עֹ֝שֵׂ֗ה שָׁמַ֥יִם וָאָֽרֶץ׃ \n\n" +
					"אֲדֹנָ֤י ׀ שְׁמָ֙עָה֙ אֲדֹנָ֣י ׀ סְלָ֔חָה אֲדֹנָ֛י הַֽקְשִׁ֥יבָה וַעֲשֵׂ֖ה אַל־תְּאַחַ֑ר לְמַֽעַנְךָ֣ אֱלֹהַ֔י כִּֽי־שִׁמְךָ֣ נִקְרָ֔א עַל־עִירְךָ֖ וְעַל־עַמֶּֽךָ׃ הֲשִׁיבֵ֨נוּ יְהֹוָ֤ה ׀ אֵלֶ֙יךָ֙ וְֽנָשׁ֔וּבָה חַדֵּ֥שׁ יָמֵ֖ינוּ כְּקֶֽדֶם׃");
				break;
			case JewishCalendar.SEVENTEEN_OF_TAMMUZ:
				addToSiddurHighlighted(
					"וָאָרֶץ שָׁפַל רוּמִי, יוֹם דִּמָּה רָשָׁע לְהַכְנִיעִי, מְשׂוֹשׂ לִבִּי שָׁבַת, וְהֻשְׁלַכְתִּי מִבֵּית מַרְגּוֹעִי, אָנוּ וְאָֽבְלוּ פְּתָחַי, יוֹם נֶאֱסַף נְדִיבִי וְשׁוּעִי, לָכֵן אֲקוֹנֵן מִיָּמִים יָמִימָה בַּחֹדֶשׁ הָֽרְבִיעִי: \n\n" +
					"בַּחֹדֶשׁ הָֽרְבִיעִי אָֽפְפוּ עָלַי רָעוֹת וַאֲנָחוֹת, בְּשִׁבְעָה־עָשָׂר בּוֹ, בְּאַנְחָתִי יָגַעְתִּי וְלֹא מָצָאתִי מְנוּחוֹת, גָּעֹה גָעִיתִי בִּבְכִי וְעַל כָּל־רֹאשׁ קֹרְחוֹת, כִּי בְיוֹם זֶה נִשְׁתַּבְּרוּ הַלֻּחוֹת: הַלֻּחוֹת יְצָאוּנִי וְסָֽבְבוּ עָלַי תְּלָאוֹת, וְגָֽבְרָה יַד צָרִי וְזֵרַנִי בְּכָל־פֵּאוֹת, סֹב־נָא וְהָגֵן מְיַחֲלֵי קֵץ פְּלָאוֹת, כִּי שֶׁמֶשׁ וּמָגֵן יְהֹוָה צְבָאוֹת: \n\n" +
					"בַּחֹדֶשׁ הָֽרְבִיעִי דִּמִּיתִי עֲלוֹת מִטִּיט הַיָּוֵן וְאֵין מַעֲמִיד, בְּשִׁבְעָה עָשָׂר בּוֹ הָיִיתִי לְבִזָּה לְמַאֲכָל וּלְהַשְׁמִיד, וְלֹא מָצָאתִי מָנוֹחַ וּמַכְאוֹבִי נֶגְדִּי תָמִיד, כִּי בוֹ בֻּטַּל הַתָּמִיד: הַתָּמִיד יוֹם הוּסַר גָּֽבְרָה יִלְלָתִי כְּיִלְלַת אֶגְלַיִם, וּמִסְפְּדִי גָדַל כְּמִסְפֵּד הֲדַדְרִמּוֹן כִּפְלַיִם, סֹב־נָא וְהַחֲיֵה רְדוּמֵֽינוּ, אֵל שׁוֹכֵן שָׁמַיִם, יְחַיֵּֽינוּ מִיּוֹמָיִם: \n\n" +
					"בַּחֹדֶשׁ הָֽרְבִיעִי זַעַם צוּר נָשָׂאתִי וַחֲמָתוֹ בִּי הִבְעִיר, בְּשִׁבְעָה עָשָׂר בּוֹ חַלְחָלָה אֲחָזַתְנִי וְסַעַר מַסְעִיר, טוֹבוֹת נָשִׁיתִי וַתִּזְנַח מִשָּׁלוֹם נַפְשִׁי בְּתִגְרַת שֵׂעִיר, כִּי בוֹ הָבְקְעָה הָעִיר: הָעִיר יוֹם הָבְקְעָה בְּקוּם תֵּימָן וּמַגְדִּיאֵל, וְאָֽזְלַת יָדִי וְלֹא מָֽצְאָה לָאֵל, סֹב־נָא וְהַקְדֵּשׁ פְּלֵיטַת אֲרִיאֵל, הִקְדִּ֙ישׁוּ֙ אֶת־קְד֣וֹשׁ יַֽעֲקֹ֔ב וְאֶת־אֱלֹהֵ֥י יִשְׂרָאֵ֖ל: \n\n" +
					"בַּחֹדֶשׁ הָֽרְבִיעִי יוֹם הוֹ הוֹ יוֹם תּוֹכֵחָה וְעֶבְרָה, בְּשִׁבְעָה עָשָׂר בּוֹ כְּבוֹדִי גָלָה וְתִפְאַרְתִּי הוּסָרָה, לְשִׁבְרִי אֵין כֵּהָה וּמַכָּתִי נַחְלָה וְרוּחִי נִשְׁבָּרָה, כִּי בוֹ שָׂרַף אַפּוֹסְטְמוֹס אֶת־הַתּוֹרָה: הַתּוֹרָה יוֹם נִשְׂרְפָה חֻדְּשׁוּ עָלַי יְגוֹנַי, וְשָֽׁבְתוּ מֵעִיר קֹדֶשׁ יְשִׁישַׁי וּזְקֵנַי, סֹב־נָא וְחֹן בְּעֻזְּךָ עֲדַת אֱמוּנַי, ר֥וּחַ דַּ֖עַת וְיִרְאַ֥ת יְהֹוָֽה׃ \n\n" +
					"בַּחֹדֶשׁ הָֽרְבִיעִי מְעֻוָּתִי מָדַד זָר בְּסַאסְּאָה וּבָהּ כָּֽל, בְּשִׁבְעָה עָשָׂר בּוֹ נָוִי הֵשַׁם זָר וְאֶת־יַעֲקֹב אָכַל, סְפוֹת שָׁנָה בְשָׁנָה בְּיוֹם זֶה מַמְרוּר אוֹכַל, כִּי בוֹ הָעֳמָד צֶלֶם בַּהֵיכָל: יוֹם הָעֳמָד פֶּסֶל קִנְאָה וְתוֹעֵבָה, וּבוֹ חֻבְּלָה רוּחִי וְתוֹחַלְתִּי נִכְזְבָה, סֹב־נָא וְרַפֵּא מְשׁוּבַת עַמְּךָ וְתֹאהֲבֵם נְדָבָה, הֲשִׁיבֵ֨נוּ יְהֹוָ֤ה ׀ אֵלֶ֙יךָ֙ וְֽנָשׁ֔וּבָה: \n\n" +
					"עַל יְדֵי רַחֲמֶיךָ הָרַבִּים סְלַח לָנוּ אָבִֽינוּ, כִּי בְרוֹב אִוַּלְתֵּנוּ שָׁגִֽינוּ: מְחֹל לָנוּ מַלְכֵּנוּ, כִּי רַבּוּ עֲוֹנֵֽינוּ: אֵל אֶרֶךְ אַפַּיִם אַתָּה, וְדֶרֶךְ תְּשׁוּבָה לָנוּ הוֹרֵיתָ: גְּדֻלַּת רַחֲמֶיךָ וַחֲסָדֶיךָ, תִּזְכֹּר הַיּוֹם לְזֶרַע יְדִידֶיךָ: תֵּפֶן אֵלֵֽינוּ בְּרַחֲמִים, כִּי אַתָּה הוּא בַּעַל הָרַחֲמִים: בְּתַחֲנוּן וּבִתְפִלָּה נְקַדֵּם, כְּמוֹ שֶׁהוֹדַעְתָּ לֶעָנָו מִקֶּדֶם: וּמֵחֲרוֹן אַפְּךָ תָּשׁוּב, כְּמוֹ בְּתוֹרָֽתְךָ כָּתוּב: וּבְצֵל כְּנָפֶיךָ נֶחֱסֶה וְנִתְלוֹנָן, כְּיוֹם וַיֵּרֶד יְהֹוָה בֶּעָנָן: תַּעֲבוֹר עַל פֶּשַׁע וְתִמְחֹל אָשָׁם, כְּיוֹם וַיִּתְיַצֵּב עִמּוֹ שָׁם: תַּאֲזִין שֶׁוַע וְתַּקְשִׁיב בְּרָצוֹן מַאֲמַר, כְּיוֹם וַיִּקְרָא בְשֵׁם, יְהֹוָה: וְשָׁם נֶאֱמַר: \n\n" +
					vayavor + "\n\n" +
					"על סדר א\"ב \n\n" +
					"אֲזַי בְּבָגְדִי, אִמְרֵי דָר מְעוֹנִי, בְּהִשְׂתָּרֵג עֲוֹנִי, הִכְבִּיד עֻלִי מוֹנִי, גָּבַר עָלַי זָר בְּמַהֲלֹם לְהַלְּמֵנִי, אַפּוֹ טָרַף וַיִּשְׂטְמֵנִי: דְּרָכָיו זָנַחְתִּי אֲשֶׁר לִי הוֹרָה, הֵן עַל כֵּן הֵעִיר בִּי אַף וְזַעַם וְעֶבְרָה, זַעְמוֹ בִּי הֵרִיק וְחִצָּיו בִּי יָרָה, וַיְקִימֵנִי לוֹ לְמַטָּרָה: חָֽלְפוּ עָלַי בְּיוֹם זֶה חָמֵשׁ תְּלָאוֹת, טָֽרְפוּ חַיָּתִי וַיְשִׂימוּנִי לְמַשּׁוּאוֹת, יָֽגְעָה נַפְשִׁי יָגוֹעַ וְהַלְאוֹת, נַעֲוֵיתִי מִשְּׁמֹעַ, נִבְהַלְתִּי מֵרְאוֹת: כָּל־אֵלֶּה בְּזָכְרִי יְעוֹרְרוּנִי אֲנָחוֹת, לֶהָבָה הֱשִׂיקַתְנִי מְלַהֶטֶת כֶּסֶל וְטוּחוֹת, מִסְפֵּד מַר אַגְדִּיל וְאַרְחִיק שְׂמָחוֹת, כִּי בְיוֹם זֶה נִשְׁתַּבְּרוּ הַלּוּחוֹת: נוֹעַד עָלַי זָר וַהֲמוֹנָיו הִצְמִיד, סַבּוּנִי כַמַּיִם וְטָבַעְתִּי וְאֵין מַעֲמִיד, עַל כֵּן אֲיֵלִיל בְּמוֹ פִי, וְנֶהִי אַתְמִיד, כִּי בְיוֹם זֶה בֻּטַּל הַתָּמִיד: פּוֹשְׁחַי הָמוּ כַּהֲמוֹת זֶרֶם מִיכַל, צָֽמְתוּ בַבּוֹר חַיַּי וַיִּתְּנוּנִי לְמַאֲכָל, קָרָא עָלַי מוֹעֵד וַהֲמוֹנַי שָׁכֹל שִׁכַּל, כִּי בְּיוֹם זֶה הָעֳמָד צֶלֶם בָּהֵיכָל: רַבָּתִי עָם, זָר הֵצַר וּפְתָחֶיהָ פֶּתַח הֶעֱרָה, שָׁת גַּפְנִי לְשַׁמָּה בְּיוֹם זָעַם וְעֶבְרָה, תַּאֲוָתוֹ רָאָה זָר וְיָדוֹ בְּעֹז גָּֽברָה, כִּי בְיוֹם זֶה שָׂרַף אַפּוֹסְטְמוֹס אֶת־הַתּוֹרָה: \n\n" +
					"חָֽרְקוּ שֵׁן רְשָׁעִים בְּיוֹם אַף יְהֹוָה בִּי הֵעִיר, לֹא חָמַל זָר וְעִקֵּשׁ עַל יָשִׁישׁ וְצָעִיר, אַפּוֹ בִּי חָרָה וּרְשָׁפָּיו בִּי הִבְעִיר, כִּי בְיוֹם זֶה הָבְקְעָה הָעִיר: רַחֵם יְהֹוָה וְדַבֵּר עַל לֵב עֲגוּמִים, בְּשִׁבְעָה עָשָׂר לַחֹדֶשׁ יוֹשְׁבִים מִשְׁתּוֹמְמִים, יָהּ גַּלְגֵּל עֲלֵיהֶם הֲמוֹן רַחֲמֶיךָ מִמְּרוֹמִים, אֵל מֶלֶךְ יוֹשֵׁב עַל כִּסֵּא רַחֲמִים: \n\n" +
					"שְׁעֵה נֶאְסָר, אֲשֶׁר נִמְסַר, בְּיַד בָּבֶל וְשַׂר הָעִיר: לְךָ יֶהֱמֶה, זֶה כַמֶּה, וְיִתְחַנֵּן כְּבֶן צָעִיר: מוּלְךָ צוּר, בְּלֵב עָצוּר, הֶמְיַת מֵעָיו יַסְעִיר: יוֹם גָּבַר הָאוֹיֵב וַתִּבָּקַע הָעִיר: לְזֹאת אִכַּף, וְאֶסְפֹּק כַּף, בְּיוֹם חָמֵשׁ קְרָאוּנִי: וְעַל רֶגֶל, הָעֵגֶל, הַלּוּחוֹת יְצָאוּנִי: וְלָכַד זָר, הַמִּבְצָר, וּבְמַסְגֵּר הֱבִיאָנִי: וְגַם הִשְׁמִיד, הַתָּמִיד, וּמֵעֲשׂוֹתוֹ כְּלָאָנִי: וְהוּשָׂם אֱלִיל, בְּהֵיכָל כָּלִיל, וְדָֽתְךָ זָר בָּאֵשׁ הִבְעִיר: מְאֹד אֶתְחַל, וָאֶתְחַלְחַל, בְּיוֹם שַׁדַּי חֲשָׂפַנִי: וְהַשְּׁפִיפוֹן, מִצָּפוֹן, כְּשִׁבּוֹלֶת שְׁטָפַנִי: וְנָהַג שְׁבִי, אֶרֶץ צְבִי, וְגַם כַּדּוּר צְנָפַנִי: יוֹם חָשַׁךְ, מְאוֹר שֵׁשַׁךְ, לְיַד פָּרַס דְּחָפַנִי: אֲכָלַנִי, הֲמָמַנִי, וְקִינָה עֲלֵי זֹאת אָעִיר: הֲלָעַד בִּי, מִשְׂגַּבִּי, הֲלָעַד אַפְּךָ יֶעְשַׁן: גְּדוֹר פִּרְצִי, בְּבֶן פַּרְצִי, וּמֵחֶדֶק לְקֹט שׁוֹשָׁן: עַיִן פְּקַח, תְּפִלָּתִי קַח, כְּמוֹ חֵלֶב הַמְּדֻשָׁן: בְּנֵה בֵית זְבוּל, וְהָשֵׁב גְּבוּל, הַכַּרְמֶל וְהַבָּשָׁן: שְׁפֹט אִלֵּם, וְאָז יְשַׁלֵּם, הַמַּבְעֶה וְהַמַּבְעִיר: \n\n" +
					"אֱלֹהֵי יְשׁוּעָתֵנוּ, שְׁעֵה שַׁוְעָתֵנוּ, וּרְאֵה שׁוֹמְמוֹתֵֽינוּ, וְאֹרֶךְ גָּלוּתֵנוּ, מִדֵּי שָׁנָה בְשָׁנָה, בְּזָכְרֵנוּ עֱנוּתֵנוּ, בְּיוֹם חֲמִשָּׁה דְבָרִים, אֵרְעוּ אֶת־אֲבוֹתֵֽינוּ: נָא אֱלֹהֵי הָרוּחוֹת, וּבוֹחֵן סִתְרֵי טוּחוֹת, שְׁעֵה שֵׂיוֹת נִדָּחוֹת, נְפוּצוֹת בְּאַרְבַּע רוּחוֹת, מִדֵּי שָׁנָה בְשָׁנָה בִּזְמַן זֶה נֶאֱנָחוֹת, בְּיוֹם עֵקֶב מַדּוּחוֹת, נִשְׁתַּבְּרוּ הַלּוּחוֹת, וּבוֹ כָּל־יְמֵי שְׁנוֹתֵֽינוּ, נְמָרֵר עַל יְגוֹנֵנוּ: דְּלֵה מִטִּיט הַיָּוֵן, טְבוּעִים בּוֹ וְאֵין מַעֲמִיד, עֵדֶר תַּתָּה לְמַאֲכָל, לְבִזָּה וּלְהַשְׁמִיד, מִדֵּי שָׁנָה בְשָׁנָה, בְּיוֹם זֶה עֶצֶב מַצְמִיד, יוֹם בּוֹ יַד זָר הֶאֱמִיר, וּבוֹ בֻּטַּל הַתָּמִיד, עַל רֹב עֲוֹנוֹתֵֽינוּ, וְעֹצֶם חַטֹּאתֵֽינוּ: יָהּ אֲשֶׁר הַכֹּל יוּכַל, פְּדֵה מִשּׁכוֹל שָׁכַל, מִיַּד עִקֵּשׁ וְסָכָל, וּשְׁאַר יַעֲקֹב אָכַל, מִדֵּי שָׁנָה בְּשָׁנָה, בְּיוֹם זֶה מַמְרֹר אוֹכַל, בְּהַעֲמִיד זָר לְמוּלִי, בּוֹ צֶלֶם בַּהֵיכָל, עַל כָּל־קוֹרוֹתֵֽינוּ יִזְּלוּ דִמְעוֹתֵֽינוּ: שִׁבְרֵנוּ מַה־נּוֹרָא, כִּי סַרְנוּ מִמּוֹרָא, נָאוֹר עֹטֶה אוֹרָה, גְּמוּלִי לַכָֹּל הוֹרָה, מִדֵּי שָׁנָה בְשָׁנָה, נֶהִי בְּיוֹם זֶה אֶחְקוֹרָה, יַעַן כִּי בוֹ שָׂרַף אַפּוֹסְטְמוֹס אֶת־הַתּוֹרָה, לְזֹאת נִשְׁכְּבָה בְּבָשְׁתֵּנוּ, לְשׁוֹד בֵּית תִּפְאַרְתֵּנוּ: רַחוּם יְכַפֵּר עָוֹן, וְכָל־חֲמָתוֹ לֹא יָעִיר, פְּדֵה חִישׁ מִידֵי שָׂעִיר, פְּזוּרֵי הַצֹּאן וְצָעִיר, מִדֵּי שָׁנָה בְשָׁנָה, בְּיוֹם זֶה הֶמְיַת מֵעָיו יַסְעִיר, יוֹם גָּֽבְרוּ הַזָּרִים וַתִּבָּקַע הָעִיר, כִּי הָיִֽינוּ לְלַעַג וָקֶלֶס לִסְבִיבוֹתֵֽינוּ: רַחֲמָן בְּרַחֲמִים שׁוּבָה, אֶל צִיּוֹן הָעֲלוּבָה, וְחִישׁ נָא לְאִשָּׁה עֲצוּבָה, נֶחָמָה הַכְּתוּבָה, וְאָז שִׁירָה נָנוּבָה, בִּבְנוֹתְךָ הַחֲרֵבָה, בְּקִבּוּץ נְפוּצוֹתֵֽינוּ, וּבְשׁוּבְךָ אֶת שְׁבוּתֵנוּ:");
				break;
		}
	}

	private void addTachanun() {
		addCategoryToSiddur("תחנון");
		addToSiddur(
			"אָנָּא יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ. תָּבֹא לְפָנֶיךָ תְּפִלָּתֵנוּ. וְאַל־תִּתְעַלַּם מַלְכֵּנוּ מִתְּחִנָּתֵנוּ. שֶׁאֵין אֲנַחְנוּ עַזֵּי פָנִים וּקְשֵׁי עֹרֶף לוֹמַר לְפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ צַדִּיקִים אֲנַחְנוּ וְלֹא חָטָאנוּ. אֲבָל חָטָאנוּ. עָוִינוּ. פָּשַׁעְנוּ. אֲנַחְנוּ וַאֲבוֹתֵינוּ וְאַנְשֵׁי בֵיתֵנוּ: אָשַׁמְנוּ. בָּגַדְנוּ. גָּזַלְנוּ. דִּבַּרְנוּ דֹפִי וְלָשׁוֹן הָרָע. הֶעֱוִינוּ. וְהִרְשַׁעְנוּ. זַדְנוּ. חָמַסְנוּ. טָפַלְנוּ שֶׁקֶר וּמִרְמָה. יָעַצְנוּ עֵצוֹת רָעוֹת. כִּזַּבְנוּ. כָּעַסְנוּ. לַצְנוּ. מָרַדְנוּ. מָרִינוּ דְבָרֶיךָ. נִאַצְנוּ. נִאַפְנוּ. סָרַרְנוּ. עָוִינוּ. פָּשַׁעְנוּ. פָּגַמְנוּ. צָרַרְנוּ. צִעַרְנוּ אָב וָאֵם. קִשִּׁינוּ עֹרֶף. רָשַׁעְנוּ. שִׁחַתְנוּ. תִּעַבְנוּ. תָּעִינוּ וְתִעֲתַעְנוּ. וְסַרְנוּ מִמִּצְוֹתֶיךָ וּמִמִּשְׁפָּטֶיךָ הַטּוֹבִים וְלֹא שָׁוָה לָנוּ. וְאַתָּה צַדִּיק עַל־כָּל־הַבָּא עָלֵינוּ. כִּי אֱמֶת עָשִׂיתָ. וַאֲנַחְנוּ הִרְשָׁעְנוּ: \n\n" +
			"אֵל אֶרֶךְ אַפַּיִם אַתָּה וּבַעַל הָרַחֲמִים. גְּדֻלַּת רַחֲמֶיךָ וַחֲסָדֶיךָ, תִּזְכֹּר הַיּוֹם לְזֶרַע יְדִידֶיךָ, כְּמוֹ שֶׁהוֹדַעְתָּ לֶעָנָו מִקֶּדֶם. וְכֵן כָּתוּב בְּתוֹרָתָךְ. וַיֵּרֶד יְהֹוָ֥ה בֶּעָנָן וַיִּתְיַצֵּב עִמּוֹ שָׁם. וַיִּקְרָא בְּשֵׁם יְהֹוָ֥ה. וְשָׁם נֶאֱמַר: \n\n" +
			vayavor + "\n\n" +
			"רַחוּם וְחַנּוּן חָטָאנוּ לְפָנֶיךָ רַחֵם עָלֵינוּ וְהושִׁיעֵנוּ: \n\n" +
			"ישב ויאמר (Sit and say) \n\n" +
			"לְדָוִ֡ד אֵלֶ֥יךָ יְ֝הֹוָ֗ה נַפְשִׁ֥י אֶשָּֽׂא׃ אֱֽלֹהַ֗י בְּךָ֣ בָ֭טַחְתִּי אַל־אֵב֑וֹשָׁה אַל־יַעַלְצ֖וּ אוֹיְבַ֣י לִֽי׃ גַּ֣ם כָּל־קֹ֭וֶיךָ לֹ֣א יֵבֹ֑שׁוּ יֵ֝בֹ֗שׁוּ הַבּוֹגְדִ֥ים רֵיקָֽם׃ דְּרָכֶ֣יךָ יְ֭הֹוָה הוֹדִיעֵ֑נִי אֹ֖רְחוֹתֶ֣יךָ לַמְּדֵֽנִי׃ הַדְרִ֘יכֵ֤נִי בַאֲמִתֶּ֨ךָ ׀ וְֽלַמְּדֵ֗נִי כִּֽי־אַ֭תָּה אֱלֹהֵ֣י יִשְׁעִ֑י אוֹתְךָ֥ קִ֝וִּ֗יתִי כׇּל־הַיּֽוֹם׃ זְכֹר־רַחֲמֶ֣יךָ יְ֭הֹוָה וַחֲסָדֶ֑יךָ כִּ֖י מֵעוֹלָ֣ם הֵֽמָּה׃ חַטֹּ֤אות נְעוּרַ֨י ׀ וּפְשָׁעַ֗י אַל־תִּ֫זְכֹּ֥ר כְּחַסְדְּךָ֥ זְכׇר־לִי־אַ֑תָּה לְמַ֖עַן טוּבְךָ֣ יְהֹוָֽה׃ טוֹב־וְיָשָׁ֥ר יְהֹוָ֑ה עַל־כֵּ֤ן יוֹרֶ֖ה חַטָּאִ֣ים בַּדָּֽרֶךְ׃ יַדְרֵ֣ךְ עֲ֭נָוִים בַּמִּשְׁפָּ֑ט וִילַמֵּ֖ד עֲנָוִ֣ים דַּרְכּֽוֹ׃ כׇּל־אׇרְח֣וֹת יְ֭הֹוָה חֶ֣סֶד וֶאֱמֶ֑ת לְנֹצְרֵ֥י בְ֝רִית֗וֹ וְעֵדֹתָֽיו׃ לְמַֽעַן־שִׁמְךָ֥ יְהֹוָ֑ה וְֽסָלַחְתָּ֥ לַ֝עֲוֺנִ֗י כִּ֣י רַב־הֽוּא׃ מִי־זֶ֣ה הָ֭אִישׁ יְרֵ֣א יְהֹוָ֑ה י֝וֹרֶ֗נּוּ בְּדֶ֣רֶךְ יִבְחָֽר׃ נַ֭פְשׁוֹ בְּט֣וֹב תָּלִ֑ין וְ֝זַרְע֗וֹ יִ֣ירַשׁ אָֽרֶץ׃ ס֣וֹד יְ֭הֹוָה לִירֵאָ֑יו וּ֝בְרִית֗וֹ לְהוֹדִיעָֽם׃ עֵינַ֣י תָּ֭מִיד אֶל־יְהֹוָ֑ה כִּ֤י הֽוּא־יוֹצִ֖יא מֵרֶ֣שֶׁת רַגְלָֽי׃ פְּנֵה־אֵלַ֥י וְחׇנֵּ֑נִי כִּֽי־יָחִ֖יד וְעָנִ֣י אָֽנִי׃ צָר֣וֹת לְבָבִ֣י הִרְחִ֑יבוּ מִ֝מְּצוּקוֹתַ֗י הוֹצִיאֵֽנִי׃ רְאֵ֣ה עׇ֭נְיִי וַעֲמָלִ֑י וְ֝שָׂ֗א לְכׇל־חַטֹּאותָֽי׃ רְאֵֽה־אֹיְבַ֥י כִּי־רָ֑בּוּ וְשִׂנְאַ֖ת חָמָ֣ס שְׂנֵאֽוּנִי׃ שׇׁמְרָ֣ה נַ֭פְשִׁי וְהַצִּילֵ֑נִי אַל־אֵ֝ב֗וֹשׁ כִּֽי־חָסִ֥יתִי בָֽךְ׃ תֹּם־וָיֹ֥שֶׁר יִצְּר֑וּנִי כִּ֝֗י קִוִּיתִֽיךָ׃ פְּדֵ֣ה אֱ֭לֹהִים אֶת־יִשְׂרָאֵ֑ל מִ֝כֹּ֗ל צָרוֹתָֽיו׃ \n\n" +
			"וְ֭הוּא יִפְדֶּ֣ה אֶת־יִשְׂרָאֵ֑ל מִ֝כֹּ֗ל עֲוֺנֹתָֽיו׃ \n\n" +
			"יְהֹוָה אֱלֹהֵי יִשְׂרָאֵל שׁוּב מֵחֲרוֹן אַפֶּךָ. וְהִנָּחֵם עַל הָרָעָה לְעַמֶּךָ: \n\n" +
			"אָבִינוּ מַלְכֵּנוּ, אָבִינוּ אָתָּה. אָבִינוּ מַלְכֵּנוּ אֵין לָנוּ מֶלֶךְ אֶלָּא אָתָּה. אָבִינוּ מַלְכֵּנוּ רַחֵם עָלֵינוּ: אָבִינוּ מַלְכֵּנוּ חָנֵּנוּ וַעֲנֵנוּ כִּי אֵין בָּנוּ מַעֲשִׂים. עֲשֵׂה עִמָּנוּ צְדָקָה וָחֶסֶד לְמַעַן שִׁמְךָ הַגָּדוֹל וְהוֹשִׁיעֵנוּ: וַאֲנַ֗חְנוּ לֹ֤א נֵדַע֙ מַֽה־נַּעֲשֶׂ֔ה כִּ֥י עָלֶ֖יךָ עֵינֵֽינוּ׃ \n\n" +
			"זְכֹר־רַחֲמֶ֣יךָ יְ֭הֹוָה וַחֲסָדֶ֑יךָ כִּ֖י מֵעוֹלָ֣ם הֵֽמָּה: יְהִי־חַסְדְּךָ֣ יְהֹוָ֣ה עָלֵ֑ינוּ כַּ֝אֲשֶׁ֗ר יִחַ֥לְנוּ לָֽךְ׃ אַֽל־תִּזְכׇּר־לָנוּ֮ עֲוֺנֹ֢ת רִאשֹׁ֫נִ֥ים מַ֭הֵר יְקַדְּמ֣וּנוּ רַחֲמֶ֑יךָ כִּ֖י דַלּ֣וֹנוּ מְאֹֽד׃ עֶ֭זְרֵנוּ בְּשֵׁ֣ם יְהֹוָ֑ה עֹ֝שֵׂ֗ה שָׁמַ֥יִם וָאָֽרֶץ׃ חׇנֵּ֣נוּ יְהֹוָ֣ה חׇנֵּ֑נוּ כִּי־רַ֗֝ב שָׂבַ֥עְנוּ בֽוּז׃ בְּרֹגֶז רַחֵם תִּזְכּוֹר. בְּרֹגֶז אַהֲבָה תִּזְכּוֹר. בְּרֹגֶז עֲקֵדָה תִּזְכּוֹר. בְּרֹגֶז תְּמִימוּת תִּזְכּוֹר: יְהֹוָ֥ה הוֹשִׁ֑יעָה הַ֝מֶּ֗לֶךְ יַעֲנֵ֥נוּ בְיוֹם־קׇרְאֵֽנוּ׃ כִּי־ה֭וּא יָדַ֣ע יִצְרֵ֑נוּ זָ֝כ֗וּר כִּי־עָפָ֥ר אֲנָֽחְנוּ׃ עׇזְרֵ֤נוּ ׀ אֱלֹ֘הֵ֤י יִשְׁעֵ֗נוּ עַֽל־דְּבַ֥ר כְּבֽוֹד־שְׁמֶ֑ךָ וְהַצִּילֵ֥נוּ וְכַפֵּ֥ר עַל־חַ֝טֹּאתֵ֗ינוּ לְמַ֣עַן שְׁמֶֽךָ׃");
	}

	private void addHallel() {
		addCategoryToSiddur(jewishDateInfo.getHallelOrChatziHallel());
		if (jewishDateInfo.getJewishCalendar().isCholHamoedSuccos()) {
			addToSiddurHighlighted(
				"(Say the bracha while holding the lulav, after you finish saying the bracha, pick up the etrog and wave both in this order: " +
				"South, North, East, Up, Down, West) אמור את הברכה בעודך עוטף את הלולב, לאחר שתסיים לאמור את הברכה, תשא את האתרוג ותנע את שני המינים בסדר הבא: דרום, צפון, מזרח, למעלה, למטה, מערב.");
			addToSiddurHighlighted(
				"(Use this compass to help you find which direction South is in. Do not hold your phone straight up or place it on a table, hold it normally.) " +
				"עזר לך למצוא את הכיוון הדרומי באמצעות המצפן הזה. אל תחזיק את הטלפון שלך בצורה ישרה למעלה או תנה אותו על שולחן, תחזיק אותו בצורה רגילה.:");
			addToSiddurHighlighted("בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ עַל נְטִילַת לוּלָב.");
			addToSiddurHighlighted("(For those fulfilling the commandment for the first time, recite the Shehechiyanu in addition to the blessing above) אם זו הפעם הראשונה שאתה אומר את הברכה, אז תאמר שהחיינו");
			addToSiddurHighlighted("בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם שֶׁהֶחֱיָנוּ וְקִיְּמָנוּ וְהִגִּיעָנוּ לַזְּמַן הַזֶּה.");
		}

		boolean isFullHallel = jewishDateInfo.getHallelOrChatziHallel().equals("הלל שלם");

		if (isFullHallel) {
			addToSiddurHighlighted("בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו, וְצִוָּנוּ לִגְמוֹר אֶת הַהַלֵּל:");
		}

		addToSiddurHighlighted(
			"הַ֥לְלוּיָ֨הּ ׀ הַ֭לְלוּ עַבְדֵ֣י יְהֹוָ֑ה הַֽ֝לְל֗וּ אֶת־שֵׁ֥ם יְהֹוָֽה׃ יְהִ֤י שֵׁ֣ם יְהֹוָ֣ה מְבֹרָ֑ךְ מֵ֝עַתָּ֗ה וְעַד־עוֹלָֽם׃ מִמִּזְרַח־שֶׁ֥מֶשׁ עַד־מְבוֹא֑וֹ מְ֝הֻלָּ֗ל שֵׁ֣ם יְהֹוָֽה׃ רָ֖ם עַל־כׇּל־גּוֹיִ֥ם ׀ יְהֹוָ֑ה עַ֖ל הַשָּׁמַ֣יִם כְּבוֹדֽוֹ׃ מִ֭י כַּיהֹוָ֣ה אֱלֹהֵ֑ינוּ הַֽמַּגְבִּיהִ֥י לָשָֽׁבֶת׃ הַֽמַּשְׁפִּילִ֥י לִרְא֑וֹת בַּשָּׁמַ֥יִם וּבָאָֽרֶץ׃ מְקִ֥ימִ֣י מֵעָפָ֣ר דָּ֑ל מֵ֝אַשְׁפֹּ֗ת יָרִ֥ים אֶבְיֽוֹן׃ לְהוֹשִׁיבִ֥י עִם־נְדִיבִ֑ים עִ֗֝ם נְדִיבֵ֥י עַמּֽוֹ׃ מֽוֹשִׁיבִ֨י ׀ עֲקֶ֬רֶת הַבַּ֗יִת אֵֽם־הַבָּנִ֥ים שְׂמֵחָ֗ה הַֽלְלוּיָֽהּ׃ \n\n" +
			"בְּצֵ֣את יִ֭שְׂרָאֵל מִמִּצְרָ֑יִם בֵּ֥ית יַ֝עֲקֹ֗ב מֵעַ֥ם לֹעֵֽז׃ הָיְתָ֣ה יְהוּדָ֣ה לְקׇדְשׁ֑וֹ יִ֝שְׂרָאֵ֗ל מַמְשְׁלוֹתָֽיו׃ הַיָּ֣ם רָ֭אָה וַיָּנֹ֑ס הַ֝יַּרְדֵּ֗ן יִסֹּ֥ב לְאָחֽוֹר׃ הֶ֭הָרִים רָקְד֣וּ כְאֵילִ֑ים גְּ֝בָע֗וֹת כִּבְנֵי־צֹֽאן׃ מַה־לְּךָ֣ הַ֭יָּם כִּ֣י תָנ֑וּס הַ֝יַּרְדֵּ֗ן תִּסֹּ֥ב לְאָחֽוֹר׃ הֶ֭הָרִים תִּרְקְד֣וּ כְאֵילִ֑ים גְּ֝בָע֗וֹת כִּבְנֵי־צֹֽאן׃ מִלִּפְנֵ֣י אָ֭דוֹן ח֣וּלִי אָ֑רֶץ מִ֝לִּפְנֵ֗י אֱל֣וֹהַּ יַעֲקֹֽב׃ הַהֹפְכִ֣י הַצּ֣וּר אֲגַם־מָ֑יִם חַ֝לָּמִ֗ישׁ לְמַעְיְנוֹ־מָֽיִם׃");

		if (isFullHallel) {
			addToSiddurHighlighted(
				"לֹ֤א לָ֥נוּ יְהֹוָ֗ה לֹ֫א לָ֥נוּ כִּֽי־לְ֭שִׁמְךָ תֵּ֣ן כָּב֑וֹד עַל־חַ֝סְדְּךָ֗ עַל־אֲמִתֶּֽךָ׃ לָ֭מָּה יֹאמְר֣וּ הַגּוֹיִ֑ם אַיֵּה־נָ֗֝א אֱלֹהֵיהֶֽם׃ וֵאלֹהֵ֥ינוּ בַשָּׁמָ֑יִם כֹּ֖ל אֲשֶׁר־חָפֵ֣ץ עָשָֽׂה׃ עֲֽ֭צַבֵּיהֶם כֶּ֣סֶף וְזָהָ֑ב מַ֝עֲשֵׂ֗ה יְדֵ֣י אָדָֽם׃ פֶּֽה־לָ֭הֶם וְלֹ֣א יְדַבֵּ֑רוּ עֵינַ֥יִם לָ֝הֶ֗ם וְלֹ֣א יִרְאֽוּ׃ אׇזְנַ֣יִם לָ֭הֶם וְלֹ֣א יִשְׁמָ֑עוּ אַ֥ף לָ֝הֶ֗ם וְלֹ֣א יְרִיחֽוּן׃ יְדֵיהֶ֤ם ׀ וְלֹ֬א יְמִישׁ֗וּן רַ֭גְלֵיהֶם וְלֹ֣א יְהַלֵּ֑כוּ לֹא־יֶ֝הְגּ֗וּ בִּגְרוֹנָֽם׃ כְּ֭מוֹהֶם יִהְי֣וּ עֹשֵׂיהֶ֑ם כֹּ֖ל אֲשֶׁר־בֹּטֵ֣חַ בָּהֶֽם׃ יִ֭שְׂרָאֵל בְּטַ֣ח בַּיהֹוָ֑ה עֶזְרָ֖ם וּמָגִנָּ֣ם הֽוּא׃ בֵּ֣ית אַ֭הֲרֹן בִּטְח֣וּ בַיהֹוָ֑ה עֶזְרָ֖ם וּמָגִנָּ֣ם הֽוּא׃ יִרְאֵ֣י יְ֭הֹוָה בִּטְח֣וּ בַיהֹוָ֑ה עֶזְרָ֖ם וּמָגִנָּ֣ם הֽוּא׃");
		}

		addToSiddurHighlighted(
			"יְהֹוָה֮ זְכָרָ֢נוּ יְבָ֫רֵ֥ךְ יְ֭בָרֵךְ אֶת־בֵּ֣ית יִשְׂרָאֵ֑ל יְ֝בָרֵ֗ךְ אֶת־בֵּ֥ית אַהֲרֹֽן׃ יְ֭בָרֵךְ יִרְאֵ֣י יְהֹוָ֑ה הַ֝קְּטַנִּ֗ים עִם־הַגְּדֹלִֽים׃ יֹסֵ֣ף יְהֹוָ֣ה עֲלֵיכֶ֑ם עֲ֝לֵיכֶ֗ם וְעַל־בְּנֵיכֶֽם׃ בְּרוּכִ֣ים אַ֭תֶּם לַיהֹוָ֑ה עֹ֝שֵׂ֗ה שָׁמַ֥יִם וָאָֽרֶץ׃ הַשָּׁמַ֣יִם שָׁ֭מַיִם לַיהֹוָ֑ה וְ֝הָאָ֗רֶץ נָתַ֥ן לִבְנֵי־אָדָֽם׃ לֹ֣א הַ֭מֵּתִים יְהַֽלְלוּ־יָ֑הּ וְ֝לֹ֗א כׇּל־יֹרְדֵ֥י דוּמָֽה׃ וַאֲנַ֤חְנוּ ׀ נְבָ֘רֵ֤ךְ יָ֗הּ מֵעַתָּ֥ה וְעַד־עוֹלָ֗ם הַֽלְלוּיָֽהּ׃");

		if (isFullHallel) {
			addToSiddurHighlighted(
				"אָ֭הַבְתִּי כִּי־יִשְׁמַ֥ע ׀ יְהֹוָ֑ה אֶת־ק֝וֹלִ֗י תַּחֲנוּנָֽי׃ כִּי־הִטָּ֣ה אׇזְנ֣וֹ לִ֑י וּבְיָמַ֥י אֶקְרָֽא׃ אֲפָפ֤וּנִי ׀ חֶבְלֵי־מָ֗וֶת וּמְצָרֵ֣י שְׁא֣וֹל מְצָא֑וּנִי צָרָ֖ה וְיָג֣וֹן אֶמְצָֽא׃ וּבְשֵֽׁם־יְהֹוָ֥ה אֶקְרָ֑א אָנָּ֥ה יְ֝הֹוָ֗ה מַלְּטָ֥ה נַפְשִֽׁי׃ חַנּ֣וּן יְהֹוָ֣ה וְצַדִּ֑יק וֵ֖אלֹהֵ֣ינוּ מְרַחֵֽם׃ שֹׁמֵ֣ר פְּתָאיִ֣ם יְהֹוָ֑ה דַּ֝לֹּתִ֗י וְלִ֣י יְהוֹשִֽׁיעַ׃ שׁוּבִ֣י נַ֭פְשִׁי לִמְנוּחָ֑יְכִי כִּֽי־יְ֝הֹוָ֗ה גָּמַ֥ל עָלָֽיְכִי׃ כִּ֤י חִלַּ֥צְתָּ נַפְשִׁ֗י מִ֫מָּ֥וֶת אֶת־עֵינִ֥י מִן־דִּמְעָ֑ה אֶת־רַגְלִ֥י מִדֶּֽחִי׃ אֶ֭תְהַלֵּךְ לִפְנֵ֣י יְהֹוָ֑ה בְּ֝אַרְצ֗וֹת הַחַיִּֽים׃ הֶ֭אֱמַנְתִּי כִּ֣י אֲדַבֵּ֑ר אֲ֝נִ֗י עָנִ֥יתִי מְאֹֽד׃ אֲ֭נִי אָמַ֣רְתִּי בְחׇפְזִ֑י כׇּֽל־הָאָדָ֥ם כֹּזֵֽב׃");
		}

		addToSiddurHighlighted(
			"מָה־אָשִׁ֥יב לַיהֹוָ֑ה כׇּֽל־תַּגְמוּל֥וֹהִי עָלָֽי׃ כּוֹס־יְשׁוּע֥וֹת אֶשָּׂ֑א וּבְשֵׁ֖ם יְהֹוָ֣ה אֶקְרָֽא׃ נְ֭דָרַי לַיהֹוָ֣ה אֲשַׁלֵּ֑ם נֶגְדָה־נָּ֗֝א לְכׇל־עַמּֽוֹ׃ יָ֭קָר בְּעֵינֵ֣י יְהֹוָ֑ה הַ֝מָּ֗וְתָה לַחֲסִידָֽיו׃ אָנָּ֣ה יְהֹוָה֮ כִּֽי־אֲנִ֢י עַ֫בְדֶּ֥ךָ אֲנִי־עַ֭בְדְּךָ בֶּן־אֲמָתֶ֑ךָ פִּ֝תַּ֗חְתָּ לְמֽוֹסֵרָֽי׃ לְֽךָ־אֶ֭זְבַּח זֶ֣בַח תּוֹדָ֑ה וּבְשֵׁ֖ם יְהֹוָ֣ה אֶקְרָֽא׃ נְ֭דָרַי לַיהֹוָ֣ה אֲשַׁלֵּ֑ם נֶגְדָה־נָּ֗֝א לְכׇל־עַמּֽוֹ׃ בְּחַצְר֤וֹת ׀ בֵּ֤ית יְהֹוָ֗ה בְּֽת֘וֹכֵ֤כִי יְרוּשָׁלַיִם הַֽלְלוּיָֽהּ׃ \n\n" +
			"הַֽלְל֣וּ אֶת־יְ֭הֹוָה כׇּל־גּוֹיִ֑ם שַׁ֝בְּח֗וּהוּ כׇּל־הָאֻמִּֽים׃ כִּ֥י גָ֘בַ֤ר עָלֵ֨ינוּ ׀ חַסְדּ֗וֹ וֶאֱמֶת־יְהֹוָ֥ה לְעוֹלָ֗ם הַֽלְלוּיָֽהּ׃");

		if (jewishDateInfo.getJewishCalendar().isCholHamoedSuccos()) {
			addToSiddurHighlighted(
				"הוֹד֣וּ (דרום/South)\n" +
				"לַיהֹוָ֣ה\n" +
				"כִּי (צפון/North)\n" +
				"ט֑וֹב (מזרח/East)\n" +
				"כִּ֖י (למעלה/Up)\n" +
				"לְעוֹלָ֣ם (למטה/Down)\n" +
				"חַסְדּֽוֹ (מערב/West)׃\n\n" +
				"יֹאמַר־נָ֥א יִשְׂרָאֵ֑ל כִּ֖י לְעוֹלָ֣ם חַסְדּֽוֹ׃ \n\n" +
				"יֹאמְרוּ־נָ֥א בֵֽית־אַהֲרֹ֑ן כִּ֖י לְעוֹלָ֣ם חַסְדּֽוֹ׃ \n\n" +
				"יֹאמְרוּ־נָ֭א יִרְאֵ֣י יְהֹוָ֑ה כִּ֖י לְעוֹלָ֣ם חַסְדּֽוֹ׃ \n\n" +
				"מִֽן־הַ֭מֵּצַר קָרָ֣אתִי יָּ֑הּ עָנָ֖נִי בַמֶּרְחָ֣ב יָֽהּ׃ יְהֹוָ֣ה לִ֭י לֹ֣א אִירָ֑א מַה־יַּעֲשֶׂ֖ה לִ֣י אָדָֽם׃ יְהֹוָ֣ה לִ֭י בְּעֹזְרָ֑י וַ֝אֲנִ֗י אֶרְאֶ֥ה בְשֹׂנְאָֽי׃ ט֗וֹב לַחֲס֥וֹת בַּיהֹוָ֑ה מִ֝בְּטֹ֗חַ בָּאָדָֽם׃ ט֗וֹב לַחֲס֥וֹת בַּיהֹוָ֑ה מִ֝בְּטֹ֗חַ בִּנְדִיבִֽים׃ כׇּל־גּוֹיִ֥ם סְבָב֑וּנִי בְּשֵׁ֥ם יְ֝הֹוָ֗ה כִּ֣י אֲמִילַֽם׃ סַבּ֥וּנִי גַם־סְבָב֑וּנִי בְּשֵׁ֥ם יְ֝הֹוָ֗ה כִּ֣י אֲמִילַֽם׃ סַבּ֤וּנִי כִדְבוֹרִ֗ים דֹּ֭עֲכוּ כְּאֵ֣שׁ קוֹצִ֑ים בְּשֵׁ֥ם יְ֝הֹוָ֗ה כִּ֣י אֲמִילַֽם׃ דַּחֹ֣ה דְחִיתַ֣נִי לִנְפֹּ֑ל וַ֖יהֹוָ֣ה עֲזָרָֽנִי׃ עָזִּ֣י וְזִמְרָ֣ת יָ֑הּ וַֽיְהִי־לִ֗֝י לִישׁוּעָֽה׃ ק֤וֹל ׀ רִנָּ֬ה וִישׁוּעָ֗ה בְּאׇהֳלֵ֥י צַדִּיקִ֑ים יְמִ֥ין יְ֝הֹוָ֗ה עֹ֣שָׂה חָֽיִל׃ יְמִ֣ין יְ֭הֹוָה רוֹמֵמָ֑ה יְמִ֥ין יְ֝הֹוָ֗ה עֹ֣שָׂה חָֽיִל׃ לֹא־אָמ֥וּת כִּֽי־אֶחְיֶ֑ה וַ֝אֲסַפֵּ֗ר מַעֲשֵׂ֥י יָֽהּ׃ יַסֹּ֣ר יִסְּרַ֣נִּי יָּ֑הּ וְ֝לַמָּ֗וֶת לֹ֣א נְתָנָֽנִי׃ פִּתְחוּ־לִ֥י שַׁעֲרֵי־צֶ֑דֶק אָבֹא־בָ֗֝ם אוֹדֶ֥ה יָֽהּ׃ זֶה־הַשַּׁ֥עַר לַיהֹוָ֑ה צַ֝דִּיקִ֗ים יָבֹ֥אוּ בֽוֹ׃ \n\n" +
				"א֭וֹדְךָ כִּ֣י עֲנִיתָ֑נִי וַתְּהִי־לִ֗֝י לִישׁוּעָֽה׃ א֭וֹדְךָ כִּ֣י עֲנִיתָ֑נִי וַתְּהִי־לִ֗֝י לִישׁוּעָֽה׃  אֶ֭בֶן מָאֲס֣וּ הַבּוֹנִ֑ים הָ֝יְתָ֗ה לְרֹ֣אשׁ פִּנָּֽה׃ אֶ֭בֶן מָאֲס֣וּ הַבּוֹנִ֑ים הָ֝יְתָ֗ה לְרֹ֣אשׁ פִּנָּֽה׃ מֵאֵ֣ת יְ֭הֹוָה הָ֣יְתָה זֹּ֑את הִ֖יא נִפְלָ֣את בְּעֵינֵֽינוּ׃ מֵאֵ֣ת יְ֭הֹוָה הָ֣יְתָה זֹּ֑את הִ֖יא נִפְלָ֣את בְּעֵינֵֽינוּ׃ זֶה־הַ֭יּוֹם עָשָׂ֣ה יְהֹוָ֑ה נָגִ֖ילָה וְנִשְׂמְחָ֣ה בֽוֹ׃ זֶה־הַ֭יּוֹם עָשָׂ֣ה יְהֹוָ֑ה נָגִ֖ילָה וְנִשְׂמְחָ֣ה בֽוֹ׃");
			addToSiddurHighlighted("אָ (דרום/South)\nנָּא (צפון/North)\nיְ֭הֹוָה\nהוֹ (מזרח/East)\nשִׁ֘י (למעלה/Up)\nעָ֥ה (למטה/Down)\nנָּ֑א (מערב/West)");
			addToSiddurHighlighted("אָ (דרום/South)\nנָּא (צפון/North)\nיְ֭הֹוָה\nהוֹ (מזרח/East)\nשִׁ֘י (למעלה/Up)\nעָ֥ה (למטה/Down)\nנָּ֑א (מערב/West)");
			addToSiddurHighlighted(
				"אָנָּ֥א יְ֝הֹוָ֗ה הַצְלִ֘יחָ֥ה נָּֽא, אָנָּ֥א יְ֝הֹוָ֗ה הַצְלִ֘יחָ֥ה נָּֽא׃ \n\n" +
				"בָּר֣וּךְ הַ֭בָּא בְּשֵׁ֣ם יְהֹוָ֑ה בֵּ֝רַ֥כְנוּכֶ֗ם מִבֵּ֥ית יְהֹוָֽה׃ בָּר֣וּךְ הַ֭בָּא בְּשֵׁ֣ם יְהֹוָ֑ה בֵּ֝רַ֥כְנוּכֶ֗ם מִבֵּ֥ית יְהֹוָֽה׃ אֵ֤ל ׀ יְהֹוָה֮ וַיָּ֢אֶ֫ר לָ֥נוּ אִסְרוּ־חַ֥ג בַּעֲבֹתִ֑ים עַד־קַ֝רְנ֗וֹת הַמִּזְבֵּֽחַ׃ אֵ֤ל ׀ יְהֹוָה֮ וַיָּ֢אֶ֫ר לָ֥נוּ אִסְרוּ־חַ֥ג בַּעֲבֹתִ֑ים עַד־קַ֝רְנ֗וֹת הַמִּזְבֵּֽחַ׃ אֵלִ֣י אַתָּ֣ה וְאוֹדֶ֑ךָּ אֱ֝לֹהַ֗י אֲרוֹמְמֶֽךָּ׃ אֵלִ֣י אַתָּ֣ה וְאוֹדֶ֑ךָּ אֱ֝לֹהַ֗י אֲרוֹמְמֶֽךָּ׃");
			addToSiddurHighlighted(
				"הוֹד֣וּ (דרום/South)\n" +
				"לַיהֹוָ֣ה\n" +
				"כִּי (צפון/North)\n" +
				"ט֑וֹב (מזרח/East)\n" +
				"כִּ֖י (למעלה/Up)\n" +
				"לְעוֹלָ֣ם (למטה/Down)\n" +
				"חַסְדּֽוֹ (מערב/West)׃");
		} else {
			addToSiddurHighlighted(
				"הוֹד֣וּ לַיהֹוָ֣ה כִּי־ט֑וֹב כִּ֖י לְעוֹלָ֣ם חַסְדּֽוֹ׃ \n\n" +
				"יֹאמַר־נָ֥א יִשְׂרָאֵ֑ל כִּ֖י לְעוֹלָ֣ם חַסְדּֽוֹ׃ \n\n" +
				"יֹאמְרוּ־נָ֥א בֵֽית־אַהֲרֹ֑ן כִּ֖י לְעוֹלָ֣ם חַסְדּֽוֹ׃ \n\n" +
				"יֹאמְרוּ־נָ֭א יִרְאֵ֣י יְהֹוָ֑ה כִּ֖י לְעוֹלָ֣ם חַסְדּֽוֹ׃ \n\n" +
				"מִֽן־הַ֭מֵּצַר קָרָ֣אתִי יָּ֑הּ עָנָ֖נִי בַמֶּרְחָ֣ב יָֽהּ׃ יְהֹוָ֣ה לִ֭י לֹ֣א אִירָ֑א מַה־יַּעֲשֶׂ֖ה לִ֣י אָדָֽם׃ יְהֹוָ֣ה לִ֭י בְּעֹזְרָ֑י וַ֝אֲנִ֗י אֶרְאֶ֥ה בְשֹׂנְאָֽי׃ ט֗וֹב לַחֲס֥וֹת בַּיהֹוָ֑ה מִ֝בְּטֹ֗חַ בָּאָדָֽם׃ ט֗וֹב לַחֲס֥וֹת בַּיהֹוָ֑ה מִ֝בְּטֹ֗חַ בִּנְדִיבִֽים׃ כׇּל־גּוֹיִ֥ם סְבָב֑וּנִי בְּשֵׁ֥ם יְ֝הֹוָ֗ה כִּ֣י אֲמִילַֽם׃ סַבּ֥וּנִי גַם־סְבָב֑וּנִי בְּשֵׁ֥ם יְ֝הֹוָ֗ה כִּ֣י אֲמִילַֽם׃ סַבּ֤וּנִי כִדְבוֹרִ֗ים דֹּ֭עֲכוּ כְּאֵ֣שׁ קוֹצִ֑ים בְּשֵׁ֥ם יְ֝הֹוָ֗ה כִּ֣י אֲמִילַֽם׃ דַּחֹ֣ה דְחִיתַ֣נִי לִנְפֹּ֑ל וַ֖יהֹוָ֣ה עֲזָרָֽנִי׃ עָזִּ֣י וְזִמְרָ֣ת יָ֑הּ וַֽיְהִי־לִ֗֝י לִישׁוּעָֽה׃ ק֤וֹל ׀ רִנָּ֬ה וִישׁוּעָ֗ה בְּאׇהֳלֵ֥י צַדִּיקִ֑ים יְמִ֥ין יְ֝הֹוָ֗ה עֹ֣שָׂה חָֽיִל׃ יְמִ֣ין יְ֭הֹוָה רוֹמֵמָ֑ה יְמִ֥ין יְ֝הֹוָ֗ה עֹ֣שָׂה חָֽיִל׃ לֹא־אָמ֥וּת כִּֽי־אֶחְיֶ֑ה וַ֝אֲסַפֵּ֗ר מַעֲשֵׂ֥י יָֽהּ׃ יַסֹּ֣ר יִסְּרַ֣נִּי יָּ֑הּ וְ֝לַמָּ֗וֶת לֹ֣א נְתָנָֽנִי׃ פִּתְחוּ־לִ֥י שַׁעֲרֵי־צֶ֑דֶק אָבֹא־בָ֗֝ם אוֹדֶ֥ה יָֽהּ׃ זֶה־הַשַּׁ֥עַר לַיהֹוָ֑ה צַ֝דִּיקִ֗ים יָבֹ֥אוּ בֽוֹ׃ \n\n" +
				"א֭וֹדְךָ כִּ֣י עֲנִיתָ֑נִי וַתְּהִי־לִ֗֝י לִישׁוּעָֽה׃ א֭וֹדְךָ כִּ֣י עֲנִיתָ֑נִי וַתְּהִי־לִ֗֝י לִישׁוּעָֽה׃  אֶ֭בֶן מָאֲס֣וּ הַבּוֹנִ֑ים הָ֝יְתָ֗ה לְרֹ֣אשׁ פִּנָּֽה׃ אֶ֭בֶן מָאֲס֣וּ הַבּוֹנִ֑ים הָ֝יְתָ֗ה לְרֹ֣אשׁ פִּנָּֽה׃ מֵאֵ֣ת יְ֭הֹוָה הָ֣יְתָה זֹּ֑את הִ֖יא נִפְלָ֣את בְּעֵינֵֽינוּ׃ מֵאֵ֣ת יְ֭הֹוָה הָ֣יְתָה זֹּ֑את הִ֖יא נִפְלָ֣את בְּעֵינֵֽינוּ׃ זֶה־הַ֭יּוֹם עָשָׂ֣ה יְהֹוָ֑ה נָגִ֖ילָה וְנִשְׂמְחָ֣ה בֽוֹ׃ זֶה־הַ֭יּוֹם עָשָׂ֣ה יְהֹוָ֑ה נָגִ֖ילָה וְנִשְׂמְחָ֣ה בֽוֹ׃ \n\n" +
				"אָנָּא יְ֭הֹוָה הוֹשִׁ֘יעָ֥ה נָּ֑א, אָנָּ֣א יְ֭הֹוָה הוֹשִׁ֘יעָ֥ה נָּ֑א \n\n" +
				"אָנָּ֥א יְ֝הֹוָ֗ה הַצְלִ֘יחָ֥ה נָּֽא, אָנָּ֥א יְ֝הֹוָ֗ה הַצְלִ֘יחָ֥ה נָּֽא׃ \n\n" +
				"בָּר֣וּךְ הַ֭בָּא בְּשֵׁ֣ם יְהֹוָ֑ה בֵּ֝רַ֥כְנוּכֶ֗ם מִבֵּ֥ית יְהֹוָֽה׃ בָּר֣וּךְ הַ֭בָּא בְּשֵׁ֣ם יְהֹוָ֑ה בֵּ֝רַ֥כְנוּכֶ֗ם מִבֵּ֥ית יְהֹוָֽה׃ אֵ֤ל ׀ יְהֹוָה֮ וַיָּ֢אֶ֫ר לָ֥נוּ אִסְרוּ־חַ֥ג בַּעֲבֹתִ֑ים עַד־קַ֝רְנ֗וֹת הַמִּזְבֵּֽחַ׃ אֵ֤ל ׀ יְהֹוָה֮ וַיָּ֢אֶ֫ר לָ֥נוּ אִסְרוּ־חַ֥ג בַּעֲבֹתִ֑ים עַד־קַ֝רְנ֗וֹת הַמִּזְבֵּֽחַ׃ אֵלִ֣י אַתָּ֣ה וְאוֹדֶ֑ךָּ אֱ֝לֹהַ֗י אֲרוֹמְמֶֽךָּ׃ אֵלִ֣י אַתָּ֣ה וְאוֹדֶ֑ךָּ אֱ֝לֹהַ֗י אֲרוֹמְמֶֽךָּ׃ הוֹד֣וּ לַיהֹוָ֣ה כִּי־ט֑וֹב כִּ֖י לְעוֹלָ֣ם חַסְדּֽוֹ׃");
		}
		addToSiddurHighlighted("הוֹד֣וּ לַיהֹוָ֣ה כִּי־ט֑וֹב כִּ֖י לְעוֹלָ֣ם חַסְדּֽוֹ׃");

		if (isFullHallel) {
			addToSiddurHighlighted(
				"יְהַלְלוּךָ יְהֹוָה אֱלֹהֵינוּ כָּל מַעֲשֶׂיךָ, וַחֲסִידֶיךָ וְצַדִּיקִים עוֹשֵׂי רְצוֹנֶךָ וְעַמְּךָ בֵּית יִשְׂרָאֵל, כֻּלָּם בְּרִנָּה יוֹדוּ וִיבָרְכוּ וִישַׁבְּחוּ וִיפָאֲרוּ אֶת שֵׁם כְּבוֹדֶךָ, כִּי לְךָ טוֹב לְהוֹדוֹת, וּלְשִׁמְךָ נָעִים לְזַמֵּר. וּמֵעוֹלָם וְעַד עוֹלָם אַתָּה אֵל. בָּרוּךְ אַתָּה יְהֹוָה, מֶלֶךְ מְהֻלָּל בַּתִּשְׁבָּחוֹת. אָמֵן:");
		}

		addToSiddurHighlighted(
			"(יש אומרים פסוק זה אחר ההלל שלש פעמים/Some say this three times after Hallel) (חזו״ע חנוכה ש) \n\n" +
			"וְאַבְרָהָ֣ם זָקֵ֔ן בָּ֖א בַּיָּמִ֑ים וַֽיהֹוָ֛ה בֵּרַ֥ךְ אֶת־אַבְרָהָ֖ם בַּכֹּֽל׃ \n\n" +
			"זְבַדְיָה (יכוין/Have in mind) \n\n" +
			"(ואחר כך יאמר/Then say) \n\n" +
			"יִשְׁמְרֵנִי וִיחַיֵנִי, כֵּן יְהִי רָצוֹן מִלְּפָנֶיךָ אֱלֹהִים חַיִּים וּמֶלֶךְ עוֹלָם אֲשֶׁר בְּיָדוֹ נֶפֶשׁ כָּל חַי אָמֵן כֵּן יְהִי רָצוֹן:");
	}

	private void addHalfKaddish(boolean highlighted) {
		String Kaddish = "יִתְגַּדַּל וְיִתְקַדַּשׁ שְׁמֵהּ רַבָּא. [אָמֵן] בְּעָלְמָא דִּי בְרָא, כִּרְעוּתֵהּ, וְיַמְלִיךְ מַלְכוּתֵהּ, וְיַצְמַח פֻּרְקָנֵהּ, וִיקָרֵב מְשִׁיחֵהּ. [אָמֵן] בְּחַיֵּיכוֹן וּבְיוֹמֵיכוֹן וּבְחַיֵּי דְכָל בֵּית יִשְׂרָאֵל, בַּעֲגָלָא וּבִזְמַן קָרִיב, וְאִמְרוּ אָמֵן. [אָמֵן] יְהֵא שְׁמֵהּ רַבָּא מְבָרַךְ לְעָלַם וּלְעָלְמֵי עָלְמַיָּא יִתְבָּרַךְ. וְיִשְׁתַּבַּח. וְיִתְפָּאַר. וְיִתְרוֹמַם. וְיִתְנַשֵּׂא. וְיִתְהַדָּר. וְיִתְעַלֶּה. וְיִתְהַלָּל שְׁמֵהּ דְּקֻדְשָׁא, בְּרִיךְ הוּא. [אָמֵן] לְעֵלָּא מִן כָּל בִּרְכָתָא שִׁירָתָא, תִשְׁבְּחָתָא וְנֶחֱמָתָא, דַּאֲמִירָן בְּעָלְמָא, וְאִמְרוּ אָמֵן. [אָמֵן]";
		if (highlighted) {
			addToSiddurHighlighted(Kaddish);
		} else {
			addToSiddur(Kaddish);
		}
	}

	private void addKaddishTitkabal(boolean highlighted) {
		String kaddishTitkabal = "יִתְגַּדַּל וְיִתְקַדַּשׁ שְׁמֵהּ רַבָּא. [אָמֵן] בְּעָלְמָא דִּי בְרָא, כִּרְעוּתֵהּ, וְיַמְלִיךְ מַלְכוּתֵהּ, וְיַצְמַח פֻּרְקָנֵהּ, וִיקָרֵב מְשִׁיחֵהּ. [אָמֵן] בְּחַיֵּיכוֹן וּבְיוֹמֵיכוֹן וּבְחַיֵּי דְכָל בֵּית יִשְׂרָאֵל, בַּעֲגָלָא וּבִזְמַן קָרִיב, וְאִמְרוּ אָמֵן. [אָמֵן] יְהֵא שְׁמֵהּ רַבָּא מְבָרַךְ לְעָלַם וּלְעָלְמֵי עָלְמַיָּא יִתְבָּרַךְ. וְיִשְׁתַּבַּח. וְיִתְפָּאַר. וְיִתְרוֹמַם. וְיִתְנַשֵּׂא. וְיִתְהַדָּר. וְיִתְעַלֶּה. וְיִתְהַלָּל שְׁמֵהּ דְּקֻדְשָׁא, בְּרִיךְ הוּא. [אָמֵן] לְעֵלָּא מִן כָּל בִּרְכָתָא שִׁירָתָא, תִשְׁבְּחָתָא וְנֶחֱמָתָא, דַּאֲמִירָן בְּעָלְמָא, וְאִמְרוּ אָמֵן. [אָמֵן] \n" +
		"תִּתְקַבַּל צְלוֹתָֽנָא וּבָֽעוּתָֽנָא, עִם צְלֽוֹתְהוֹן וּבָעֽוּתְהוֹן דְּכָל־בֵּית יִשְׂרָאֵל, קֳדָם אֲבוּנָא דְּבִשְׁמַיָּא, וְאִמְרוּ אָמֵן. [אָמֵן] \n" +
		"יְהֵא שְׁלָמָא רַבָּא מִן שְׁמַיָּא. חַיִּים וְשָׂבָע וִישׁוּעָה וְנֶחָמָה. וְשֵׁיזָבָא וּרְפוּאָה וּגְאוּלָה וּסְלִיחָה וְכַפָּרָה וְרֶוַח וְהַצָּלָה לָנוּ וּלְכָל עַמּוֹ יִשְׂרָאֵל. וְאִמְרוּ אָמֵן. [אָמֵן]\n";
		String kTWithRegEnd = kaddishTitkabal + "עוֹשֶׂה שָׁלוֹם בִּמְרוֹמָיו. הוּא בְּרַחֲמָיו יַעֲשֶׂה שָׁלוֹם עָלֵינוּ וְעַל כָּל־עַמּוֹ יִשְׂרָאֵל. וְאִמְרוּ אָמֵן. [אָמֵן]";
		if (highlighted) {
			if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()) {
				addToSiddurHighlighted(kaddishTitkabal + "עוֹשֶׂה הַשָּׁלוֹם בִּמְרוֹמָיו. הוּא בְּרַחֲמָיו יַעֲשֶׂה שָׁלוֹם עָלֵינוּ וְעַל כָּל־עַמּוֹ יִשְׂרָאֵל. וְאִמְרוּ אָמֵן. [אָמֵן]");
			} else {
				addToSiddurHighlighted(kTWithRegEnd);
			}
		} else {
			if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()) {
				addToSiddur(kaddishTitkabal.trim());
				addToSiddur("עוֹשֶׂה");
				addToSiddurHighlighted("הַשָּׁלוֹם");
				addToSiddur("בִּמְרוֹמָיו. הוּא בְּרַחֲמָיו יַעֲשֶׂה שָׁלוֹם עָלֵינוּ וְעַל כָּל־עַמּוֹ יִשְׂרָאֵל. וְאִמְרוּ אָמֵן. [אָמֵן]");
			} else {
				addToSiddur(kTWithRegEnd);
			}
		}
	}

	private void addKaddishAlYisrael() {
		// See Yalkut Yosef Siman 56, 21
		addToSiddur(
			"יִתְגַּדַּל וְיִתְקַדַּשׁ שְׁמֵהּ רַבָּא. [אָמֵן] בְּעָלְמָא דִּי בְרָא, כִּרְעוּתֵהּ, וְיַמְלִיךְ מַלְכוּתֵהּ, וְיַצְמַח פֻּרְקָנֵהּ, וִיקָרֵב מְשִׁיחֵהּ. [אָמֵן] בְּחַיֵּיכוֹן וּבְיוֹמֵיכוֹן וּבְחַיֵּי דְכָל בֵּית יִשְׂרָאֵל, בַּעֲגָלָא וּבִזְמַן קָרִיב, וְאִמְרוּ אָמֵן. [אָמֵן] יְהֵא שְׁמֵהּ רַבָּא מְבָרַךְ לְעָלַם וּלְעָלְמֵי עָלְמַיָּא יִתְבָּרַךְ. וְיִשְׁתַּבַּח. וְיִתְפָּאַר. וְיִתְרוֹמַם. וְיִתְנַשֵּׂא. וְיִתְהַדָּר. וְיִתְעַלֶּה. וְיִתְהַלָּל שְׁמֵהּ דְּקֻדְשָׁא, בְּרִיךְ הוּא. [אָמֵן] לְעֵלָּא מִן כָּל בִּרְכָתָא שִׁירָתָא, תִשְׁבְּחָתָא וְנֶחֱמָתָא, דַּאֲמִירָן בְּעָלְמָא, וְאִמְרוּ אָמֵן. [אָמֵן] \n" +
			"עַל יִשְׂרָאֵל וְעַל רַבָּנָן. וְעַל תַּלְמִידֵיהוֹן וְעַל כָּל תַּלְמִידֵי תַלְמִידֵיהוֹן. דְּעָסְקִין בְּאוֹרַיְתָא קַדִּשְׁתָּא. דִּי בְאַתְרָא הָדֵין וְדִי בְכָל אֲתַר וַאֲתַר. יְהֵא לָנָא וּלְכוֹן וּלְהוֹן חִנָּא וְחִסְדָּא וְרַחֲמֵי. מִן קֳדָם מָארֵי שְׁמַיָּא וְאַרְעָא וְאִמְרוּ אָמֵן. [אָמֵן] \n" +
			"יְהֵא שְׁלָמָא רַבָּא מִן שְׁמַיָּא. חַיִּים וְשָׂבָע וִישׁוּעָה וְנֶחָמָה. וְשֵׁיזָבָא וּרְפוּאָה וּגְאוּלָה וּסְלִיחָה וְכַפָּרָה וְרֶוַח וְהַצָּלָה לָנוּ וּלְכָל עַמּוֹ יִשְׂרָאֵל. וְאִמְרוּ אָמֵן. [אָמֵן]\n" +
			"עוֹשֶׂה שָׁלוֹם בִּמְרוֹמָיו. הוּא בְּרַחֲמָיו יַעֲשֶׂה שָׁלוֹם עָלֵינוּ וְעַל כָּל־עַמּוֹ יִשְׂרָאֵל. וְאִמְרוּ אָמֵן. [אָמֵן]");
	}

	private void addKaddishYeheShelama() {
		addToSiddur(
			"יִתְגַּדַּל וְיִתְקַדַּשׁ שְׁמֵהּ רַבָּא. [אָמֵן] בְּעָלְמָא דִּי בְרָא, כִּרְעוּתֵהּ, וְיַמְלִיךְ מַלְכוּתֵהּ, וְיַצְמַח פֻּרְקָנֵהּ, וִיקָרֵב מְשִׁיחֵהּ. [אָמֵן] בְּחַיֵּיכוֹן וּבְיוֹמֵיכוֹן וּבְחַיֵּי דְכָל בֵּית יִשְׂרָאֵל, בַּעֲגָלָא וּבִזְמַן קָרִיב, וְאִמְרוּ אָמֵן. [אָמֵן] יְהֵא שְׁמֵהּ רַבָּא מְבָרַךְ לְעָלַם וּלְעָלְמֵי עָלְמַיָּא יִתְבָּרַךְ. וְיִשְׁתַּבַּח. וְיִתְפָּאַר. וְיִתְרוֹמַם. וְיִתְנַשֵּׂא. וְיִתְהַדָּר. וְיִתְעַלֶּה. וְיִתְהַלָּל שְׁמֵהּ דְּקֻדְשָׁא, בְּרִיךְ הוּא. [אָמֵן] לְעֵלָּא מִן כָּל בִּרְכָתָא שִׁירָתָא, תִשְׁבְּחָתָא וְנֶחֱמָתָא, דַּאֲמִירָן בְּעָלְמָא, וְאִמְרוּ אָמֵן. [אָמֵן] \n" +
			"יְהֵא שְׁלָמָא רַבָּא מִן שְׁמַיָּא. חַיִּים וְשָׂבָע וִישׁוּעָה וְנֶחָמָה. וְשֵׁיזָבָא וּרְפוּאָה וּגְאוּלָה וּסְלִיחָה וְכַפָּרָה וְרֶוַח וְהַצָּלָה לָנוּ וּלְכָל עַמּוֹ יִשְׂרָאֵל. וְאִמְרוּ אָמֵן. [אָמֵן]\n" +
			"עוֹשֶׂה שָׁלוֹם בִּמְרוֹמָיו. הוּא בְּרַחֲמָיו יַעֲשֶׂה שָׁלוֹם עָלֵינוּ וְעַל כָּל־עַמּוֹ יִשְׂרָאֵל. וְאִמְרוּ אָמֵן. [אָמֵן]");
	}

	private void addPitumHaketoret() {
		addCategoryToSiddur("פטום הקטרת");
		addToSiddur(
			"אַתָּה הוּא יְהֹוָה אֱלֹהֵֽינוּ, שֶׁהִקְטִֽירוּ אֲבוֹתֵֽינוּ לְפָנֶֽיךָ אֶת קְטֹֽרֶת הַסַּמִּים, בִּזְמַן שֶׁבֵּית הַמִּקְדָשׁ קַיָּם, כַּאֲשֶׁר צִוִּֽיתָ אוֹתָם עַל־יַד מֹשֶׁה נְבִיאָךְ, כַּכָּתוּב בְּתֽוֹרָתָךְ: \n\n" +
			"וַיֹּ֩אמֶר֩ יְהֹוָ֨ה אֶל־מֹשֶׁ֜ה קַח־לְךָ֣ סַמִּ֗ים נָטָ֤ף ׀ וּשְׁחֵ֙לֶת֙ וְחֶלְבְּנָ֔ה סַמִּ֖ים וּלְבֹנָ֣ה זַכָּ֑ה בַּ֥ד בְּבַ֖ד יִהְיֶֽה׃ וְעָשִׂ֤יתָ אֹתָהּ֙ קְטֹ֔רֶת רֹ֖קַח מַעֲשֵׂ֣ה רוֹקֵ֑חַ מְמֻלָּ֖ח טָה֥וֹר קֹֽדֶשׁ׃ וְשָֽׁחַקְתָּ֣ מִמֶּ֘נָּה֮ הָדֵק֒ וְנָתַתָּ֨ה מִמֶּ֜נָּה לִפְנֵ֤י הָעֵדֻת֙ בְּאֹ֣הֶל מוֹעֵ֔ד אֲשֶׁ֛ר אִוָּעֵ֥ד לְךָ֖ שָׁ֑מָּה קֹ֥דֶשׁ קׇֽדָשִׁ֖ים תִּהְיֶ֥ה לָכֶֽם׃ וְנֶאֱמַר: וְהִקְטִ֥יר עָלָ֛יו אַהֲרֹ֖ן קְטֹ֣רֶת סַמִּ֑ים בַּבֹּ֣קֶר בַּבֹּ֗קֶר בְּהֵיטִיב֛וֹ אֶת־הַנֵּרֹ֖ת יַקְטִירֶֽנָּה: וּבְהַעֲלֹ֨ת אַהֲרֹ֧ן אֶת־הַנֵּרֹ֛ת בֵּ֥ין הָעַרְבַּ֖יִם יַקְטִירֶ֑נָּה קְטֹ֧רֶת תָּמִ֛יד לִפְנֵ֥י יְהֹוָ֖ה לְדֹרֹתֵיכֶֽם: \n\n" +
			"תָּנוּ רַבָּנָן: פִּטּוּם הַקְּטֹֽרֶת כֵּיצַד? שְׁלֹשׁ מֵאוֹת וְשִׁשִּׁים וּשְׁמוֹנָה מָנִים הָיוּ בָהּ. שְׁלֹשׁ מֵאוֹת וְשִׁשִּׁים וַֽחֲמִשָּׁה כְּמִנְיַן יְמוֹת הַחַמָּה, מָנֶה בְּכָל־יוֹם, מַֽחֲצִיתוֹ בַּבֹּֽקֶר וּמַֽחֲצִיתוֹ בָּעֶרֶב. וּשְׁלֹשָׁה מָנִים יְתֵרִים, שֶׁמֵּהֶם מַכְנִיס כֹּהֵן גָּדוֹל, וְנוֹטֵל מֵהֶם מְלֹא חָפְנָיו בְּיוֹם הַכִּפּוּרִים, מַֽחֲזִירָן לַמַכְתֶּֽשֶׁת בְּעֶֽרֶב יוֹם הַכִּפּוּרִים, כְּדֵי לְקַיֵּם מִצְוַת דַקָּה מִן הַדַּקָּה. וְאַחַד־עָשָׂר סַמָּנִים הָיוּ בָהּ, וְאֵֽלּוּ הֵן: \n\n" +
			"[א] הַצֳּרִי [ב] וְהַצִּפֹּֽרֶן [ג] וְהַחֶלְבְּנָה [ד] וְהַלְּבוֹנָה, מִשְׁקַל שִׁבְעִים שִׁבְעִים מָנֶה. [ה] מוֹר, [ו] וּקְצִיעָה [ז] וְשִׁבֹּֽלֶת נֵרְדְּ [ח] וְכַרְכֹּם, מִשְׁקַל שִׁשָּׁה עָשָׂר שִׁשָּׁה עָשָׂר מָנֶה. [ט] קוֹשְְֹטְ שְׁנֵים עָשָׂר, [י] קִלּוּפָה שְׁלֹשָׁה, [יא] קִנָּמוֹן תִּשְׁעָה, בּוֹרִית־כַּרְשִׁינָה תִּשְׁעָה קַבִּין. יֵין קַפְרִיסִין סְאִין תְּלָת וְקַבִּין תְּלָתָא. וְאִם לֹא מָצָא יֵין קַפְרִיסִין, מֵבִיא חֲמַר חִיוָר עַתִּיק. מֶֽלַח סְדוֹמִית, רֽוֹבַע. מַעֲלֶה עָשָׁן, כָּל־שֶׁהוּא. רִבִּי נָתָן הַבַּבְלִי אוֹמֵר: אַף כִּפַּת הַיַּרְדֵּן כָּל־שֶׁהִיא, אִם נָתַן בָּהּ דְּבַשׁ פְּסָלָהּ, וְאִם חִסֵּר אַחַת מִכָּל־סַמְמָנֶֽיהָ, חַיָּיב מִיתָה: \n\n" +
			"רַבָּן שִׁמְעוֹן בֶּן־גַּמְלִיאֵל אוֹמֵר: הַצֳּרִי אֵינוֹ אֶלָּא שְׁרָף, הַנּוֹטֵף מֵֽעֲצֵי הַקְּטָף. בֹּרִית כַּרְשִׁינָה, לְמָה הִיא בָֽאָה? כְּדֵי לְשַׁפּוֹת בָּהּ אֶת־הַצִּפֹּֽרֶן, כְּדֵי שֶׁתְּהֵא נָאָה. יֵין קַפְרִיסִין, לְמָה הוּא בָא? כְּדֵי לִשְׁרוֹת בּוֹ אֶת־הַצִּפֹּֽרֶן כְּדֵי שֶׁתְּהֵא עַזָּה. וַהֲלֹא מֵי רַגְלַֽיִם יָפִין לָהּ? אֶלָּא שֶׁאֵין מַכְנִיסִין מֵי רַגְלַֽיִם בַּמִּקְדָּשׁ, מִפְּנֵי הַכָּבוֹד: \n\n" +
			"תַּנְיָא רִבִּי נָתָן אוֹמֵר: כְּשֶׁהוּא שׁוֹחֵק, אוֹמֵר: הָדֵק הֵיטֵב, הֵיטֵב הָדֵק. מִפְּנֵי שֶׁהַקּוֹל יָפֶה לַבְּשָׂמִים. פִּטְּמָהּ לַֽחֲצָאִין, כְּשֵׁרָה. לְשָׁלִישׁ וּלְרָבִֽיעַ, לֹא שָׁמַֽעְנוּ. אָמַר רִבִּי יְהוּדָה: זֶה הַכְּלָל, אִם כְּמִדָּתָהּ, כְּשֵׁרָה לַֽחֲצָאִין. וְאִם חִסֵּר אַחַת מִכָּל־סַמְמָנֶֽיהָ, חַיָּיב מִיתָה: \n\n" +
			"תָּנֵי בַר־קַפָּרָא: אַחַת לְשִׁשִּׁים אוֹ לְשִׁבְעִים שָׁנָה, הָֽיְתָה בָֽאָה שֶׁל שִׁירַֽיִם לַֽחֲצָאִין. וְעוֹד תָּנֵי בַר־קַפָּרָא: אִלּוּ הָיָה נוֹתֵן בָּהּ קָרְטוֹב שֶׁל דְּבַשׁ, אֵין אָדָם יָכוֹל לַֽעֲמֹד מִפְּנֵי רֵיחָהּ. וְלָֽמָּה אֵין מְעָֽרְבִין בָּהּ דְּבַשׁ? מִפְּנֵי שֶׁהַתּוֹרָה אָֽמְרָה: כִּ֤י כָל־שְׂאֹר֙ וְכָל־דְּבַ֔שׁ לֹֽא־תַקְטִ֧ירוּ מִמֶּ֛נּוּ אִשֶּׁ֖ה לַֽיהֹוָֽה: יְהֹוָ֣ה צְבָא֣וֹת עִמָּ֑נוּ מִשְׂגָּֽב־לָ֨נוּ אֱלֹהֵ֖י יַֽעֲקֹ֣ב סֶֽלָה׃ יְהֹוָ֥ה צְבָא֑וֹת אַֽשְׁרֵ֥י אָ֝דָ֗ם בֹּטֵ֥חַ בָּֽךְ׃ יְהֹוָ֥ה הוֹשִׁ֑יעָה הַ֝מֶּ֗לֶךְ יַעֲנֵ֥נוּ בְיוֹם־קׇרְאֵֽנוּ: וְעָֽרְבָה֙ לַֽיהֹוָ֔ה מִנְחַ֥ת יְהוּדָ֖ה וִיְרוּשָׁלַיִם כִּימֵ֣י עוֹלָ֔ם וּכְשָׁנִ֖ים קַדְמֹנִיֹּֽת:");
	}

	private void addAlenu() {
		addCategoryToSiddur("עלינו");
		addToSiddur(
			"עָלֵֽינוּ לְשַׁבֵּֽחַ לַֽאֲדוֹן הַכֹּל, לָתֵת גְּדֻלָּה לְיוֹצֵר בְּרֵאשִׁית, שֶׁלֹּא עָשָֽׂנוּ כְּגוֹיֵי הָֽאֲרָצוֹת, וְלֹא שָׂמָֽנוּ כְּמִשְׁפְּחוֹת הָֽאֲדָמָה, שֶׁלֹּא שָׂם חֶלְקֵֽנוּ כָּהֶם וְגוֹרָלֵֽנוּ כְּכָל-הֲמוֹנָם, שֶׁהֵם מִשְׁתַּֽחֲוִים לָהֶֽבֶל וָרִיק, וּמִתְפַּלְּלִים אֶל-אֵל לֹֽא יוֹשִׁיעַ. וַֽאֲנַֽחְנוּ מִשְׁתַּחֲוִים לִפְנֵי מֶֽלֶךְ מַלְכֵי הַֽמְּלָכִים הַקָּדוֹשׁ בָּרוּךְ הוּא, שֶׁהוּא נוֹטֶה שָׁמַֽיִם וְיוֹסֵד אָֽרֶץ, וּמוֹשַׁב יְקָרוֹ בַּשָּׁמַֽיִם מִמַּֽעַל, וּשְׁכִינַת עֻזּוֹ בְּגָבְהֵי מְרוֹמִים. הוּא אֱלֹהֵֽינוּ, וְאֵין עוֹד אַחֵר, אֱמֶת מַלְכֵּֽנוּ וְאֶֽפֶס זוּלָתוֹ. כַּכָּתוּב בַּתּוֹרָה. וְיָדַעְתָּ֣ הַיּ֗וֹם וַהֲשֵׁבֹתָ֮ אֶל־לְבָבֶךָ֒ כִּ֤י יְהֹוָה֙ ה֣וּא הָֽאֱלֹהִ֔ים בַּשָּׁמַ֣יִם מִמַּ֔עַל וְעַל־הָאָ֖רֶץ מִתָּ֑חַת אֵ֖ין עֽוֹד: \n\n" +
			"עַל כֵּן נְקַוֶּה לָךְ, יְהֹוָה אֱלֹהֵֽינוּ, לִרְאוֹת מְהֵרָה בְּתִפְאֶֽרֶת עֻזָּךְ, לְהַֽעֲבִיר גִּלּוּלִים מִן הָאָֽרֶץ, וְהָֽאֱלִילִים כָּרוֹת יִכָּֽרֵתוּן, לְתַקֵּן עוֹלָם בְּמַלְכוּת שַׁדַּי, וְכָל-בְּנֵי בָשָׂר יִקְרְאוּ בִשְׁמֶֽךָ, לְהַפְנוֹת אֵלֶֽיךָ כָּל-רִשְׁעֵי אָֽרֶץ. יַכִּֽירוּ וְיֵֽדְעוּ כָּל-יֽוֹשְׁבֵי תֵבֵֽל, כִּי לְךָ תִכְרַע כָּל-בֶּֽרֶךְ, תִּשָּׁבַע כָּל-לָשׁוֹן. לְפָנֶֽיךָ, יְהֹוָה אֱלֹהֵֽינוּ יִכְרְעוּ וְיִפֹּֽלוּ, וְלִכְבוֹד שִׁמְךָ יְקָר יִתֵּֽנוּ, וִיקַבְּלוּ כֻלָּם אֶת-עֹל מַלְכוּתֶֽךָ, וְתִמְלוֹךְ עֲלֵיהֶם מְהֵרָה לְעוֹלָם וָעֶד. כִּי הַמַּלְכוּת שֶׁלְּךָ הִיא, וּלְעֽוֹלְמֵי עַד תִּמְלוֹךְ בְּכָבוֹד. כַּכָּתוּב בְּתוֹרָתָךְ: יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד׃ וְנֶאֱמַר. וְהָיָ֧ה יְהֹוָ֛ה לְמֶ֖לֶךְ עַל־כָּל־הָאָ֑רֶץ בַּיּ֣וֹם הַה֗וּא יִהְיֶ֧ה יְהֹוָ֛ה אֶחָ֖ד וּשְׁמ֥וֹ אֶחָֽד׃");
	}

	private void addBarchu(boolean shouldAddBrayta) {
		if (shouldAddBrayta) {
			addToSiddur(
				"(מי שמתפלל ביחיד יאמר/Someone who is praying alone should say this\n\n" +
				"אָמַר רַבִּי עֲקִיבָא: חַיָּה אַחַת עוֹמֶדֶת בָּרָקִיעַ וּשְׁמָהּ יִשְׂרָאֵל, וְחָקוּק עַל מִצְחָהּ יִשְׂרָאֵל. עוֹמֶדֶת בְּאֶמְצַע הָרָקִיעַ וְאוֹמֶרֶת. בָּרְכוּ אֵת הַשֵׁם הַמְּבֹרָךְ וְכֹל גְּדוּדֵי מַעְלָה עוֹנִים וְאוֹמְרִים. בָּרוּךְ הַשֵׁם הַמְּבֹרָךְ לְעוֹלָם וָעֶד.)");
		}
		addToSiddur(
			"ואומר החזן: בָּרְכוּ אֶת יְהֹוָה הַמְּבֹרָךְ: \n" +
			"ועונים הקהל: בָּרוּךְ יְהֹוָה הַמְּבֹרָךְ לְעוֹלָם וָעֵד: \n" +
			"ואומר החזן: בָּרוּךְ יְהֹוָה הַמְּבֹרָךְ לְעוֹלָם וָעֵד");
	}

	private void addHoshanot() {
		addCategoryToSiddur("הושענות");
		addToSiddurHighlighted(
			"אֶרְחַ֣ץ בְּנִקָּי֣וֹן כַּפָּ֑י וַאֲסֹבְבָ֖ה אֶת־מִזְבַּחֲךָ֣ יְהֹוָֽה׃\n\nהוֹשַׁעֲנָא, הוֹשַׁעֲנָא:\n\n" +
			"לְמַעֲנָךְ אֱלֹהֵֽינוּ. לְמַעֲנָךְ בּֽוֹרְאֵֽנוּ. לְמַעֲנָךְ גּוֹאֲלֵֽנוּ. לְמַעֲנָךְ דּֽוֹרְשֵֽׁנוּ: " +
			"לְמַעֲנָךְ אַדִּיר אַדִּירִים. לְמַעֲנָךְ בּוֹרֵא רֽוּחַ וְיוֹצֵר הָרִים. לְמַעֲנָךְ גְּדוֹל הָעֵצָה מַשְׁפִּיל וּמֵרִים. לְמַעֲנָךְ דּוֹבֵר צֶֽדֶק מַגִּיד מֵישָׁרִים. לְמַעֲנָךְ הַיּוֹדֵֽעַ וָעֵד אִם יִסָּתֵר אִישׁ בְּמִּסְתָּרִים. לְמַעֲנָךְ וְהוּא בְּאֶחָד וּמִי יְשִׁיבֶֽנּוּ אֲמָרִים. לְמַעֲנָךְ זָךְ וְנָקִי וּמִתְבָּרֵר עִם בָּרִים. לְמַעֲנָךְ חוֹפֵשׂ מַצְפּוּן וְחוֹקֵר כָּל־חֲדָרִים. לְמַעֲנָךְ טִפְּחָה יְמִינוֹ שָׁמַֽיִם וְעָשָׂה מְאוֹרִים. לְמַעֲנָךְ יָסַד אֶֽרֶץ בַּצּוּרוֹת בִּקַּע יְאוֹרִים. לְמַעֲנָךְ כַּבִּיר כֹּֽחַ מְכֻבָּד בָּאוּרִים. לְמַעֲנָךְ לֹא יִתַּֽמּוּ שְׁנוֹתָיו לְדוֹר דּוֹרִים:\n\n" +
			"הוֹשַׁעֲנָא, הוֹשַׁעֲנָא:");

		if (jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 15
				|| jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
			String kahalResponse = (jewishDateInfo.getJewishCalendar().isHoshanaRabba()
					? " הוֹשִׁיעֵֽנוּ בְּהַקָּפַת פַּֽעַם אֶחָת: "
					: " הוֹשִׁיעֵֽנוּ בַּחֲגִיגַת יוֹם אֶחָד: ");

			addToSiddurHighlighted(
				"אָֽנָּֽא אֵל אֶחָד וּשְׁמוֹ אֶחָד. וּמִי יְשִׁיבֶֽנּוּ וְהוּא בְאֶחָד. קָרָא שָׁמַֽיִם וָאָֽרֶץ וַיַּעַמְדוּ כְּאֶחָד."
				+ kahalResponse +
				"אָֽנָּֽא זְכוֹר אָב יָרַשׁ אֶת הָאָֽרֶץ וְהָיָה אֶחָד. הֵכִין לַמּוֹרְדִים לֵב אֶחָד וְדֶֽרֶךְ אֶחָד. לִקְרֹא כֻלָּם בְּשֵׁם יְהֹוָה וּלְעָבְדוֹ שְׁכֶֽם אֶחָד."
				+ kahalResponse +
				"אָֽנָּֽא זְכוֹר בֵּן יָחִיד הָיָה לִפְנֵי אָבִיו אֶחָד. שְׁנֵיהֶם בְּנִסָּיוֹן הָֽלְכֽוּ כְּאֶחָד. נָתַֽתָּ כֹּֽפֶר תַּחְתָּיו אַֽיִל אֶחָד."
				+ kahalResponse +
				"אָֽנָּֽא זְכוֹר אָב הוֹסִיף חֵֽלֶק שְׁכֶֽם אֶחָד. קִוָּה לְהַפְלִיט הַמַּחֲנֶה הָאֶחָד. אָסַף בָּנָיו לְקַבֵּל מַלְכוּת שָׁמַֽיִם פֶּה אֶחָד."
				+ kahalResponse +
				"אָֽנָּֽא הַמַּשְׁמִיעֵֽנוּ שְׁתַּֽיִם בְּקוֹלוֹת וּבְרָקִים כְּאֶחָד. הַמַּנְחִילֵֽנוּ תּוֹרָה אַחַת וּמִשְׁפָּט אֶחָד. "
				+ kahalResponse.trim() +
				"\n\n" +
				"הוֹשַׁעֲנָא. הוֹשַׁעֲנָא:");

			if (jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
				addToSiddurHighlighted(
					"יָהּ אָיוֹם, זְכֹר הַיּוֹם, בְּרִית שִׁבְעַת תְּמִימֶֶֽיךָ. בְּרִית אֶזְרַח, אֲשֶׁר אָרַח, בְּחֻקּוֹת דָּת נְאוּמֶֶֽיךָ, אָב רַחְמָן, קָרֵב זְמַן, פְּדוּתֵֽנוּ בְּרַחֲמֶֶֽיךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
					" \r\n" +
					"מְחוֹלֵל כֹּל, וְכָל יָכֹל, הֱיֵה נִדְרָשׁ לְדוֹרְשֶֽׁיךָ. וְהִמָּצֵא, וְהִתְרַצֶּה, לְעַם דּוֹפְקֵי דְלָתֶֽיךָ. בְּהַזְכִּירָם, זְכוּת אַבְרָהָם, וְצִדְקַת כָּל־חֲסִידֶֶֽיךָ. שְׁעֵה נִיבָם, בְּהִתְקָֽרְבָֽם, בְּלוּלָבָם לְשַׁחֲרֶֽיךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
					" \r\n" +
					"רַחֲמָנָא אִדְכַּר לָן קְיָמֵהּ דְּאַבְרָהָם רְחִימָא:\r\n" +
					"רַחֲמָנָא אָרֵים אָרֵים יְמִינָךְ וְאַצְמַח פֻּרְקָנָךְ:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְחַיֵּי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְרַחֲמֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְצַדִּיקֵי וַחֲסִידֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דִישָׁרֵי וּתְמִימֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְפַרְנָסָתָא טַבְתָּא וּמְזוֹנֵי טָבֵי:\r\n" +
					"רַחֲמָנָא פְּתַח שְׁמַיָּא לִצְלוֹתִין:\r\n" +
					"רַחֲמָנָא תּוּב מֵרֻגְזָךְ:\r\n" +
					"רַחֲמָנָא וְלָא נֶהְדָּר רֵיקָם מִן־קַמָּךְ:\r\n" +
					" \r\n" +
					"שְׁמַ֖ע יִשְׂרָאֵ֑ל יְהֹוָ֥ה אֱלֹהֵ֖ינוּ יְהֹוָ֥ה ׀ אֶחָֽד׃\r\n" +
					" \r\n" +
					"יְהֹוָה֙ ה֣וּא הָאֱלֹהִ֔ים יְהֹוָ֖ה ה֥וּא הָאֱלֹהִֽים׃ (שתי פעמים/twice)\r\n" +
					" \r\n" +
					"יְהֹוָה מֶֽלֶךְ, יְהֹוָה מָלָֽךְ, יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד׃ (שתי פעמים/twice)\r\n" +
					" \r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם שְׁמַע קוֹלֵֽנוּ וְקַבֵּל תְּפִלָּתֵֽנוּ בְּרָצוֹן:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם אַל־תְּאַבְּדֵֽנוּ בְּאֹֽרֶךְ גָּלוּתֵֽנוּ:\r\n" +
					" אַבֵּד כָּל־הַקָּמִים עָלֵֽינוּ לְרָעָה:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם חָתְמֵֽנוּ בְּסֵֽפֶר חַיִּים טוֹבִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר צַדִּיקִים וַחֲסִידִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר יְשָׁרִים וּתְמִימִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר מְזוֹנוֹת וּפַרְנָסָה טוֹבָה:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם קָֽרְבֵֽנוּ לַעֲבוֹדָתֶֽךָ:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם רְפָא כָּל־חוֹלֵי עַמְּךָ יִשְׂרָאֵל:\r\n" +
					" \r\n" +
					"עֲנֵֽנוּ אֱלֹהֵי אַבְרָהָם עֲנֵֽנוּ: עֲנֵֽנוּ הָעוֹנֶה בְּעֵת רָצוֹן עֲנֵֽנוּ: עֲנֵֽנוּ רַחוּם וְחַנּוּן עֲנֵֽנוּ:\r\n" +
					" \r\n" +
					"יְהֹוָה חָנֵּֽנוּ וַהֲקִימֵֽנוּ. וּבְסֵֽפֶר חַיִּים זָכְרֵֽנוּ וְחָתְמֵֽנוּ:\r\n" +
					"יְהֹוָה אוֹר פָּנֶֽיךָ הַיּוֹם נְסָה עָלֵֽינוּ. וּבְסֵֽפֶר חַיִּים זָכְרֵֽנוּ וְחָתְמֵֽנוּ:\r\n" +
					" \r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן שְׁמֶֽךָ. וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן אַבְרָהָם אֶזְרָח תְּמִימֶֽךָ. וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן הֲרוּגִים וּשְׂרוּפִים עַל יִחוּד קְדֻשַּׁת שְׁמֶֽךָ. וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					" \r\n" +
					"דְּעָנֵי לְאַבְרָהָם אָבִֽינוּ בְּהַר הַמּוֹרִיָּה. עֲנֵינָן:\r\n" +
					"דְּעָנֵי לְצַדִּיקֵי וַחֲסִידֵי וּתְמִימֵי דִּי בְּכָל־דָּר וְדָר. עֲנֵינָן:\r\n" +
					" \r\n" +
					"תּֽוֹדִיעֵנִי֮ אֹ֤רַח חַ֫יִּ֥ים שֹׂ֣בַע שְׂ֭מָחוֹת אֶת־פָּנֶ֑יךָ נְעִמ֖וֹת בִּימִינְךָ֣ נֶֽצַח׃\r\n" +
					"אָֽנָּֽא בְּכֹֽחַ. גְּדוּלַת יְמִינֶֽךָ. תַּתִּיר צְרוּרָה:");
			} /*
				 * Commented out because this will not be shown on our app, considering this is
				 * a Yom Tov
				 * else {
				 * addToSiddurHighlighted(
				 * "אֶל יִשְׁעֲךָ צָמֵֽאתִי. וָאֶעֱרֹךְ נֶגְדֶּֽךָ. שַׂ֭מֵּחַ נֶ֣פֶשׁ עַבְדֶּ֑ךָ: נָ֭אוֹר אַתָּ֥ה אַדִּ֗יר. הֱיֵה לָֽנוּ לִישׁוּעָה. שַׂ֭מְּחֵֽנוּ כִּימ֣וֹת עִנִּיתָ֑נוּ שְׁ֝נ֗וֹת רָאִ֥ינוּ רָעָֽה: יְשׁוּעוֹת חוֹמוֹת וָחֵֽל. שִׁית לְסוּרָה וְגַלְמוּדָה. יִשְׂמַ֤ח ׀ הַר־צִיּ֗וֹן תָּ֭גֵלְנָה בְּנ֣וֹת יְהוּדָ֑ה: יָֽדְךָֽ הוֹסִיף שֵׁנִית. חִישׁ לְנוֹחֲלֵי דַת אֲרִיאֵל. יָגֵ֥ל יַ֝עֲקֹ֗ב יִשְׂמַ֥ח יִשְׂרָאֵֽל: צַ֝וֵּ֗ה יְשׁוּע֥וֹת יַעֲקֹֽב. אֲשֶׁר לְיִשְׁעֲךָ כְּמֵהִים. וְֽצַדִּיקִ֗ים יִשְׂמְח֣וּ יַ֭עַלְצוּ לִפְנֵ֥י אֱלֹהִ֗ים: חֶֽבֶל נַחֲלָֽתְךָֽ תּוֹשִֽׁיעַ. וְצִדְקָֽתְךָֽ יְשַׁנֵּֽנוּ. וְיִשְׂמְח֨וּ כׇל־ח֪וֹסֵי בָ֡ךְ לְעוֹלָ֣ם יְ֭רַנֵּנוּ: קוֹרְאִים בְּשִׁמְךָ. תְּשׁוֹבֵב לְבֵית מְנוּחָה. שָׂשׂ֤וֹן וְשִׂמְחָה֙ יַשִּׂ֔יגוּ וְנָ֖סוּ יָג֥וֹן וַאֲנָחָֽה: בִּישׁוּעָֽתְךָֽ יְרַנֵּֽנוּ. וְרָנֵּי פַלֵּט בְּחִכָּם. יִשְׂמַ֣ח יִשְׂרָאֵ֣ל בְּעֹשָׂ֑יו בְּנֵֽי־צִ֝יּ֗וֹן יָגִ֥ילוּ בְמַלְכָּֽם: רַב לְהוֹשִֽׁיעַ. יָרִיב רִיבָם וְיָצִיק לִמְצִיקָם. יִשְׂמַ֣ח צַ֭דִּיק כִּי־חָזָ֣ה נָקָ֑ם: וְיֵדְעוּ כִּי יָֽדְךָ זֹאת. תְּשׁוּעָֽתְךָֽ לְשַׁנֵּן. כִּ֤י שִׂמַּחְתַּ֣נִי יְהֹוָ֣ה בְּפׇעֳלֶ֑ךָ בְּֽמַעֲשֵׂ֖י יָדֶ֣יךָ אֲרַנֵּֽן: אִמְרָֽתְךָֽ תָקִים יֶֽשַׁע לְהָחִישׁ לִפְדוּיִם. רָנּ֤וּ לְיַֽעֲקֹב֙ שִׂמְחָ֔ה וְצַהֲל֖וּ בְּרֹ֣אשׁ הַגּוֹיִ֑ם: לוֹבְשֵׁי בִּגְדֵי רִקְמָה. יָרֹֽנּוּ בְּכָל־אֲפִיקִים. שִׂמְח֬וּ בַיהֹוָ֣ה וְ֭גִילוּ צַדִּיקִ֑ים: יִרְאוּ עֲנָוִים וְיִשְׂמָֽחוּ. בְּהוֹשִׁיעֲךָ אֶבְיוֹנַי. יִ֝שְׂמַ֗ח לֵ֤ב ׀ מְבַקְשֵׁ֬י יְהֹוָֽה: קוֹרְאֵי מִקְרָא קֹֽדֶשׁ. יֶֽשַׁע יִקְרְאוּ בְּפֶֽצַח. שֹׂ֣בַע שְׂ֭מָחוֹת אֶת־פָּנֶ֑יךָ נְעִמ֖וֹת בִּימִינְךָ֣ נֶֽצַח: בָּרִאשׁוֹן בְּחַגָּם כְּהַיּוֹם. הוֹשַׁע צוּר בְּנִיבוֹ. זֶה־הַ֭יּוֹם עָשָׂ֣ה יְהֹוָ֑ה נָגִ֖ילָה וְנִשְׂמְחָ֣ה בֽוֹ:\r\n"
				 * +
				 * " \r\n" +
				 * "הוֹשַׁעֲנָא. הוֹשַׁעֲנָא:\r\n" +
				 * " \r\n" +
				 * "אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
				 * " \r\n" +
				 * "אָֽנָּֽא אֵל אַחֲרוֹן וְרִאשׁוֹן. אַמֵּץ עַם נְצוּרִים כְּאִישׁוֹן. בְּצַעֲקָם הוֹשַׁעֲנָא בְלַחֲשׁוֹן. הַיּוֹם בְּיוֹם רִאשׁוֹן. הוֹשִֽׁיעָה נָּא: אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n"
				 * +
				 * "אָנָּא גְּדַֽע נִינֵי דִשׁוֹן. גְּאַל מְיַחֲדֶֽיךָ בְלַחֲשׁוֹן. וּנְטֵה לָֽנוּ שָׁלוֹם כְּמֵימֵי פִישׁוֹן. הַיּוֹם בְּיוֹם רִאשׁוֹן. הוֹשִֽׁיעָה נָּא: אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n"
				 * +
				 * " \r\n" +
				 * "אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
				 * " \r\n" +
				 * "כְּהוֹשַׁעְתָּ יְרוּיֵי הַיְאוֹר. בְּעֻזְּךָ הַנָּאוֹר. וְתַבְרִיק מָאוֹר. לַעֲלוּטִים כְּאִישׁוֹן: גַּם עַתָּה כְּמוֹ כֵן. אֵל שַֽׁחַק שׁוֹכֵן. פְּדוּת לְעַמְּךָ הָכֵן. נְהַלְלָךְ בְּיוֹם רִאשׁוֹן. כֵּן הוֹשַׁעֲנָא: אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n"
				 * +
				 * "כְּהוֹשַׁעְתָּ סֶֽגֶל. דֶּֽגֶל מוּל דֶּֽגֶל. וְרֹאשׁ מוֹעֲדֵי רֶֽגֶל. דִּשַּֽׁנְתָּ דִישׁוֹן: פְּדוּיֵי אָבִיב. נְקוּבֵי עַם חָבִיב. סוֹבְבֵי דַת סָבִיב. נְהַלְלָךְ בְּיוֹם רִאשׁוֹן. כֵּן הוֹשַׁעֲנָא: אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n"
				 * +
				 * " \r\n" +
				 * "מוֹשִֽׁיעַ חוֹסִים. הוֹשִֽׁיעַ אֱמוּנַי. עַם בְּדָֽתְךָֽ דוֹרְשִׁים. זֶֽרַע אֵיתָנַי: הַפַּֽעַם הַזֹּאת. אוֹדֶה אֶת יְהֹוָה:\r\n"
				 * +
				 * "רְצֵה נָא שַׁוְעָתָם. שְׁעֵה נָא לִתְפִלָּתָם. בַּפַּֽעַם רִאשׁוֹנָה. הֱיֵה נָא אֱיָלוּתָם. עַם אֲשֶׁר בְּיוֹם כִּפּוּר. מִפֶּֽשַׁע פְּדִיתָם. אוֹמְרִים וּמְהַלְּלִים. אֵין קָדוֹשׁ כַּיהֹוָה: הַפַּֽעַם הַזֹּאת, אוֹדֶה אֶת יְהֹוָה:\r\n"
				 * +
				 * " \r\n" +
				 * "כְּהוֹשַׁעְתָּ מֵאָז עֲדָתֶֽךָ, כֵּן הוֹשִׁ֤יעָה ׀ אֶת־עַמֶּ֗ךָ וּבָרֵ֥ךְ אֶת־נַחֲלָתֶ֑ךָ. נְהַלְלָךְ בְּיוֹם רִאשׁוֹן, כֵּן הוֹשַׁעֲנָא:"
				 * );
				 * }
				 */
		}

		if (jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
			addToSiddurHighlighted("הוֹשַׁעֲנָא. הוֹשַׁעֲנָא.");
		}

		if (jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 16
				|| jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
			String kahalResponse = (jewishDateInfo.getJewishCalendar().isHoshanaRabba()
					? " הוֹשִׁיעֵֽנוּ בְּהַקָּפַת פְּעָמִים שְׁנַֽיִם: "
					: " הוֹשִׁיעֵֽנוּ בַּחֲגִיגַת יָמִים שְׁנָֽיִם: ");
			addToSiddurHighlighted(
					"אָֽנָּֽא אֵל אֶחָד וּמְבַיֵּשׁ אֽוֹמְרִֽים שְׁנָֽיִם. בַּחֲצִי הַשֶׁם בְּרֵא עוֹלָמוֹת בְּאוֹתִיּוֹת שְׁנָֽיִם. יָצַר הַכֹּל בַּעֲבוּר אָדָם וְעֶזְרוֹ שְׁנָֽיִם."
					+ kahalResponse +
					"אָֽנָּֽא זְכֹר אָב בְּנָה בְּבֵית אֵל מִזְבְּחוֹת שְׁנָֽיִם. בְּנִסָיוֹן הָלַךְ עִם נְעָרִים שְׁנָֽיִם. וּקְרָאתוֹ מִן־הַשָּׁמַֽיִם פְּעָמִים שְׁנָֽיִם."
					+ kahalResponse +
					"אָֽנָּֽא זְכֹר בֵּן הִכְמִיר רַחֲמַי אָב בַּאֲמִירוֹת שְׁנָֽיִם. חֲנַנְתּוֹ גוֹיִם שְׁנַֽיִם וּלְאֻמִּים שְׁנָֽיִם. וַיְבָֽרֶךְ הֱוֵה גְבִיר פְּעָמִים שְׁנָֽיִם."
					+ kahalResponse +
					"אָֽנָּֽא זְכֹר הָיָה צָעִיר וְנָחַל פִּי שְׁנָֽיִם. וְעָשָׂה מַטְעַמִּים גְדָיִים שְׁנָֽיִם. עָבַר בְּמַקְלוֹ אֶת הַיַּרְדֵּן וְהָיָה לְמַחֲנוֹת שְׁנָֽיִם."
					+ kahalResponse +
					"אָֽנָּֽא הַמַּשְׁמִיעֵֽנוּ תּוֹרָה עַל־יְדֵי רוֹעִים שְׁנָֽיִם. הַמַנְחִילֵֽנוּ עֲשֶֽׂרֶת דְּבָרִים עַל לֻחוֹת שְׁנָֽיִם. הַמַאֲזִין וּמֵעִיד בָּנוּ עֵדִים שְׁנָֽיִם. "
					+ kahalResponse.trim() +
					"\n\n" +
					"הוֹשַׁעֲנָא. הוֹשַׁעֲנָא.");

			if (jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
				addToSiddurHighlighted(
					"בְּרִית נִפְקַד, אֲשֶׁר נֶעֱקַד, לְהַעֲלוֹת לְפָנֶֽיךָ. כְּשֶׂה נֶאֱסַר, וְגַם נִמְסָר, עֲשׂוֹת הַטּוֹב בְּעֵינֶֽיךָ. רְצֵה גִזְעוֹ, וְחֽוֹן זַרְעוֹ, בְּעֵת בּוֹאָם לְפָנֶֽיךָ. וְאִם חוֹבָם, עָנָה בָם, עֲשֵׂה נָא לְמַֽעַן שְׁמֶֽךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
					"זְכוּת יִצְחָק, בַּשַּֽׁחַק, חָתוּם בְּמִדַּת הַגְּבוּרָה. תִּזְכֹּר אֵלִי, צוּר גּוֹאֲלִי, לְעַם שׁוֹאֵל מִמָּךְ עֶזְרָה. עַקְדָתוֹ, וְצִדְקָתוֹ, מְשׁוֹךְ לְעַם בִּשְׁמָךְ נִקְרָא. חָתְמֵם לְטוֹבָה, בִּנְדָבָה, אֵל נֶאֱזָר בִּגְבוּרָה. מִנַּחֲלָֽתְךָֽ, וּסְגֻלָּֽתְךָֽ, לֹא תִכְלָא רַחֲמֶֽיךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
					" \r\n" +
					"רַחֲמָנָא אִדְכַּר לָן קְיָמֵהּ דְּיִצְחָק עֲקֵידָא:\r\n" +
					"רַחֲמָנָא בְּכִסּוּפֵי אַפִּין אָתֵֽינָא לְמִקְרֵי קַמָּךְ רַחֵם עֲלָן:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְחַיֵּי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְרַחֲמֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְצַדִּיקֵי וַחֲסִידֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דִישָׁרֵי וּתְמִימֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְפַרְנָסָתָא טַבְתָּא וּמְזוֹנֵי טָבֵי:\r\n" +
					"רַחֲמָנָא פְּתַח שְׁמַיָּא לִצְלוֹתִין:\r\n" +
					"רַחֲמָנָא תּוּב מֵרֻגְזָךְ:\r\n" +
					"רַחֲמָנָא וְלָא נֶהְדָּר רֵיקָם מִן־קַמָּךְ:\r\n" +
					" \r\n" +
					"שְׁמַ֖ע יִשְׂרָאֵ֑ל יְהֹוָ֥ה אֱלֹהֵ֖ינוּ יְהֹוָ֥ה ׀ אֶחָֽד׃\r\n" +
					" \r\n" +
					"יְהֹוָה֙ ה֣וּא הָאֱלֹהִ֔ים יְהֹוָ֖ה ה֥וּא הָאֱלֹהִֽים׃ (שתי פעמים/twice)\r\n" +
					" \r\n" +
					"יְהֹוָה מֶֽלֶךְ, יְהֹוָה מָלָֽךְ, יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד׃ (שתי פעמים/twice)\r\n" +
					" \r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם שְׁמַע קוֹלֵֽנוּ וְקַבֵּל תְּפִלָּתֵֽנוּ בְּרָצוֹן:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם בְּרִיתְךָ זְכֹר וְאַל־תִּשְׁכָּחֵֽנוּ:\r\n" +
					" בָּרֵךְ אֶת לַחְמֵֽנוּ וְאֶת מֵימֵֽינוּ:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם חָתְמֵֽנוּ בְּסֵֽפֶר חַיִּים טוֹבִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר צַדִּיקִים וַחֲסִידִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר יְשָׁרִים וּתְמִימִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר מְזוֹנוֹת וּפַרְנָסָה טוֹבָה:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם קָֽרְבֵֽנוּ לַעֲבוֹדָתֶֽךָ:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם רְפָא כָּל־חוֹלֵי עַמְּךָ יִשְׂרָאֵל:\r\n" +
					" \r\n" +
					"עֲנֵֽנוּ וּפַֽחַד יִצְחָק עֲנֵֽנוּ: עֲנֵֽנוּ הָעוֹנֶה בְּעֵת צָרָה עֲנֵֽנוּ: עֲנֵֽנוּ רַחוּם וְחַנּוּן עֲנֵֽנוּ:\r\n" +
					" \r\n" +
					"יְהֹוָה חָנֵּֽנוּ וַהֲקִימֵֽנוּ. וּבְסֵֽפֶר חַיִּים זָכְרֵֽנוּ וְחָתְמֵֽנוּ:\r\n" +
					"יְהֹוָה בְּיוֹם יְשׁוּעָֽתָה בַּשְׂרֵֽנוּ וְרַחֲמֵֽנוּ. וּבְסֵֽפֶר חַיִּים זָכְרֵֽנוּ וְחָתְמֵֽנוּ:\r\n" +
					" \r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן שְׁמֶֽךָ. וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן יִצְחָק נֶעֱקַד בְּאוּלָמֶּֽךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן הֲרוּגִים וּשְׂרוּפִים עַל יִחוּד קְדֻשַּׁת שְׁמֶֽךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					" \r\n" +
					"דְּעָנֵי לְיִצְחָק עַל גַּבֵּי־מַדְבְּחָא. עֲנֵינָן:\r\n" +
					"דְּעָנֵי לְצַדִּיקֵי וַחֲסִידֵי וּתְמִימֵי דִּי בְּכָל־דָּר וְדָר. עֲנֵינָן:\r\n" +
					" \r\n" +
					"תּֽוֹדִיעֵנִי֮ אֹ֤רַח חַ֫יִּ֥ים שֹׂ֣בַע שְׂ֭מָחוֹת אֶת־פָּנֶ֑יךָ נְעִמ֖וֹת בִּימִינְךָ֣ נֶֽצַח׃\r\n" +
					"קַבֵּל רִנַּת. עַמֶּךָ שַׂגְּבֵֽנוּ. טַהֲרֵֽנוּ נוֹרָא:");
			} else {
				// Even though this is a "Yom Tov" day outside Eretz Yisrael, this will always
				// be used in Eretz Yisrael; the 2nd day of Sukkot will never be on a Shabbat.
				addToSiddurHighlighted(
					"אֱלֹהִ֤ים ׀ אֵלִ֥י אַתָּ֗ה אֲֽשַׁ֫חֲרֶ֥ךָּ, מֵאֶֽרֶץ שִׁבְיִי וּפְזוּרִי, אֶשָּׂ֣א עֵ֭ינַי אֶל־הֶהָרִ֑ים מֵ֝אַ֗יִן יָבֹ֥א עֶזְרִֽי׃ בְּכׇל־לִבִּ֥י דְרַשְׁתִּ֑יךָ הִדָּֽרֶשׁ לִי מֵעָֽרֶץ. עֶ֭זְרִי מֵעִ֣ם יְהֹוָ֑ה עֹ֝שֵׂ֗ה שָׁמַ֥יִם וָאָֽרֶץ: גְבוּרָֽתְךָֽ עוֹרְרָה לְנֶאֱנָקִים בְּיַד רוֹדָם. הָֽבָה־לָּ֣נוּ עֶזְרָ֣ת מִצָּ֑ר וְ֝שָׁ֗וְא תְּשׁוּעַ֥ת אָדָֽם: (גֵּאִים בְּאָרְחָם מִגְּזֵרוֹת שְׂמֵחִים לְגִזְרָתִי, הַחֲזֵ֣ק מָגֵ֣ן וְצִנָּ֑ה וְ֝ק֗וּמָה בְּעֶזְרָתִֽי): גְּמֹל עַל עַבְדְּךָ אֶחְיֶה חֲבוֹשׁ לְנַפְשִׁי הָאֲנוּשָׁה. רְצֵ֣ה יְ֭הֹוָה לְהַצִּילֵ֑נִי יְ֝הֹוָ֗ה לְעֶזְרָ֥תִי חֽוּשָׁה: דָּֽבְקָֽה לֶעָפָר נַפְשֵֽׁנוּ בְּתִגְרַת קָמֶֽיךָ לְנֶגְדֶּֽךָ. ק֭וּמָֽה עֶזְרָ֣תָה לָּ֑נוּ וּ֝פְדֵ֗נוּ לְמַ֣עַן חַסְדֶּֽךָ: הִמָּֽצֵא לִי בְּקָרְאִי צוּר יִשְׁעִי וְגוֹאֲלִי, שְׁמַע־יְהֹוָ֥ה וְחׇנֵּ֑נִי יְ֝הֹוָ֗ה הֱֽיֵה־עֹזֵ֥ר לִֽי׃ וְאֶעֱנֶה חֽוֹרְפִֽי דָבָר בְּעֻזְּךָ אֵל עוֹזֵר, יָ֝ת֗וֹם אַתָּ֤ה ׀ הָיִ֬יתָ עוֹזֵֽר: זְרוּיִים בְּקַצְוֵי אֶֽרֶץ אֲשֶׁר בְּהֵיכַל דְּבִֽירְךָֽ יִנְהוּ, נַ֭פְשֵׁנוּ חִכְּתָ֣ה לַֽיהֹוָ֑ה עֶזְרֵ֖נוּ וּמָגִנֵּ֣נוּ הֽוּא: חֲרֵדִים בְּקַצְוֵי אֶֽרֶץ מֵהֲגוֹת גְּרוֹנָם נִחַר. עֶזְרָתִ֣י וּמְפַלְטִ֣י אַ֑תָּה אֱ֝לֹהַ֗י אַל־תְּאַחַֽר: טָרוּף בָּלֽוּעַ בְּפִיהֶם וּמִשָּׁם צִדְקָֽתְךָֽ אֲתַנֵּן, כִּֽי־הָיִ֣יתָ עֶזְרָ֣תָה לִּ֑י וּבְצֵ֖ל כְּנָפֶ֣יךָ אֲרַנֵּֽן: יוֹדֵֽעַ וְחוֹקֵר כְּלָיוֹת וּמַעֲשֵׂה יָדָיו וּמַעֲלְלוֹ. כִּֽי־יַ֭צִּיל אֶבְי֣וֹן מְשַׁוֵּ֑עַ וְ֝עָנִ֗י וְֽאֵין־עֹזֵ֥ר לֽוֹ: כָּלֽוּ עֵינַי מְיַחֵל שְׁעֵה אֶל שַׁוְעָתִי. ח֥וּשָׁה לְעֶזְרָתִ֑י אֲ֝דֹנָ֗י תְּשׁוּעָתִֽי: לְךְ אֲנִי הוֹשִׁיעֵֽנִי מִשְׁגַּבִּי וּמֵרִים רֹאשִׁי. הִנֵּ֣ה אֱ֭לֹהִים עֹזֵ֣ר לִ֑י אֲ֝דֹנָ֗י בְּֽסֹמְכֵ֥י נַפְשִֽׁי: מִשּׁוֹאֵיהֶם תָּשִׁיב נַפְשִׁי וְשֽׁוֹבְבֵֽנִי, עֶזְרָתִ֥י הָיִ֑יתָ אַֽל־תִּטְּשֵׁ֥נִי וְאַל־תַּ֝עַזְבֵ֗נִי אֱלֹהֵ֥י יִשְׁעִֽי׃ נְוֵה קָדְשְׁךְ כְּמֵאָז תְּשַׁכְלֵל וּתְיַקֵּר יֶֽקֶר. יַעְזְרֶ֥הָ אֱ֝לֹהִ֗ים לִפְנ֥וֹת בֹּֽקֶר: שְׂרִידֵי יְהוּדָה תְּבַקֵּר וּבְצֵל כְּנָפֶֽיךָ נִחְיֶה. יָדָיו֙ רָ֣ב ל֔וֹ וְעֵ֥זֶר מִצָּרָ֖יו תִּהְיֶֽה: עִיר מוֹעֲדֵֽנוּ אֲשֶׁר מִשָּׁם נִצָּֽעְנוּ. עֶזְרֵֽנוּ אֶלהֵי יִשְׁעֲנוּ כִּי בָךְ נוֹשָׁעֲנוּ; פָּרֽוֹחַ תִּפְרַח וְתָגֵל מִחְיָה בְּתִתָּם קוֹלָם. כִּי עֶזְרַת אֲבוֹתֵֽינוּ אַתָּה הוּא מֵעוֹלָם: צוּר יוֹם רִאשׁוֹן בְּקַחְתֵּֽנוּ לְרוֹמְמֶֽךָ. עׇזְרֵ֤נוּ ׀ אֱלֹ֘הֵ֤י יִשְׁעֵ֗נוּ עַֽל־דְּבַ֥ר כְּבֽוֹד־שְׁמֶ֑ךָ: קֶֽשֶׁר אֲגֻדָּה אַשְׁלִים לְהוֹדוֹת שִׁמְךָ אָזַֽרְתִּי. בּ֤וֹ בָטַ֥ח לִבִּ֗י וְֽנֶ֫עֱזָ֥רְתִּי: רַֽצְתִּי בְּכַפּוֹת תְּמָרִים רָצָה לְהַעֲבִיר שִׁמְצָה. אֱלֹהִ֣ים לָ֭נוּ מַחֲסֶ֣ה וָעֹ֑ז עֶזְרָ֥ה בְ֝צָר֗וֹת נִמְצָ֥א: שֽׁוֹקְדֵֽי עֲנַף עָבוֹת פְּרִי וְעַרְבֵי נַחֲלִי. וַֽאדֹנָ֤י יֱהֹוִה֙ יַֽעֲזׇר־לִ֔י: תַּֽעַשׂ עִמָּֽנוּ אוֹת לְטוֹבָה וְיִתְאַשְּׁרוּן בְּךָ בְּחִירֶֽיךָ. עַ֚ם נוֹשַׁ֣ע בַּיהֹוָ֔ה מָגֵ֣ן עֶזְרֶ֔ךָ: וְתֵרֶא אוֹיַֽבְתִּי וְתֵבוֹשׁ אֲשֶׁר גְּאַלְתָּנוּ. כִּי־אַתָּה יְהֹוָה עֲזַרְתָּֽנוּ וְנִחַמְתָּֽנוּ:\n\n" +

					"הוֹשַׁעֲנָא. הוֹשַׁעֲנָא:\n\n" +

					"אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\n\n" +

					"אָֽנָּֽא יֽוֹצְרִֽי דָּרְשֵֽׁנִי. וְכִימֵי עוֹלָם חָפְשֵֽׁנִי. וּמַדֵּי הֽוֹדְךָֽ תַּלְבִּישֵֽׁנִי. הַיּוֹם בְּיוֹם שֵׁנִי. הוֹשִֽׁיעָה נָּא: אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\n\n" +
					"אָֽנָּֽא סֹב נָא וְהַנְפִישֵֽׁנִי. וּמִמֵּימֵי מְצוּלָה הַמְשֵֽׁנִי. פְּנֵה אֵלִי וְאַל תְּבִישֵֽׁנִי. הַיּוֹם בְּיוֹם שֵׁנִי. הוֹשִֽׁיעָה נָּא: אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\n\n" +

					"אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\n\n" +

					"כְּהוֹשַׁעְתָּ יְגִיעֵי נֶֽשֶׁם. וּמֻכֵּי גֵו וָגֶֽשֶׁם. וַיֶּאְשְׁמוּ אָשֵׁם. אָצִים לְנָקְשֵֽׁנִי: סוֹחֲחֵי פִלּוּל, פְּצוֹת לְךָ הִלּוּל, לְסַלְסְלָךְ בְּמִלּוּל. נְהַלְלָךְ בְּיוֹם שֵׁנִי. כֵּן הוֹשַׁעֲנָא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\n\n" +
					"כְּהוֹשַׁעְתָּ יֽוֹצְאֵֽי חָנֵס. בְּמוֹפֵת וָנֵס. וְשִׁחַתָּ אוֹנֵס. חוֹשֵׁק לְכַבְּשֵֽׁנִי: שְׂרִידֵי עֲדָתֶֽךָ. סֽוֹבְבֵֽי תְעוּדָתֶֽךָ. פּֽוֹצְחֵֽי אֲפוּדָתֶֽךָ. נְהַלְלָךְ בְּיוֹם שֵׁנִי. כֵּן הוֹשַׁעֲנָא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\n\n" +

					"חָֽלְתָֽה פְּנֵי אֲדוֹנֶיהָ. עַם עָצוּר בְּרוֹב פַּֽחַד, וְסֽוֹבְבָה בְּבֵית אֱלֹהֶֽיהָ, שְׁתֵּי פְעָמִים בְּלֵב יַחַד. וְעָֽנְתָֽה כִּי טוֹבִים הַשְּׁנַֽיִם מִן הָאֶחָד:\n\n" +
					"טוֹב תִּקַּח מִמֶּֽנּוּ. יָֽדְךָֽ תְּעַצְּמֵֽנוּ. מִיּוֹמַֽיִם תְּחַיֵּֽנוּ. וּבַשְּׁלִישִׁי תְּקִימֵֽנוּ. הָאֵל אֲשֶׁר מִמֶּֽנּוּ. כָּל־דָּבָר לֹא נִכְחַד. וְעָֽנְתָֽה כִּי טוֹבִים הַשְּׁנַֽיִם מִן הָאֶחָד:\n\n" +

					"כְּהוֹשַׁעְתָּ מֵאָז עֲדָתֶֽךָ. כֵּן הוֹשִׁ֤יעָה ׀ אֶת־עַמֶּ֗ךָ וּבָרֵ֥ךְ אֶת־נַחֲלָתֶ֑ךָ. נְהַלְלָךְ בְּיוֹם שֵׁנִי. כֵּן הוֹשַׁעֲנָא:");
			}
		}

		if (jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
			addToSiddurHighlighted("הוֹשַׁעֲנָא. הוֹשַׁעֲנָא.");
		}

		if (jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 17
				|| jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
			String kahalResponse = (jewishDateInfo.getJewishCalendar().isHoshanaRabba()
					? " הוֹשִׁיעֵֽנוּ בְּהַקָּפַת פְּעָמִים שְׁלֹשָׁה:"
					: " הוֹשִׁיעֵֽנוּ בַּחֲגִיגַת יָמִים שְׁלֹשָׁה:");
			addToSiddurHighlighted(
				"אָֽנָּֽא הָאֵל הַנִּקְדָּשׁ בִּקְדֻשּׁוֹת שְׁלֹשָׁה. בָּרָא בְּמַעֲשֶׂה בְרֵאשִׁית בְּכָל־יוֹם שְׁלֹשָׁה. וּבְשִּׁשִּׁי וּבַשְּׁבִיעִי שְׁלֹשָׁה שְׁלֹשָׁה."
				+ kahalResponse +
				"אָֽנָּֽא זְכֹר אָב רָאָה מַלְאָכִים שְׁלֹשָׁה. וַיְמַהֵר לְהַסְעִידָם סְאִים שְׁלֹשָׁה. הָֽלְכֽוּ אִתּוֹ בַּעֲלֵי בְּרִית שְׁלֹשָׁה."
				+ kahalResponse +
				"אָֽנָּֽא זְכֹר בֵּן הוּכַן לַעֲקֵדָה לְיָמִים שְׁלֹשָׁה. כָּרַת בְּרִית עִם מֶֽלֶךְ וּמֵֽרֵעֵֽהוּ וְשַׂר צְבָאוֹ שְׁלֹשָׁה. בִּזְכוּתוֹ נָחֲלוּ בָנָיו כְּתָרִים שְׁלֹשָׁה."
				+ kahalResponse +
				"אָֽנָּֽא זְכֹר אָב חָזָה סֻלָּם בְּעוֹלִים וְיֽוֹרְדִֽים שְׁלֹשָׁה. וּפִצֵּל בָּרְהָטִים מַקְלוֹת שְׁלֹשָׁה. וַיְשַׁלַּח בָּנָיו לְצוֹעַן פְּעָמִים שְׁלֹשָׁה."
				+ kahalResponse +
				"אָֽנָּֽא הַגּוֹאֲלֵֽנוּ עַל־יְדֵי אַחִים שְׁלֹשָׁה. הַשָּׂם בָּֽנוּ מַעֲלוֹת כֹּהֲנִים לְוִיִּם וְיִשְׂרָאֵל שְׁלֹשָׁה. הַמַּנְחִילֵֽנוּ תּוֹרָה נְבִיאִים וּכְתוּבִים שְׁלֹשָׁה.\n\n"
				+ kahalResponse.trim() +
				"\n\n" +
				"הוֹשַׁעֲנָא. הוֹשַׁעֲנָא.");

			if (jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
				addToSiddurHighlighted(
					"לִמּוּדָךְ. וְגַם יְדִידָךְ. יִשְׂרָאֵל לָךְ מְקֹרָא. אֲשֶׁר חָלַם. וְהֵן סֻלָּם. בַּמָּרוֹם לוֹ מוֹרָא, אֵל אֶחָד. לְךָ פָּחַד. וַיֹּאמֶר מַה־נּוֹרָה. זְכֹר צִדְקוֹ. וְגַם נַאֲקוֹ. לִשְׁאֵרִית נִשְׁאָרָה נַהֲלָאָה, אֲשֶׁר נָֽשְׁאָֽה. זֶה כַּמֶּה אֵימֶךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
					"זְכֹר אָחוּז. וְגַם שָׁבוּץ, חָתוּם בְּמִדַּת תִּפְאֶֽרֶת, מְדַּת אֱמֶת. בֶּאֱמֶת. יְרֻשָּׁה לוֹ וְכוֹתֶֽרֶת. תִּפְאַרְתּוֹ. בְּתֻמָּתוֹ. תָּמִיד בּוֹ נִקְשֶֽׁרֶת. וּדְמוּתוֹ. וְצוּרָתוֹ. חֲקוּקָה בַּעֲטֶֽרֶת. הוּא אִישׁ תָּם. בִּשְׁמָךְ נֶחְתָּם. שַׂמְתּוֹ עַל כֵּס רַחֲמֶֽיךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
					" \r\n" +
					"רַחֲמָנָא אִדְכַּר לָן קְיָמֵהּ דְּיַעֲקֹב שְׁלֵימָא:\r\n" +
					"רַחֲמָנָא גַּלֵּי גְבֻרְתָּךְ וּפְרֹק לָן:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְחַיֵּי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְרַחֲמֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְצַדִּיקֵי וַחֲסִידֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דִישָׁרֵי וּתְמִימֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְפַרְנָסָתָא טַבְתָּא וּמְזוֹנֵי טָבֵי:\r\n" +
					"רַחֲמָנָא פְּתַח שְׁמַיָּא לִצְלוֹתִין:\r\n" +
					"רַחֲמָנָא תּוּב מֵרֻגְזָךְ:\r\n" +
					"רַחֲמָנָא וְלָא נֶהְדָּר רֵיקָם מִן־קַמָּךְ:\r\n" +
					" \r\n" +
					"שְׁמַ֖ע יִשְׂרָאֵ֑ל יְהֹוָ֥ה אֱלֹהֵ֖ינוּ יְהֹוָ֥ה ׀ אֶחָֽד׃\r\n" +
					" \r\n" +
					"יְהֹוָה֙ ה֣וּא הָאֱלֹהִ֔ים יְהֹוָ֖ה ה֥וּא הָאֱלֹהִֽים׃ (שתי פעמים/twice)\r\n" +
					" \r\n" +
					"יְהֹוָה מֶֽלֶךְ, יְהֹוָה מָלָֽךְ, יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד׃ (שתי פעמים/twice)\r\n" +
					" \r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם גַּלֵּה כְּבוֹד מַלְכֽוּתְךָֽ עָלֵֽינוּ מְהֵרָה:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם חָתְמֵֽנוּ בְּסֵֽפֶר חַיִּים טוֹבִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר צַדִּיקִים וַחֲסִידִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר יְשָׁרִים וּתְמִימִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר מְזוֹנוֹת וּפַרְנָסָה טוֹבָה:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם קָֽרְבֵֽנוּ לַעֲבוֹדָתֶֽךָ:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם רְפָא כָּל־חוֹלֵי עַמְּךָ יִשְׂרָאֵל:\r\n" +
					" \r\n" +
					"עֲנֵֽנוּ אֲבִיר יַעֲקֹב עֲנֵֽנוּ: עֲנֵֽנוּ הָעוֹנֶה בְּעֵת רַחֲמִים עֲנֵֽנוּ: עֲנֵֽנוּ רַחוּם וְחַנּוּן עֲנֵֽנוּ:\r\n" +
					" \r\n" +
					"יְהֹוָה חָנֵּֽנוּ וַהֲקִימֵֽנוּ. וּבְסֵֽפֶר חַיִּים זָכְרֵֽנוּ וְחָתְמֵֽנוּ:\r\n" +
					"יְהֹוָה גַּלְגֵּל הֲמוֹן רַחֲמֶֽיךָ עָלֵֽינוּ. וּבְסֵֽפֶר חַיִּים זָכְרֵֽנוּ וְחָתְמֵֽנוּ:\r\n" +
					" \r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן שְׁמֶֽךָ. וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן יַעֲקֹב נֶעֱנָה בְסֻלָּם מִמְּרוֹמֶֽיךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן הֲרוּגִים וּשְׂרוּפִים עַל יִחוּד קְדֻשַּׁת שְׁמֶֽךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					" \r\n" +
					"דְּעָנֵי לְיַעֲקֹב בְּבֵית אֵל. עֲנֵינָן:\r\n" +
					"דְּעָנֵי לְצַדִּיקֵי וַחֲסִידֵי וּתְמִימֵי דִּי בְּכָל־דָּר וְדָר. עֲנֵינָן:\r\n" +
					" \r\n" +
					"תּֽוֹדִיעֵנִי֮ אֹ֤רַח חַ֫יִּ֥ים שֹׂ֣בַע שְׂ֭מָחוֹת אֶת־פָּנֶ֑יךָ נְעִמ֖וֹת בִּימִינְךָ֣ נֶֽצַח׃\r\n" +
					"נָא גִבּוֹר. דּֽוֹרְשֵֽׁי יִחוּדֶֽךָ. כְּבָבַת שָׁמְרֵם:");
			} else {
				addToSiddurHighlighted(
					"אַמְּצֵֽנִי אֶלֹהַי בְּמוֹעֲדִי וַחֲגִיגִי. אֲמָרַ֖י הַאֲזִ֥ינָה ׀ יְהוָ֗ה בִּ֣ינָה הֲגִֽיגִי: בְּהִתְיַצְּבִי לְפָנֶֽיךָ כְּדַל שׁוֹאֵל לְדָרְשֶֽׁךָ. בְּנָשְׂאִ֥י יָ֝דַ֗י אֶל־דְּבִ֥יר קָדְשֶֽׁךָ: גְּנוֹן נוֹחֲלֵי דַת פְּלִילִיָּה. גְּדֹל הָעֵצָה וְרַב הָעֲלִילִיָּה: דְּבָֽרְךָֽ הָקֵם לַמְיַחֲלֵי רְצוֹנֶֽךָ. דּ֣וֹר (דרשו) [דֹּרְשָׁ֑יו] מְבַקְשֵׁ֨י פָנֶ֖יךָ: הֶמְיַת קֽוֹרְאֶֽיךָ לְשׁוֹחֲרֶֽיךָ שַׁחַר. אֲדֹנָ֛י הַֽקְשִׁ֥יבָה וַעֲשֵׂ֖ה אַל־תְּאַחַ֑ר: וּפִיהֶם לֹא יִכְלוּ מִיִּחוּד שְׁמֶֽךָ. אַתָּ֤ה יְהֹוָ֗ה לֹֽא־תִכְלָ֣א רַחֲמֶ֣יךָ: זְכָר־דָּבָר לְעַבְדֶּֽךָ עַל אֲשֶׁר יִחַלְתָּֽנוּ. זְכֹ֕ר אַל־תָּפֵ֥ר בְּרִיתְךָ֖ אִתָּֽנוּ: חוֹן שֽׁוֹטְחִֽים אֵלֶֽיךָ כַּפָּֽיִם. חַנּ֣וּן וְרַח֣וּם יְהֹוָ֑ה אֶ֥רֶךְ אַ֝פַּ֗יִם: טֽוּבְֽךָ מְיַחֲלִים לָֽמוֹ תְּחִישֶֽׁנּוּ. ט֤וֹב יְהֹוָה֙ לְקֹוָ֔ו לְנֶ֖פֶשׁ תִּדְרְשֶֽׁנּוּ: יָשִֽׂישׂוּ וְיִשְׂמְחוּ בְּךָ דַּלַּי וְאֶבְיוֹנָי. יֹאמְר֣וּ תָ֭מִיד יִגְדַּ֣ל יְהֹוָ֑ה: כּוֹנֵן סְגֻלָּה אֲשֶׁר לְשִׁמְךָ שָֽׁתָּה. כִּי־תִפְאֶ֣רֶת עֻזָּ֣מוֹ אָ֑תָּה: מַגֵּר צוֹרְרֵי עַמֶּֽךָ אֲשֶׁר תָּמִיד יְשִׁימֶֽנּוּ. מַצִּ֣יל עָ֭נִי מֵחָזָ֣ק מִמֶּ֑נּוּ:\r\n" +
					" \r\n" +
					"הוֹשַׁעֲנָא. הוֹשַׁעֲנָא:\r\n" +
					" \r\n" +
					"אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
					" \r\n" +
					"אָֽנָּֽא יַסֵּד יְסוֹד מִקְדָּשִׁי, לַעֲרוֹב בּוֹ נִיחוֹחֵי אִשִּׁי, וְתַזְרִיחַ אוֹר שִׁמְשִׁי. הַיּוֹם בְּיוֹם שְׁלִישִׁי, הוֹשִֽׁיעָה נָּא: אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
					"אָֽנָּֽא סְחֵה נָא מֽוֹקְשִֽׁי. וְשׁוֹבֵב מְעוֹן מִקְדָּשִׁי, פְּדֵה בְּשָׁלוֹם נַפְשִׁי. הַיּוֹם בְּיוֹם שְׁלִישִׁי. הוֹשִֽׁיעָה נָּא: אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
					" \r\n" +
					"אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
					" \r\n" +
					"כְּהוֹשַׁעְתָּ יְדִידִים. מִכַּף מַעֲבִידִים. וַתִּמְחַץ לוּדִים. בַּעֲלוֹת לְךָ רַחְשִׁי: סְגֻלָּה מְאֻשֶּֽׁרֶת. אֲשֶׁר לְךָ סוֹבֶֽרֶת. פּוֹצַֽחַת לְךָ עֲתֶֽרֶת. נְהַלְלָךְ בְּיוֹם שְׁלִישִׁי, כֵּן הוֹשַׁעֲנָא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
					"כְּהוֹשַׁעְתָּ יְפֵה נוֹף, מִמִּכְלְאֵי נוֹף, וַתֶּאֱנַף אָנוֹף, עַד צֵאתִי חָפְשִׁי: שְׂרִידֵי הָעֵֽדֶר. מְאַדְּרִים אֶֽדֶר. פְּצוֹת לְךָ הוֹד וָהֶֽדֶר. נְהַלְלָךְ בְּיוֹם שְׁלִישִׁי: כֵּן הוֹשַׁעֲנָא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
					" \r\n" +
					"מְיַחֲדִים שֵׁם הָאֵל. הַיּוֹם בְּשִׁירָה עֲרוּכָה. וּבְבִיאַת הַגּוֹאֵל. הַעֲלֵה לָֽנוּ אֲרוּכָה. מְשֽׁוֹרְרִֽים אֵין כָּאֵל. עַם לוֹ תֵּאוֹת מְלוּכָה. יִהְיֶה לְיִשְׂרָאֵל. שְׁלִישִׁיָּה בְּרָכָה: סֽוֹבְבֵֽי תְּעוּדָתֶֽךָ. הָאֵר אֲפֵלָתָם. הַיּוֹם בְּבֵיתֶֽךָ. תַּקְשִׁיב תְּחִנָּתָם. לְדִין בְּשִׁבְתְּךָ. הַעֲבֵר חָטָּאתָם. הֵשִׁיבֵם לְקַדְמוּתָם. מַעֲרָכָה לִקְרַאת מַעֲרָכָה:\r\n" +
					" \r\n" +
					"כְּהוֹשַׁעְתָּ מֵאָז עֲדָתֶֽךָ. כֵּן הוֹשִׁ֤יעָה ׀ אֶת־עַמֶּ֗ךָ וּבָרֵ֥ךְ אֶת־נַחֲלָתֶ֑ךָ. נְהַלְלָךְ בְּיוֹם שְׁלִישִׁי. כֵּן הוֹשַׁעֲנָא:");
			}
		}

		if (jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
			addToSiddurHighlighted("הוֹשַׁעֲנָא. הוֹשַׁעֲנָא.");
		}

		if (jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 18
				|| jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
			String kahalResponse = (jewishDateInfo.getJewishCalendar().isHoshanaRabba()
					? " הוֹשִׁיעֵֽנוּ בְּהַקָּפַת פְּעָמִים אַרְבָּעָה: "
					: " הוֹשִׁיעָֽנוּ בַּחֲגִיגַת יָמִים אַרְבָּעָה: ");
			addToSiddurHighlighted(
				"אָֽנָּֽא הַבּוֹרֵא עוֹלָמוֹ בִּיסוֹדוֹת אַרְבָּעָה. הַנּוֹתֵן נֽוֹשְׁאֵֽי כִסְאוֹ חַיּוֹת אַרְבָּעָה. הַמַּצִּיב פִּנּוֹת אַרְבָּעָה וּתְקוּפוֹת אַרְבָּעָה."
				+ kahalResponse +
				"אָֽנָּֽא זְכֹר אָב הֵעִיר מִמִּזְרָח בְּאוֹר לְיָמִים אַרְבָּעָה. רָדַף וַיֵּחָלֵק עַל מְלָכִים אַרְבָּעָה. בִּשַּׂרְתּוֹ לָשׁוּב זַרְעוֹ לְדוֹרוֹת אַרְבָּעָה."
				+ kahalResponse +
				"אָֽנָּֽא זְכֹר בֵּן הֻגַשׁ לַעֲקֵדָה עַל קְרָנוֹת אַרְבָּעָה. חָפַר בִּפְלֶֽשֶׁת בּוֹרוֹת אַרְבָּעָה. וַיַּעְתֵּק לְחֶבְרוֹן קִרְיַת אַרְבָּעָה."
				+ kahalResponse +
				"אָֽנָּֽא זְכֹר תָּם נֶעֱזַר בְּאִמָּהוֹת אַרְבָּעָה. חִנֵּן לְהִנָּצֵל מִשְׁפָּטִים אַרְבָּעָה. בִּתְפִלָּתוֹ כִּלְכַּֽלְתָּ בָּנָיו בִּדְבָרִים אַרְבָּעָה."
				+ kahalResponse +
				"אָֽנָּֽא הַמּוֹלִיכֵֽנוּ בַּמִּדְבָּר בִּדְגָלִים אַרְבָּעָה. צִוָּה לְמַלֹּאת בַּחֹֽשֶׁן טוּרִים אַרְבָּעָה. הַמְצַוֵּֽנוּ לְהַלְלוֹ בֶּחָג בְּמִינִים אַרְבָּעָה.\n\n"
				+ kahalResponse.trim() +
				"\n\n" +
				"הוֹשַׁעֲנָא. הוֹשַׁעֲנָא.");

			if (jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
				addToSiddurHighlighted(
					"זְכוּת מֹשֶׁה. אַל־תִּנְשֶׁה. חָתוּם בְּמִדַּת הַנֶּֽצַח. בִּזְכוּתוֹ. וְעַנְוָתוֹ. אוֹיְבֵֽינוּ תְּנַצֵּֽחַ. וּבְהַר הַמּוֹר. שִׁיר מִזְמוֹר. נָשִׁיר וְלַמְנַצֵּֽחַ. אֵל נֶֽצַח. לָנֶֽצַח. רַחֵם עַם רוֹמְמֶֽךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
					"תּוֹרָה תְמִימָה. וּנְעִימָה. יָרַשׁ עָנָו בְּהַר סִינַי. עִם אֵל אָיוֹם. אַרְבָּעִים יוֹם, עָמַד שָׁם עִם יְהֹוָה. לְקַבֵּל תּוֹרָה. זַכָּה וּבָרָה. מִשְּׁמֵי מְעוֹנַי, אֵל אֱמֶת. תּוֹרַת אֱמֶת. הִנְחִיל לְעַם נֶאֱמָנַי. צִדְקָתוֹ. וְתוֹרָתוֹ. זְכֹר־נָא מִשָּׁמֶֽיךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
					" \r\n" +
					"רַחֲמָנָא אִדְכַּר לָן קְיָמֵהּ דְּמֹשֶׁה נְבִיאָה:\r\n" +
					"רַחֲמָנָא דִּינָן אַפֵּיק לִנְהוֹרָא:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְחַיֵּי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְרַחֲמֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְצַדִּיקֵי וַחֲסִידֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דִישָׁרֵי וּתְמִימֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְפַרְנָסָתָא טַבְתָּא וּמְזוֹנֵי טָבֵי:\r\n" +
					"רַחֲמָנָא פְּתַח שְׁמַיָּא לִצְלוֹתִין:\r\n" +
					"רַחֲמָנָא תּוּב מֵרֻגְזָךְ:\r\n" +
					"רַחֲמָנָא וְלָא נֶהְדָּר רֵיקָם מִן־קַמָּךְ:\r\n" +
					" \r\n" +
					"שְׁמַ֖ע יִשְׂרָאֵ֑ל יְהֹוָ֥ה אֱלֹהֵ֖ינוּ יְהֹוָ֥ה ׀ אֶחָֽד׃\r\n" +
					" \r\n" +
					"יְהֹוָה֙ ה֣וּא הָאֱלֹהִ֔ים יְהֹוָ֖ה ה֥וּא הָאֱלֹהִֽים׃ (שתי פעמים/twice)\r\n" +
					" \r\n" +
					"יְהֹוָה מֶֽלֶךְ, יְהֹוָה מָלָֽךְ, יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד׃ (שתי פעמים/twice)\r\n" +
					" \r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם דְּרַשְׁנֽוּךָ הִמָּֽצֵא לָֽנוּ:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם חָתְמֵֽנוּ בְּסֵֽפֶר חַיִּים טוֹבִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר צַדִּיקִים וַחֲסִידִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר יְשָׁרִים וּתְמִימִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר מְזוֹנוֹת וּפַרְנָסָה טוֹבָה:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם קָֽרְבֵֽנוּ לַעֲבוֹדָתֶֽךָ:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם רְפָא כָּל־חוֹלֵי עַמְּךָ יִשְׂרָאֵל:\r\n" +
					" \r\n" +
					"עֲנֵֽנוּ הָעוֹנֶה בְּעֵת רָצוֹן עֲנֵֽנוּ: עֲנֵֽנוּ רַחוּם וְחַנּוּן עֲנֵֽנוּ:\r\n" +
					" \r\n" +
					"יְהֹוָה חָנֵּֽנוּ וַהֲקִימֵֽנוּ. וּבְסֵֽפֶר חַיִּים זָכְרֵֽנוּ וְחָתְמֵֽנוּ:\r\n" +
					"יְהֹוָה חַסָדֶֽיךָ יְקַדְּמוּנוּ וְרַחֲמֵֽנוּ. וּבְסֵֽפֶר חַיִּים זָכְרֵֽנוּ וְחָתְמֵֽנוּ:\r\n" +
					" \r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן שְׁמֶֽךָ. וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן מֹשֶׁה נֶאֱמָן בְּכָל־בֵּיתֶֽךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן הֲרוּגִים וּשְׂרוּפִים עַל יִחוּד קְדֻשַּׁת שְׁמֶֽךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					" \r\n" +
					"דְּעָנֵי לְמֹשֶׁה וַאֲבוֹתֵֽינוּ עַל יַם־סוּף. עֲנֵינָן:\r\n" +
					"דְּעָנֵי לְצַדִּיקֵי וַחֲסִידֵי וּתְמִימֵי דִּי בְּכָל־דָּר וְדָר. עֲנֵינָן:\r\n" +
					" \r\n" +
					"תּֽוֹדִיעֵנִי֮ אֹ֤רַח חַ֫יִּ֥ים שֹׂ֣בַע שְׂ֭מָחוֹת אֶת־פָּנֶ֑יךָ נְעִמ֖וֹת בִּימִינְךָ֣ נֶֽצַח׃\r\n" +
					"בָּֽרְכֵֽם טַהֲרֵם. רַחֲמֵי צִדְקָתֶֽךָ. תָּמִיד גָּמְלֵם:");
			} else {
				addToSiddurHighlighted(
					"אֶל־פִּתְחָךְ יָרוֹן שֶׂה אֹבֵד בַּהֲדֽוֹמְךָֽ. יְהֹוָ֥ה אֲדֹנֵ֑ינוּ מָה־אַדִּ֥יר שִׁ֝מְךָ֗: בַּיַּֽעַר בָּעֲרָבָה בְּקוֹל יָעוֹז. יְֽהֹוָ֗ה בִּרְצוֹנְךָ֮ הֶעֱמַ֢דְתָּה לְֽהַרְרִ֫י עֹ֥ז: גַּמֵּא צָמֵא לְיִשְׁעֲךָ פּוֹעֵר פִּיו לְמַלְקוֹשׁוֹ. יְהֹוָה גֹּאַל יִשְׂרָאֵל וּקְדוֹשׁוֹ: דִּבֵּר וַיִּקְרָא אֶֽרֶץ דְּלֵה אֲסִירֶֽיךָ מִמְּצָרִים. יְהֹוָה֙ דֹּבֵ֣ר צֶ֔דֶק מַגִּ֖יד מֵישָׁרִֽים: הָבֵא שְׁנַת שִׁלּוּמִים לַאֲשֶׁר בַּדֶּֽשֶׁן נִדְשָֽׁנוּ. יְ֭הֹוָה הַט־שָׁמֶ֣יךָ וְתֵרֵ֑ד גַּ֖ע בֶּהָרִ֣ים וְֽיֶעֱשָֽׁנוּ: וְהָרֵק חֲנִית וּסְגוֹר לִקְרַאת רֹֽדְפֵֽי כְּמֵהִים. יְהֹוָה֙ וְאֵ֣ין ע֔וֹד זוּלָתִ֖י אֵ֣ין אֱלֹהִ֑ים: זֶֽרַע אָדָם וְזֶֽרַע בְּהֵמָה תּוֹשִֽׁיעַ וְחִישׁ פְדוּת לְגוֹלַת אֲרִיאֵל. יְהֹוָה֮ זְכָרָ֢נוּ יְבָ֫רֵ֥ךְ יְ֭בָרֵךְ אֶת־בֵּ֣ית יִשְׂרָאֵ֑ל:\r\n" +
					" \r\n" +
					"הוֹשַׁעֲנָא. הוֹשַׁעֲנָא:\r\n" +
					" \r\n" +
					"אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
					" \r\n" +
					"אָֽנָּֽא יֶעֱרַב לְךָ שַׁוְעִי. בְּלוּלָבִי בְּנַעְנְעִי. וְקָרֵב נָא קֵץ יִשְׁעִי. הַיּוֹם בְּיוֹם רְבִיעִי. הוֹשִֽׁיעָה נָּא: אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
					"אָֽנָּֽא סֽוֹב נָא לְהַרְגִּיעִי. וְכוֹנֵן אָרְחִי וְרִבְעִי. פָּעֳלִי שְׁעֵה בְּהִשְׁתַּעְשְׁעִי. נַהֵל לִנְוֵה מַרְגּוֹעִי. הַיּוֹם בְּיוֹם רְבִיעִי. הוֹשִֽׁיעָה נָּא: אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
					" \r\n" +
					"אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
					" \r\n" +
					"כְּהוֹשַׁעְתָּ יַקִּיר. מִשּׁוֹד מְקַרְקֵר קִיר. וַתַּךְ וַתַּעֲקִיר. שׁוֹקֵק שְׁקּוּעִי: גַּם עַתָּה חַלֵּץ. אַלּוּץ מִמְּאַלֵּץ. וּמַדְוֵה לֵב תְּעַלֵּץ. נְהַלְלָךְ בְּיוֹם רְבִיעִי, כֵּן הוֹשַׁעְנָא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
					"כְּהוֹשַׁעְתָּ שׂוֹרֵק. מִכַּף צַר שׁוֹרֵק. אֲשֶׁר שִׁנָּיו חוֹרֵק. לְקַצֵּץ אֶת גִּזְעִי: פֶּתַע פִּתְאֹם. נָאַֽמְתָּ נָאוֹם. לְהַשְׁבִּיתוֹ מִלְּאוֹם. נְהַלְלָךְ בְּיוֹם רְבִיעִי. כֵּן הוֹשַׁעֲנָא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
					" \r\n" +
					"יִשְׁעֲךָ הַרְאֵה יָהּ. הָאֵל גְּדוֹל דֵּעָה. מַהֵר קֵץ פְּדוּת לְאוֹם נִוָּשֵֽׁעָה. סֽוֹבְבֵֽי תוֹרָתֶֽךָ פְּעָמִים אַרְבָּעָה:\r\n" +
					"גּוֹאֵל יִשְׂרָאֵל. הֱיֵה נָא מוֹשִׁיעָם. וּבְעִתּוֹת כָּאֵל. הֱיֵה נָא מַרְגּוֹעָם. גַּלֵּה קֵץ יִשְׁעָם. וּלְךָ לִישׁוּעָה. סֽוֹבְבֵֽי תוֹרָתֶֽךָ פְּעָמִים אַרְבָּעָה:\r\n" +
					" \r\n" +
					"כְּהוֹשַׁעְתָּ מֵאָז עֲדָתֶֽךָ. כֵּן הוֹשִׁ֤יעָה ׀ אֶת־עַמֶּ֗ךָ וּבָרֵ֥ךְ אֶת־נַחֲלָתֶ֑ךָ. נְהַלְלָךְ בְּיוֹם רְבִיעִי, כֵּן הוֹשַׁעֲנָא:");
			}
		}

		if (jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
			addToSiddurHighlighted("הוֹשַׁעֲנָא. הוֹשַׁעֲנָא.");
		}

		if (jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 19
				|| jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
			String kahalResponse = (jewishDateInfo.getJewishCalendar().isHoshanaRabba()
					? " הוֹשִׁיעֵֽנוּ בְּהַקָּפַת פְּעָמִים חֲמִשָּׁה: "
					: " הוֹשִׁיעֵֽנוּ בַּחֲגִיגַת יָמִים חֲמִשָּׁה: ");
			addToSiddurHighlighted(
					"אָֽנָּֽא הַמְיַחֵד לִכְבוֹדוֹ שֵׁמוֹת חֲמִשָּׁה. הַקּוֹנֶה בְעוֹלָמוֹ קִנְיָנִים חֲמִשָּׁה. הַיּוֹצֵר בִּבְרִיּוֹתָיו גִּבּוֹרִים חֲמִשָּׁה."
					+ kahalResponse +
					"אָֽנָּֽא זְכֹר אָב כָּרַת בְּרִית בִּבְתָרִים חֲמִשָּׁה. וְהֵשִׁיב רְכוּשׁ לִמְלָכִים חֲמִשָּׁה. וְחָנַן עַל הֲפִיכַת עָרִים חֲמִשָּׁה."
					+ kahalResponse +
					"אָֽנָּֽא זְכֹר הַנֶּעֱקַד בְּהַר מוֹר שְׁעָרִים חֲמִשָּׁה. יָרַשׁ מֵהוֹרוֹ בְּרָכוֹת חֲמִשָּׁה. וְהִשְׁלִים נֶֽפֶשׁ נְקוּבָה בְּשֵׁמוֹת חֲמִשָּׁה."
					+ kahalResponse +
					"אָֽנָּֽא זְכֹר תָּם נַעֲשׂוּ לוֹ נִסִּים חֲמִשָּׁה. וַיַצֵּג מִבָּנָיו אַחִים חֲמִשָּׁה. כָּפְרוֹ שָׁת לְנָזִיר הַמַּחֲלִיף חֲמִשָּׁה."
					+ kahalResponse +
					"אָֽנָּֽא הַמַּנְחִילֵֽנוּ דַּת סְפָרִים חֲמִשָּׁה. הַמַּשְׁמִיעֵֽנוּ דִּבְּרוֹתָיו בְּקוֹלוֹת חֲמִשָּׁה. הַכְּתוּבִים עַל הַלֻּחוֹת חֲמִשָּׁה חֲמִשָּׁה.\n\n"
					+ kahalResponse.trim() +
					"\n\n" +
					"הוֹשַׁעֲנָא. הוֹשַׁעֲנָא.");

			if (jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
				addToSiddurHighlighted(
					"בִּזְכוּת אַהֲרֹן. רוֹן יָרוֹן. עַמָּךְ בְּאָמְרָם הוֹשַׁעְנָא. נֶחְתָּם בְּכָבוֹד. בְּמִצְנֶֽפֶת נָאָה. לְשַׁמֵּשׁ בִּכְהֻנָּה. בִּגְדֵי פְאֵר. לְפָאֵר. שִׁמְךָ לָבַשׁ בֶּאֱמוּנָה. הוֹדוֹ הַרְאֶה, לְעַם נִכְאֶה. רָם שׁוֹכֵן בִּמְעוֹנָה. וּבִזְכוּתוֹ. וּתְפִלָּתוֹ. תּוֹשִֽׁיעַ לִזְעוּמֶֽךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
					"בִּגְדֵי קֹֽדֶשׁ. לָקַח לְקַדֵשׁ. לְשָׁרֵת בָּם לִפְנִים לִפְנָי. וּלְבָשָׁם. בְּבֹאוֹ שָׁם. כְּקָדוֹשׁ כְּמַלְאַךְ יְהֹוָה. בְּקָרְבְּנוֹתָיו. וְעוֹלוֹתָיו, הָיָה מְכַפֵּר עַל עֲוֹנָי. תְּפִלּוֹתָיו. וּתְחִנּוֹתָיו. זְכֹר הַיּוֹם לְעַם אֱמוּנָי. וְתִטָּעֵם. וְתַרְגִיעֵם. בְּמִקְדַּשׁ הֲדוֹמֶֽךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
					" \r\n" +
					"רַחֲמָנָא אִדְכַּר לָן קְיָמֵהּ דְּאַהֲרֹן כַּהֲנָא:\r\n" +
					"רַחֲמָנָא הַדְרָךְ שַׁוִּי עֲלָן:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְחַיֵּי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְרַחֲמֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְצַדִּיקֵי וַחֲסִידֵי\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דִישָׁרֵי וּתְמִימֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְפַרְנָסָתָא טַבְתָּא וּמְזוֹנֵי טָבֵי:\r\n" +
					"רַחֲמָנָא פְּתַח שְׁמַיָּא לִצְלוֹתִין:\r\n" +
					"רַחֲמָנָא תּוּב מֵרֻגְזָךְ:\r\n" +
					"רַחֲמָנָא וְלָא נֶהְדָּר רֵיקָם מִן־קַמָּךְ:\r\n" +
					" \r\n" +
					"שְׁמַ֖ע יִשְׂרָאֵ֑ל יְהֹוָ֥ה אֱלֹהֵ֖ינוּ יְהֹוָ֥ה ׀ אֶחָֽד׃\r\n" +
					" \r\n" +
					"יְהֹוָה֙ ה֣וּא הָאֱלֹהִ֔ים יְהֹוָ֖ה ה֥וּא הָאֱלֹהִֽים׃ (שתי פעמים/twice)\r\n" +
					" \r\n" +
					"יְהֹוָה מֶֽלֶךְ, יְהֹוָה מָלָֽךְ, יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד׃ (שתי פעמים/twice)\r\n" +
					" \r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם הֵעָֽתֵר־לָֽנוּ הַיּוֹם וּבְכָל־יוֹם וָיוֹם בִּתְפִלָּתֵֽנוּ:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם חָתְמֵֽנוּ בְּסֵֽפֶר חַיִּים טוֹבִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר צַדִּיקִים וַחֲסִידִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר יְשָׁרִים וּתְמִימִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר מְזוֹנוֹת וּפַרְנָסָה טוֹבָה:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם קָֽרְבֵֽנוּ לַעֲבוֹדָתֶֽךָ:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם רְפָא כָּל־חוֹלֵי עַמְּךָ יִשְׂרָאֵל:\r\n" +
					" \r\n" +
					"עֲנֵֽנוּ הָעוֹנֶה בְּעֵת צָרָה עֲנֵֽנוּ: עֲנֵֽנוּ רַחוּם וְחַנּוּן עֲנֵֽנוּ:\r\n" +
					" \r\n" +
					"יְהֹוָה חָנֵּֽנוּ וַהֲקִימֵֽנוּ. וּבְסֵֽפֶר חַיִּים זָכְרֵֽנוּ וְחָתְמֵֽנוּ:\r\n" +
					"יְהֹוָה יֶהֱמוּ נָא רַחֲמֶֽיךָ עָלֵֽינוּ. וּבְסֵֽפֶר חַיִּים זָכְרֵֽנוּ וְחָתְמֵֽנוּ:\r\n" +
					" \r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן שְׁמֶֽךָ. וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן אַהֲרֹן כִּהֵן בְּאוּרֶֽיךָ וְתֻמֶּֽיךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן הֲרוּגִים וּשְׂרוּפִים עַל יִחוּד קְדֻשַּׁת שְׁמֶֽךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					" \r\n" +
					"דְּעָנֵי לְאַהֲרֹן בַּמַּחְתָּא. עֲנֵינָן:\r\n" +
					"דְּעָנֵי לְצַדִּיקֵי וַחֲסִידֵי וּתְמִימֵי דִּי בְּכָל־דָּר וְדָר. עֲנֵינָן:\r\n" +
					" \r\n" +
					"תּֽוֹדִיעֵנִי֮ אֹ֤רַח חַ֫יִּ֥ים שֹׂ֣בַע שְׂ֭מָחוֹת אֶת־פָּנֶ֑יךָ נְעִמ֖וֹת בִּימִינְךָ֣ נֶֽצַח׃\r\n" +
					"חֲסִין קָדוֹשׁ. בְּרֹב טֽוּבְךָֽ. נַהֵל עֲדָתֶֽךָ:");
			} else {
				addToSiddurHighlighted(
					"אֱמוּנֶיךָ מִתְחַנְּנִים לַחֲבוֹשׁ מַחְצָם כְּמֵאָז חָבָֽשְׁתָּ. יְהֹוָ֣ה אֱ֭לֹהַי גָּדַ֣לְתָּ מְּאֹ֑ד ה֖וֹד וְהָדָ֣ר לָבָֽשְׁתָּ: נַהֲלֵֽנִי בְּחֻקֹּתֶֽיךָ לְמַֽעַן שְׁלֹֽשֶׁת הוֹרַי. יְהֹוָ֤ה ׀ נְחֵ֬נִי בְצִדְקָתֶ֗ךָ לְמַ֥עַן שׁוֹרְרָ֑י: יְרִיבֶֽיךָ יֹאבֵֽדוּ אֲשֶׁר בְּתִגְרָתָם סִּגַרְתָּֽנוּ. יְהֹוָה הָאֵר פָּנֶֽיךָ אִתָּֽנוּ: יָהּ אֲשֶׁר אֵין לוֹ חֵֽקֶר שְׁלַח מְבַשֵּׂר צוּר עֵילוֹם. יְֽהֹוָ֗ה עֹ֭ז לְעַמּ֣וֹ יִתֵּ֑ן יְהֹוָ֓ה ׀ יְבָרֵ֖ךְ אֶת־עַמּ֣וֹ בַשָּׁלֽוֹם: צְפֵה גָּלוּתִי וְעָנְיִי אֵל נִדְרָשׁ לְכָל־שׁוֹאֵל. יְהֹוָ֤ה צְבָאוֹת֙ אֱלֹהֵ֣י יִשְׂרָאֵ֔ל: חַנּוּן הַמְּרַחֵם מִי־הִקְשָׁה אֵלָיו וַיִּשְׁלָם. יְ֭הֹוָה חַסְדְּךָ֣ לְעוֹלָ֑ם: קַבֵּל שַׁוְעִי, מַלְכִּי וְגוֹאֲלִי. יְהֹוָ֣ה קְ֭רָאתִיךָ ח֣וּשָׁה לִּ֑י:\r\n" +
					" \r\n" +
					"הוֹשַׁעֲנָא, הוֹשַׁעֲנָא:\r\n" +
					" \r\n" +
					"אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
					" \r\n" +
					"אָֽנָּֽא יֽוֹצְרִֽי וּקְדוֹשִׁי. שְׁעֵה לַחְשִׁי וְרַחְשִׁי. וּמְחֵה וְהַעֲבֵר יֽוֹקְשִֽׁי. הַיוֹם בְּיוֹם חֲמִישִׁי. הוֹשִֽׁיעָה נָּא: אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
					"אָֽנָּֽא סְחֵה נָא מֽוֹקְשִֽׁי. וְאַל־תִּזְכֹּר עָנְשִׁי. פְּנֵה אֵלַי דּֽוֹרְשִֽׁי, הַיוֹם בְּיוֹם חֲמִישִׁי. הוֹשִֽׁיעָה נָּא: אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
					" \r\n" +
					"אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
					" \r\n" +
					"כְּהוֹשַׁעְתָּ יְקוּשֵׁי מַלְבֵּן, מֵרִמְסַת הַתֶּֽבֶן. וּכְהִדּוּשׁ מַתְבֵּן. דִּשַּֽׁשְׁתָּ דּֽוֹשְׁשִֽׁי: סִפֽוּרֵי עֶֽשֶׂר, יָֽצְאֽוּ מִמַּאֲסָר. פְּצֵם נָא מֵחֽוֹסֶר. נְהַלְלָךְ בְּיוֹם חֲמִישִׁי. כֵּן הוֹשַׁעֲנָא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
					"כְּהוֹשַׁעְתָּ יְשֻׁרוּן. מִגּוֹי יְצִירוּן. וּלְךָ יְשֽׁוֹרְרֽוּן. אֵל מֵרִים רֹאשִׁי: שִׂפְתֵי רְנָנוֹת. פָּצוּ לְךָ נְגִינוֹת. בְּתוֹדָה וּבִתְחִנּוֹת. נְהַלְלָךְ בְּיוֹם חֲמִישִׁי. כֵּן הוֹשַׁעֲנָא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
					" \r\n" +
					"מָרוֹם שׁוֹכֵן עַד. נַעֲרָץ בִּקְדֻשָּׁה. תִּתְבָּרַךְ לָעַד. שֵׁם אֵל רָם וְנִשָּׂא. מְשֽׁוֹרְרִֽים וּמְהַלְלִים. בְּשִׁירָה חֲדָשָׁה. סֽוֹבְבֵֽי תוֹרָתֶֽךָ פְּעָמִים חֲמִשָּׁה:\r\n" +
					"הוֹשִֽׁיעָה שְׂרִידֶֽיךָ. אֵל שׁוֹמֵר אֱמוּנִים. רַחוּם נָא חֲסָדֶֽיךָ. חִישׁ לְאֵיתָנִים. וּזְכֹר אֶת־בְּרִיתֶֽךָ, לָֽנוּ וְלִבְנֵי בָנִים. לְהוֹשִׁיעָהּ לְהַרְגִּיעָהּ. אֶֽבֶן הָרֹאשָׁה. סֽוֹבְבֵֽי תוֹרָתֶֽךָ פְּעָמִים חֲמִשָּׁה:\r\n" +
					" \r\n" +
					"כְּהוֹשַׁעְתָּ מֵאָז עֲדָתֶֽךָ. כֵּן הוֹשִׁ֤יעָה ׀ אֶת־עַמֶּ֗ךָ וּבָרֵ֥ךְ אֶת־נַחֲלָתֶ֑ךָ. נְהַלְלָךְ בְּיוֹם חמישי, כֵּן הוֹשַׁעֲנָא:");
			}
		}

		if (jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
			addToSiddurHighlighted("הוֹשַׁעֲנָא. הוֹשַׁעֲנָא.");
		}

		if (jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 20
				|| jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
			String kahalResponse = (jewishDateInfo.getJewishCalendar().isHoshanaRabba()
					? " הוֹשִׁיעֵֽנוּ בְּהַקָּפַת פְּעָמִים שִׁשָּׁה: "
					: " הוֹשִׁיעֵֽנוּ בַּחֲגִיגַת יָמִים שִׁשָּׁה: ");
			addToSiddurHighlighted(
				"אָֽנָּֽא הַבּוֹרֵא עוֹלָמוֹ בְּיָמִים שִׁשָּׁה. הַבּוֹנֶה שֵׁשׁ צְלָעוֹת לִצְדָדִים שִׁשָּׁה. הַיּוֹצֵר שְׂרָפִים בִּכְנָפַֽיִם שִׁשָּׁה."
				+ kahalResponse +
				"אָֽנָּֽא זְכֹר אָב זָנַח תּוֹעֵבוֹת שִׁשָּׁה. אַחֲרֵי זִקֻנָיו נוֹלְדוּ לוֹ בָּנִים שִׁשָּׁה. נָטַע אֵשֶׁל וּבֹרַךְ בְּקֵץ שָׁנִים שִׁשָּׁה."
				+ kahalResponse +
				"אָֽנָּֽא זְכֹר הַנֶּעֱקַד בִּמְקוֹם מַעֲרָכוֹת שִׁשָּׁה. גּוֹנַנְתּוֹ וּמִלַּטְתּוֹ מִצָּרוֹת שִׁשָּׁה. כָּרָה מִקְוָאוֹת לְדֽוֹרְשֵׁי בָם מַעֲלוֹת שִׁשָּׁה."
				+ kahalResponse +
				"אָֽנָּֽא זְכֹר תָּם הוֹלִיד מִן הַבְּכִירָה שִׁשָּׁה. וְצִוָּה קַֽחַת מִנְחָה מִמִּינִים שִׁשָּׁה. וְהִגְבִּיר אֲבִי שִׁשָּׁה הַמְּבוֹרָכִים בְּשִׁשָּׁה."
				+ kahalResponse +
				"אֶנָּא הַמְּחַבֵּר לָאֵפוֹד שֵׁמוֹת שִׁשָּׁה. הַמַּצִּיל נְפָשׁוֹת בְּעָרֵי מִקְלָט שִׁשָּׁה. הַמּוֹרִישֵֽׁנוּ חָכְמַת סְדָרִים שִׁשָּׁה.\n\n"
				+ kahalResponse.trim() +
				"\n\n" +
				"הוֹשַׁעֲנָא. הוֹשַׁעֲנָא.");

			if (jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
				addToSiddurHighlighted(
					"זְכוּת נִשְׁמַר. בְּרִית שָׁמַר, בְּמִדַּת הַיְסוֹד חָתוּם, לִמְלֹךְ זָכָה. וּבִמְלוּכָה. לוֹ נִגְלָה כָּל־סָתוּם. וּבִזְכוּתוֹ. לְאֻמָּתוֹ. גַּלֵּה קֵץ הֶחָתוּם. וְתִרְדֹּף. וְגַם תַּהֲדֹף. לָֽרְשָׁעִֽים יְסִיתוּם, זְכוּת אָבוֹת. רוֹכֵב עֲרָבוֹת. זְכֹר הַיּוֹם לְרוֹמְמֶֽךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
					"בִּזְכוּת יוֹסֵף, הֱיֶה מְאַסֵּף. נַחֲלָֽתְךָֽ בְּבֵית קָדְשֶֽׁךָ. וּרְצֵה אֵל חַי. בְּנִיחוֹחַי. תְּפִלַּת עַם מְקֻדָּשֶֽׁךָ. וּבְרִיתוֹ. וּזְכוּתוֹ. זְכֹר לְעַם מְגֹרָשֶֽׁךָ חָתְמֵם לְגִילָה. וְצָהֳלָה. וְקַבְּצֵם לְמִגְרָשֶֽׁךָ הוֹשַׁעְנָֽא. וְרַחֵם נָא. בִּזְכוּתוֹ לְאֻמֶּֽךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
					"זְכוּת פִּֽינְחָֽס, הַמְּיֻחָס, לְמִדַּת צַדִּיק יְסוֹד עוֹלָם. לִבְרִית קִנֵּא. וַיְפַלֵּל עִם קוֹנֶה. הַמֵּבִיא בְּמִשְׁפָּט עַל כָּל־נֶעְלָם. וַתֵּעָצַר. מִשְׁלַֽחַת צַר. וְהוּא נִתְבַּצַּר. בְּרוּם עוֹלָם. הֲגַם הֲלוֹם. בְּרִית שָׁלוֹם. חַיִּים לְעֵילוֹם, לִכְהֻנַּת עוֹלָם. וּבִזְכוּתוֹ. לַעֲדָתוֹ. קָרֵב קֵץ יְמִינֶֽךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
					"בִּזְכוּת מְקַנֵּא הֱיֵה עוֹנֶה. לְשַׁוְעַת עַם מְקֻדָּשֶֽׁךָ. רְצֵה אֵל חַי. בְּנִיחוֹחַי. חֵֽלֶף קָרְבָּנִי לַחְמִי לְאִשֶּֽׁךָ. וְשֶׂה פְזוּרָה. שַׁי לָמּוֹרָא. יוֹבִֽילוּ אֶל נְוֵה קָדְשֶֽׁךָ. חָתְמֵם לְגִילָה. וְצָהֳלָה. וְקַבְּצֵם לְמִגְרָשֶֽׁךָ. הוֹשַׁעְנָֽא. וְרַחֵם נָא. לְכַנָּה אֲשֶׁר נָֽטְעָֽה יְמִינֶֽךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
					" \r\n" +
					"רַחֲמָנָא אִדְכַּר לָן זְכוּתֵהּ דְּיוֹסֵף צַדִּיקָא:\r\n" +
					"רַחֲמָנָא אִדְכַּר לָן קְיָמֵהּ דְּפִֽינְחָֽס קַנָּאָה:\r\n" +
					"רַחֲמָנָא וְלָא תִתְפְּרַע כְּעוֹבָדָֽנָא בִּישִׁין מִנָּן:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְחַיֵּי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְרַחֲמֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְצַדִּיקֵי וַחֲסִידֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דִישָׁרֵי וּתְמִימֵי:\r\n" +
					"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְפַרְנָסָתָא טַבְתָּא וּמְזוֹנֵי טָבֵי:\r\n" +
					"רַחֲמָנָא פְּתַח שְׁמַיָּא לִצְלוֹתִין:\r\n" +
					"רַחֲמָנָא תּוּב מֵרֻגְזָךְ:\r\n" +
					"רַחֲמָנָא וְלָא נֶהְדָּר רֵיקָם מִן־קַמָּךְ:\r\n" +
					" \r\n" +
					"שְׁמַ֖ע יִשְׂרָאֵ֑ל יְהֹוָ֥ה אֱלֹהֵ֖ינוּ יְהֹוָ֥ה ׀ אֶחָֽד׃\r\n" +
					" \r\n" +
					"יְהֹוָה֙ ה֣וּא הָאֱלֹהִ֔ים יְהֹוָ֖ה ה֥וּא הָאֱלֹהִֽים׃ (שתי פעמים/twice)\r\n" +
					" \r\n" +
					"יְהֹוָה מֶֽלֶךְ, יְהֹוָה מָלָֽךְ, יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד׃ (שתי פעמים/twice)\r\n" +
					" \r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם וְנִקְרָא וְאַתָּה תַעֲנֵֽנוּ:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם חָתְמֵֽנוּ בְּסֵֽפֶר חַיִּים טוֹבִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר צַדִּיקִים וַחֲסִידִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר יְשָׁרִים וּתְמִימִים:\r\n" +
					" חָתְמֵֽנוּ בְּסֵֽפֶר מְזוֹנוֹת וּפַרְנָסָה טוֹבָה:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם קָֽרְבֵֽנוּ לַעֲבוֹדָתֶֽךָ:\r\n" +
					"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם רְפָא כָּל־חוֹלֵי עַמְּךָ יִשְׂרָאֵל:\r\n" +
					" \r\n" +
					"עֲנֵֽנוּ הָעוֹנֶה בְּעֵת רָצוֹן עֲנֵֽנוּ: עֲנֵֽנוּ רַחוּם וְחַנּוּן עֲנֵֽנוּ:\r\n" +
					" \r\n" +
					"יְהֹוָה חָנֵּֽנוּ וַהֲקִימֵֽנוּ. וּבְסֵֽפֶר חַיִּים זָכְרֵֽנוּ וְחָתְמֵֽנוּ:\r\n" +
					"יְהֹוָה הֵיטִֽיבָה אַחֲרִיתֵֽנוּ מֵרֵאשִׁיתֵֽנוּ. וּבְסֵֽפֶר חַיִּים זָכְרֵֽנוּ וְחָתְמֵֽנוּ:\r\n" +
					" \r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן שְׁמֶֽךָ. וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן זְכוּת יוֹסֵף אַסִּיר צַדִּיקֶֽךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן פִּֽינְחָֽס זַךְ קִנֵּא לִשְׁמֶֽךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					"יְהֹוָה עֲשֵׂה לְמַֽעַן הֲרוּגִים וּשְׂרוּפִים עַל יִחוּד קְדֻשַּׁת שְׁמֶֽךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
					" \r\n" +
					"דְּעָנֵי לְיוֹסֵף בְּבֵית אֲסִירֵי. עֲנֵינָן:\r\n" +
					"דְּעָנֵי לְפִֽינְחָֽס בַּשִּׁטִּים. עֲנֵינָן:\r\n" +
					"דְּעָנֵי לְצַדִּיקֵי וַחֲסִידֵי וּתְמִימֵי דִּי בְּכָל־דָּר וְדָר. עֲנֵינָן:\r\n" +
					" \r\n" +
					"תּֽוֹדִיעֵנִי֮ אֹ֤רַח חַ֫יִּ֥ים שֹׂ֣בַע שְׂ֭מָחוֹת אֶת־פָּנֶ֑יךָ נְעִמ֖וֹת בִּימִינְךָ֣ נֶֽצַח׃\r\n" +
					"יָחִיד גֵּאֶה. לְעַמְּךָ פְנֵה. זֽוֹכְרֵֽי קְדֻשָּׁתֶֽךָ:");
			} else {
				addToSiddurHighlighted(
					"לְמַֽעַן אָב אָץ לָבֹא בְּיִחוּד הַשֵׁם וּדְבַר הַמֶּֽלֶךְ הָיָה נָחוּץ. בּ֖וֹא בְּר֣וּךְ יְהֹוָ֑ה לָ֤מָּה תַעֲמֹד֙ בַּח֔וּץ: לְמַֽעַן גָּעָה לִמְרִירוּת מַטְבֵּֽחַ וּבֻשַּׂר בְּאֶהְיֶה אֲשֶׁר אֶהְיֶה. דְּבַר יְהֹוָה שָׁלוֹם יִהְיֶה: לְמַֽעַן אֲשֶׁר הַבְּרִית כָּרַת לְאִישׁ תָּם יוֹשֵׁב אֹהָלָיו. וְהִנֵּ֨ה יְהֹוָ֜ה נִצָּ֣ב עָלָיו֮: לְמַֽעַן זָךְ נִרְאֵֽיתָ לּוֹ בַּשֵּׂר לַהֲמוֹנָי. חִ֭זְקוּ וְיַאֲמֵ֣ץ לְבַבְכֶ֑ם כׇּל־הַ֝מְיַחֲלִ֗ים לַֽיהֹוָֽה׃ לְמַֽעַן קֹֽרְאֶֽיךָ בֶּעָשׂוֹר אֲנָשִׁים וְנָשִׁים וָטָף. רְעֵבִ֥ים גַּם־צְמֵאִ֑ים נַ֝פְשָׁ֗ם בָּהֶ֥ם תִּתְעַטָּֽף: לְמַֽעַן שֵׁם קָדְשֶֽׁךָ שְׁאוֹן יַמִּים תַּשְׁבִּֽיחַ. תִּפְתַּח־אֶ֣רֶץ וְיִפְרוּ־יֶ֗שַׁע וּצְדָקָ֤ה תַצְמִ֙יחַ֙:\r\n" +
					" \r\n" +
					"הוֹשַׁעֲנָא, הוֹשַׁעֲנָא:\r\n" +
					" \r\n" +
					"אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
					" \r\n" +
					"אָֽנָּֽא הַיְשַׁר מַעֲרָבִי. וְהַיְשַׁר מַהֲלָכִי. וְכוֹנְנָה אֶת דַּרְכִּי. לָלֶֽכֶת אֶל הַר קָדְשִׁי: וּקְרָא נָא דְרוֹר. לִרְווּיֵי מַמְרוֹר. וְשִׂיחָם יֶעֱרַב כְּמוֹ מָר־דְּרוֹר. הַיּוֹם בְּיוֹם שִׁשִּׁי. הוֹשִֽׁיעָה נָּא: אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
					"אָֽנָּֽא סַגֵל סְגֻלָּתֶֽךָ. וְקַבֵּץ קְהִלָּתֶֽךָ. לְהַר נַחֲלָתֶֽךָ. מְקוֹם מִקְדָּשִׁי: פְּזוּרִים תְּקַבֵּץ. לִנְוֵה מַרְבֵּץ. וְתַלְבִּישֵׁם תַּשְׁבֵּץ. הַיּוֹם בְּיוֹם שִׁשִּׁי. הוֹשִֽׁיעָה נָּא: אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
					" \r\n" +
					"אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
					" \r\n" +
					"כְּהוֹשַׁעְתָּ יְלִידֵי אָהַב. מֵאוּר הַלַּֽהַב. וּמָחַֽצְתָּ רָהַב. לְכַלּוֹת עַם קָדְשִׁי: סְלוּל וּמַסְלוּל, פִּתַּֽחְתָּ בְּמַצְלוּל. לַעֲבוֹר עַם כָּלוּל. נְהַלְלָךְ בְּיוֹם שִׁשִּׁי. כֵּן הוֹשַׁעֲנָא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
					"כְּהוֹשַׁעְתָּ יְחִֽילֵי תּוֹר, מֵאֶֽרֶץ כַּפְתּוֹר. וַתָּֽשֶׂם מִסְתּוֹר. עָלֵֽימוֹ קְדוֹשִׁי: סְגַּֽפְתָּ פּוּט. בִּשְׁחִין נָפוּט. לְחַלֵּץ עַם שָׁפוּט. נְהַלְלָךְ בְּיוֹם שִׁשִּׁי,כֵּן הוֹשַׁעֲנָא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
					" \r\n" +
					"שְׁעֵה עֶלְיוֹן לַחְשִׁי. נַעֲרָץ בִּקְדֻשָּׁה. הַיוֹם לְךָ בְּדָרְשִׁי. בְּשִׁירָה חֲדָשָׁה. וּכְבוֹשׁ נָא אֶת כּֽוֹבְשִֽׁי, רְפָא מַכָּה אֲנוּשָׁה. סֽוֹבְבֵֽי תוֹרָתֶֽךָ זֹאת הַפַּעַם שִׁשָּׁה:\r\n" +
					"הַקְשֵׁב נָא קוֹל אֶבְיוֹן. בְּקָרְאוֹ מִן־מְצָרִים. עַם הוֹמֶה בְּצָיוֹן. בִּידֵי עַמִּים וְצָרִים. וְחִישׁ יֶֽשַׁע וּפִדְיוֹן. לְעַם בְּלֹא הוֹן נִמְכָּרִים. וּשְׁבוּת גְּאֻלָּתָם תְּמַהֵר תָּחִֽישָׁה. סֽוֹבְבֵֽי תוֹרָתֶֽךָ זֹאת הַפַּעַם שִׁשָּׁה:\r\n" +
					" \r\n" +
					"כְּהוֹשַׁעְתָּ מֵאָז עֲדָתֶֽךָ. כֵּן הוֹשִׁ֤יעָה ׀ אֶת־עַמֶּ֗ךָ וּבָרֵ֥ךְ אֶת־נַחֲלָתֶ֑ךָ. נְהַלְלָךְ בְּיוֹם ששי, כֵּן הוֹשַׁעֲנָא:");
			}
		}

		if (jewishDateInfo.getJewishCalendar().isHoshanaRabba()) {
			addToSiddurHighlighted(
				"הוֹשַׁעֲנָא, הוֹשַׁעֲנָא:\r\n" +
				" \r\n" +
				"אָֽנָּֽא הַמַּקְדִּים לָעוֹלָם דְּבָרִים שִׁבְעָה. הַסּוֹדֵר בְּרֵאשִׁית לְיָמִים שִׁבְעָה. הַנֹּטֶה שָׁמַֽיִם שִׁבְעָה. וְרוֹקַע אֲרָצוֹת שִׁבְעָה. הוֹשִׁיעֵֽנוּ בַּחֲגִיגַת יָמִים שִׁבְעָה וּבְהַקָּפַת פְּעָמִים שִׁבְעָה:\r\n" +
				"אָֽנָּֽא זְכֹר אָב הִבְטַחְתּֽוֹ לָרֶֽשֶׁת אַרְצוֹת עֲמָמִים שִׁבְעָה. בָּֽנָה בַּֽיִת לַחָכְמָה וְחָצַב עַמּוּדֶֽיהָ שִׁבְעָה. כָּרַת בְּרִית לְנָגִיד בִּכְבָשׂוֹת שִׁבְעָה. הוֹשִׁיעֵֽנוּ בַּחֲגִיגַת יָמִים שִׁבְעָה וּבְהַקָּפַת פְּעָמִים שִׁבְעָה:\r\n" +
				"אָֽנָּֽא זְכֹר יָחִיד בִּשַּׂרְתּוֹ לְקֵץ יָמִים שִׁבְעָה. הֹעֲלָה עַל הַר שְׁבִיעִי לְהָרִים שִׁבְעָה. שָׂמַח בְּמָצְאוֹ מַֽיִם וַיִּקְרָא אוֹתָהּ שִׁבְעָה. הוֹשִׁיעֵֽנוּ בַּחֲגִיגַת יָמִים שִׁבְעָה וּבְהַקָּפַת פְּעָמִים שִׁבְעָה:\r\n" +
				"אָֽנָּֽא זְכֹר תָּם הַמִּשְׁתַּחֲוֶה אַֽרְצָה פְּעָמִים שִׁבְעָה. עַל שֵׁם שֶֽׁבַע יִפּוֹל צַדִּיק וְקָם שִׁבְעָה. צְרַפְתּֽוֹ בִּשְׁנֵי שָׂבָע שִׁבְעָה וְרָעָב שִׁבְעָה. הוֹשִׁיעֵֽנוּ בַּחֲגִיגַת יָמִים שִׁבְעָה וּבְהַקָּפַת פְּעָמִים שִׁבְעָה:\r\n" +
				"אָֽנָּֽא הַמַּנְחִילֵֽנוּ שַׁבָּת לְיָמִים שִׁבְעָה. וּשְׁנַת הַשְּׁמִטָּה לְשָׁנִים שִׁבְעָה. וּשְׁנַת הַיּוֹבֵל לְקֵץ שָׁבוּעִים שִׁבְעָה. הוֹשִׁיעֵֽנוּ בַּחֲגִיגַת יָמִים שִׁבְעָה וּבְהַקָּפַת פְּעָמִים שִׁבְעָה:\r\n" +
				"אָֽנָּֽא הַחוֹקֵק זְמַן חֵרוּתֵֽנוּ יָמִים שִׁבְעָה. וְחַג הַבִּכּוּרִים לְשָׁבוּעִים שִׁבְעָה. וְלוּלָב וְחַג וְסֻכָּה וְנִסּוּךְ הַמַּֽיִם שִׁבְעָה. הוֹשִׁיעֵֽנוּ בַּחֲגִיגַת יָמִים שִׁבְעָה וּבְהַקָּפַת פְּעָמִים שִׁבְעָה:\r\n" +
				" \r\n" +
				"זְכוֹר סֶֽגֶן. אֲשֶׁר נִגֵּן, עֲלֵי עָשׂוֹר וְגַם נֶֽבֶל. בְּשִׁירוֹתָיו, וּזְמִירוֹתָיו. יְהוֹדוּן לָךְ בְּכָל־תֵּבֵל. לָךְ נִמְשַׁח. וְנֶגְדָּךְ שַׁח. נְשׂוֹא לָךְ עוֹל וְגַם סֶֽבֶל. פְּדֵה נְכֵאָה. מְקֹרָאָה. לְךָ נַחֲלָה וְגַם חֶֽבֶל. לְהוֹשִׁיעָהּ. לְהַרְגִּיעָהּ. תִּגָּלֶה מִמְּרוֹמֶֽךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
				"בִּזְכוּת דָּוִד. אִישׁ יְדִיד. נֶחְתָּם בְּכֶֽתֶר מַלְכוּתֶךָ. תְּרַחֵם. וְגַם תְּנַחֵם, עַמְּךָ וְנַחֲלָתֶֽךָ. בִּזְכוּתוֹ הַרְאֵה. לְעַם נִכְאֶה, בִּנְיַן בֵּֽיתְךָֽ וּנְוָתֶֽךָ. וּזְכוּת אָבוֹת. מֵעֲרָבוֹת. זְכֹר־נָא לַעֲדָתֶֽךָ. וְנַטְּלֵם וְנַשְּׂאֵם. בִּזְכוּת שִׁבְעָה תְּמִימֶֽיךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
				"זְכֹר־לָֽנוּ אֱלֹהֵֽינוּ. זְכוּת דָּוִד בְּנוֹ יִשַׁי, וּמִגִּזְעוֹ תְּצַו חֹֽטֶר. לְקַבֵּץ אֶת־מְגֹרָשַׁי, וּבִזְכוּתוֹ. אֱסוֹף נִדְחוֹ. וְאֶת־בָּנַי וְאֶת־נָשַׁי, וְנָגִֽילָה בְּמַלְכוּתֶֽךָ. וְדִבְרֵי נִפְלְאֹתֶֽיךָ. זָכְרֵֽנוּ יְהֹוָה בִּרְצוֹן עַמֶּֽךָ:\r\n" +
				" \r\n" +
				"רַחֲמָנָא אִדְכַּר לָן קְיָמֵהּ דְּדָוִד מַלְכָּא מְשִׁיחָֽא:\r\n" +
				"רַחֲמָנָא אִדְכַּר לָן צְלוֹתֵהּ דִּשְׁלֹמֹה מַלְכָּֽא:\r\n" +
				"רַחֲמָנָא זַכְוָן חַפֵּשׂ לָן:\r\n" +
				"רַחֲמָנָא זִיוָךְ אַשְׁרֵי עֲלָן:\r\n" +
				"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְחַיֵּי:\r\n" +
				"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְרַחֲמֵי:\r\n" +
				"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְצַדִּיקֵי וַחֲסִידֵי:\r\n" +
				"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דִישָׁרֵי וּתְמִימֵי:\r\n" +
				"רַחֲמָנָא חַתְמִנָּן בְּסִפְרָא דְפַרְנָסָתָא טַבְתָּא וּמְזוֹנֵי טָבֵי:\r\n" +
				"רַחֲמָנָא חֲשׁוֹב עֲלָן טַבְוָן:\r\n" +
				"רַחֲמָנָא טַבְוָן סַגִּיאָן אַיְתֵי עֲלָן:\r\n" +
				"רַחֲמָנָא יִתְגַּלְגְּלוּן רַחֲמָךְ עֲלָן:\r\n" +
				"רַחֲמָנָא כְּבֹשׁ חֶמְתָּא וְרֻגְזָא מִנָּן:\r\n" +
				"רַחֲמָנָא לָא תַעְבֵּיד גְּמִירָא לָן:\r\n" +
				"רַחֲמָנָא מְחֹל וּשְׁבֹק לְחוֹבִין וְלַעֲוָיָן:\r\n" +
				"רַחֲמָנָא נְהוֹר טוּבָךְ אַנְהַר עֲלָן:\r\n" +
				"רַחֲמָנָא סְעִיד וּסְמִיךְ הֱוֵי לָן:\r\n" +
				"רַחֲמָנָא עֲבֵיד עִמָּֽנָא אָתָא לְטַב:\r\n" +
				"רַחֲמָנָא פְּתַח שְׁמַיָּא לִצְלוֹתִין:\r\n" +
				"רַחֲמָנָא צְלוֹתָֽנָא קַבֵּל בְּרַעֲוָא:\r\n" +
				"רַחֲמָנָא קַבֵּל צְלוֹתִין וּבָעוּתִין בְּעִדָּן עַקְתִּין:\r\n" +
				"רַחֲמָנָא רַחֵם עַל נִשְׁמָתִין:\r\n" +
				"רַחֲמָנָא שַׁתָּא טַבְתָּא אַיְיתֵי עֲלָן:\r\n" +
				"רַחֲמָנָא תּוּב מֵרֻגְזָךְ:\r\n" +
				"רַחֲמָנָא וְלָא נֶהְדָּר רֵיקָם מִן־קַמָּךְ:\r\n" +
				" \r\n" +
				"שְׁמַ֖ע יִשְׂרָאֵ֑ל יְהֹוָ֥ה אֱלֹהֵ֖ינוּ יְהֹוָ֥ה ׀ אֶחָֽד׃\r\n" +
				" \r\n" +
				"יְהֹוָה֙ ה֣וּא הָאֱלֹהִ֔ים יְהֹוָ֖ה ה֥וּא הָאֱלֹהִֽים׃ (שתי פעמים/twice)\r\n" +
				" \r\n" +
				"יְהֹוָה מֶֽלֶךְ, יְהֹוָה מָלָֽךְ, יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד׃ (שתי פעמים/twice)\r\n" +
				" \r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם זָכְרֵֽנוּ בְּזִכְרוֹן טוֹב מִלְּפָנֶֽיךָ:\r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם חָתְמֵֽנוּ בְּסֵֽפֶר חַיִּים טוֹבִים:\r\n" +
				" חָתְמֵֽנוּ בְּסֵֽפֶר צַדִּיקִים וַחֲסִידִים:\r\n" +
				" חָתְמֵֽנוּ בְּסֵֽפֶר יְשָׁרִים וּתְמִימִים:\r\n" +
				" חָתְמֵֽנוּ בְּסֵֽפֶר מְזוֹנוֹת וּפַרְנָסָה טוֹבָה:\r\n" +
				" חֲמֹל עָלֵֽינוּ וְעַל טַפֵּֽינוּ וְעַל עוֹלָלֵֽינוּ:\r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם טַהֲרֵֽנוּ מֵעֲוֹנֵֽינוּ:\r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם יֶהֱמוּ־נָא רַחֲמֶֽיךָ עָלֵֽינוּ:\r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם כְּבֹשׁ אֶת־כּוֹבְשֵֽׁנוּ:\r\n" +
				" כָּלָה אַל־תַּעַשׂ עִמָּנוּ:\r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם לְמַעֲנָךְ עֲשֵׂה אִם לֹא לְמַעֲנֵֽנוּ:\r\n" +
				" לְחַץ אֶת לוֹחֲצֵֽינוּ:\r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם מַלֵּא מִשְׁאֲלוֹת לִבֵּֽנוּ לְטוֹבָה לַעֲבוֹדָתֶֽךָ:\r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם נְקֹם אֶת־נִקְמָתֵֽנוּ:\r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם סְמֹךְ אֶת־נְפִילָתֵֽנוּ:\r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם עֲנֵה אֶת־עֲתִירָתֵֽנוּ:\r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם פְּדֵֽנוּ מִידֵי כָל־אוֹיְבֵֽינוּ:\r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם צַוֵּה אִתָּֽנוּ בִּרְכוֹתֶֽיךָ:\r\n" +
				" צַוֵּה אִתָּֽנוּ יְשׁוּעוֹתֶֽיךָ:\r\n" +
				" צַדְּקֵֽנוּ בְּמִשְׁפָּטֶֽיךָ:\r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם קָֽרֵב־לָֽנוּ קֵץ הַגְּאֻלָּה:\r\n" +
				" קָֽרֵב־לָֽנוּ יוֹם הַיְשׁוּעָה:\r\n" +
				" קָֽרְבֵֽנוּ לַעֲבוֹדָתֶֽךָ:\r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם רִיבָה רִיבֵֽנוּ וּגְאָלֵֽנוּ:\r\n" +
				" רְאֵה בָּעֳנִֽי עַמְּךָ יִשְׂרָאֵל:\r\n" +
				" רְפָא כָּל־חוֹלֵי עַמְּךָ יִשְׂרָאֵל:\r\n" +
				" רְאֵה בְּדֹֽחַק הַשָּׁעָה:\r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם שְׁעֵה אֶת־שַׁוְעָתֵֽנוּ:\r\n" +
				" שִׁית שָׁלוֹם בֵּינֵֽינוּ:\r\n" +
				" שִׁית שַׁלְוָה בְּאַרְמְנוֹתֵֽינוּ:\r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם תֵּן שָׁלוֹם בָּאָֽרֶץ:\r\n" +
				" תֵּן שָׂבָע בָּעוֹלָם:\r\n" +
				" תֵּן שָׁלוֹם בַּמַּלְכוּת:\r\n" +
				" תֵּן טַל וּמָטָר לִבְרָכָה בְּעִתּוֹ בָּאָרֶץ:\r\n" +
				" תֵּן זֶֽרַע לַזּוֹרֵֽעַ וְלֶֽחֶם לָאוֹכֵל:\r\n" +
				" תֵּן לֶֽחֶם לְפִי הַטָּף לָשֽׂבַע:\r\n" +
				"אֱלֹהֵֽינוּ שֶׁבַּשָּׁמַֽיִם תִּכּוֹן תְּפִלָּתֵֽנוּ קְטֹֽרֶת לְפָנֶֽיךָ:\r\n" +
				" \r\n" +
				"עֲנֵֽנוּ מָגֵן דָּוִד עֲנֵֽנוּ: עֲנֵֽנוּ אֱלֹהֵי הַמֶּרְכָּבָה עֲנֵֽנוּ: עֲנֵֽנוּ רַחוּם וְחַנּוּן עֲנֵֽנוּ:\r\n" +
				" \r\n" +
				"יְהֹוָה חָנֵּֽנוּ וַהֲקִימֵֽנוּ. וּבְסֵֽפֶר חַיִּים זָכְרֵֽנוּ וְחָתְמֵֽנוּ:\r\n" +
				"יְהֹוָה כַּחוֹתָם עַל לֵב הַיּוֹם שִׂימֵֽנוּ, וּבְסֵֽפֶר חַיִּים זָכְרֵֽנוּ וְחָתְמֵֽנוּ:\r\n" +
				"יְהֹוָה רִיבָה רִיבֵֽנוּ וּלְחַם לוֹחֲמֵֽינוּ, וּבְסֵֽפֶר חַיִּים זָכְרֵֽנוּ וְחָתְמֵֽנוּ:\r\n" +
				"יְהֹוָה בָּרֵךְ אֶת־לַחְמֵֽנוּ וְאֶת־מֵימֵֽינוּ, וּבְסֵֽפֶר חַיִּים זָכְרֵֽנוּ וְחָתְמֵֽנוּ:\r\n" +
				" \r\n" +
				"יְהֹוָה עֲשֵׂה לְמַֽעַן שְׁמֶֽךָ. וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
				"יְהֹוָה עֲשֵׂה לְמַֽעַן דָּוִד נְעִים זְמִירוֹתֶֽיךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
				"יְהֹוָה עֲשֵׂה לְמַֽעַן מֶֽלֶךְ שְׁלֹמֹה בָּנָה בַּֽיִת לִשְׁמֶֽךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
				"יְהֹוָה עֲשֵׂה לְמַֽעַן הֲרוּגִים וּשְׂרוּפִים עַל יִחוּד קְדֻשַּׁת שְׁמֶֽךָ, וְחוּסָה עַל יִשְׂרָאֵל עַמֶּֽךָ:\r\n" +
				" \r\n" +
				"דְּעָנֵי לְדָוִד וְלִשְׁלֹמֹה בְּנוֹ בִּירוּשָׁלַֽיִם. עֲנֵינָן:\r\n" +
				"דְּעָנֵי לְצַדִּיקֵי וַחֲסִידֵי וּתְמִימֵי דִּי בְּכָל־דָּר וְדָר. עֲנֵינָן:\r\n" +
				" \r\n" +
				"תּֽוֹדִיעֵנִי֮ אֹ֤רַח חַ֫יִּ֥ים שֹׂ֣בַע שְׂ֭מָחוֹת אֶת־פָּנֶ֑יךָ נְעִמ֖וֹת בִּימִינְךָ֣ נֶֽצַח׃\r\n" +
				"שַׁוְעָתֵֽנוּ קַבֵּל. וּשְׁמַע צַעֲקָתֵֽנוּ. יוֹדֵֽעַ תַּעֲלוּמוֹת:\r\n" +
				" \r\n" +
				"הוֹשַׁעֲנָא, הוֹשַׁעֲנָא:\r\n" +
				" \r\n" +
				"אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
				" \r\n" +
				"אָֽנָּֽא יַשֵּׁר עַם בָּא, בְּהוֹשַׁעֲנָא רַבָּא, לְסַלְסְלָךְ בְּחִבָּה, אֵל מושִׁיעִי. חִישׁ נָא פִּדְיוֹם, אֵל נוֹרָא וְאָיוֹם, וּבִירוּשָׁלַֽיִם כְּהַיּוֹם, נְהַלְלָךְ בְּיוֹם שְׁבִיעִי. הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
				"אָֽנָּֽא סְחֵה נָא כָּלִיל. מַמְלְכוֹת הָאֱלִיל. וְאָרוֹן עֲלֵי חָלִיל, בְּחַג שַׁעֲשׁוּעִי. פְּדוּתִי רָאָה, וְגַם גָּאֹה גָּאָה, וּבִירוּשָׁלַיִִם לְשָׁנָה הַבָּאָה, נְהַלְלָךְ בְּיוֹם שְׁבִיעִי. הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
				"אָֽנָּֽא בְּנֵה שַׁעַר הַשִּׁיר, וְשָׁם לְךָ אָשִׁיר, וְגַם שַׁי לְךָ אַתְשִׁיר, אֵל מַרְגּוֹעִי. בְּקַבֶּצְךָ נֶאֱנָקִים. מִמֶּרְחַקִּים, וְסֻכָּתְךָ תָּקִים, נְהַלְלָךְ בְּיוֹם שְׁבִיעִי. הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
				"אָֽנָּֽא רְצֵה נָא וְקוֹמֵם, הַר הַשָּׁמֵם, וּמִגְדָּלְךָ תְּרוֹמֵם, וְגַלֵּה קֵץ יִשְׁעִי. רוֹמְמוּתֶךָ הַרְאֵה, לְעַם הַנִּכְאֶה. וּמוּלְךָ יֵרָאֶה, נְהַלְלָךְ בְּיוֹם שְׁבִיעִי. הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
				"אָֽנָּֽא יְדִידִים בְּטוּבְךָ רַוֵּה, וְהוֹדְךָ עָלָיו תְּשַׁוֶּה, וְטוּבְךָ אֲחַוֶּה, בְּתוֹךְ עַם נוֹשָׁעִי. צִיּוֹן מַלֵּא, מֵעַם אֵלֶּה, וְשָׁם לְךָ נְחַלֶּה. נְהַלְלָךְ בְּיוֹם שְׁבִיעִי. הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
				"אָֽנָּֽא חֵילְךָ הַנְחֵל, חוֹמוֹת וָחֵל, וְקָמִים גַּחֵל וְהַצְמַח יִשְׁעִי. קְהָלִי כּוֹנֵן, וְטוּבְךָ אֲשַׁנֵּן, וּלְשִׁמְךָ אֲרַנֵּן, נְהַלְלָךְ בְּיוֹם שְׁבִיעִי. הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא. אָֽנָּֽא הוֹשִֽׁיעָה נָּא:\r\n" +
				" \r\n" +
				"אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
				" \r\n" +
				"כְּהוֹשַׁעְתָּ יְדִידִים, מִכַּף מַעֲבִידִים, וַתִּמְחַץ לוּדִים, אָצִים לְהַכְנִיעִי. עֲלוּבֵי עוֹלֵב, הַמְהַלְלִים בְּכָל־לֵב, בְּאֶתְרוֹג הַדּוֹמֶה לַלֵּב, נְהַלְלָךְ בְּיוֹם שְׁבִיעִי, כֵּן הוֹשַׁעֲנָא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
				"כְּהוֹשַׁעְתָּ וַתַּעֲזֹר, אֲנוּשֵׁי מָזוֹר, וַתֶּאֱזֹר אָזוֹר, לִשְׁפּוֹט מַרְשִׁיעִי. יֶתֶר פְּזוּרָה, סוֹבְבֵי תוֹרָה, בְּלוּלָב הַדּוֹמֶה לַשִּׁדְרָה, נְהַלְלָךְ בְּיוֹם שְׁבִיעִי, כֵּן הוֹשַׁעֲנָא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
				"כְּהוֹשַׁעְתָּ סְגוּרֵי צִנּוֹק, נוֹאֲקִים אָנוֹק, וַתַּעֲנִיק עָנוֹק, וְהִשְׁקַעְתָּ מַשְׁקִיעִי. סוֹבְבִים בְּמַחֲנַֽיִם, בְּמַזַּל מֹאזְנַֽיִם, בַּהֲדַס הַדּוֹמֶה לָעֵינַֽיִם, נְהַלְלָךְ בְּיוֹם שְׁבִיעִי, כֵּן הוֹשַׁעֲנָא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
				"כְּהוֹשַׁעְתָּ פְּדוּיֵי עַם זֶה, בְּיַד חוֹזֶה וּמַזֶּה, וַתָּשֶׁת נְמִבְזֶה, חוֹשֵׁק לְהַטְבִּיעִי. פּוֹתְחֵי דְלָתַֽיִם, לְצַלְצֵל בִּמְצִלְְתַּיִם, בַּעֲרָבָה הַדּוֹמָה לִשְׂפָתַֽיִם, נְהַלְלָךְ בְּיוֹם שְׁבִיעִי, כֵּן הוֹשַׁעֲנָא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\r\n" +
				" \r\n" +
				"אָֽנָּֽא אֵל נָא הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא: (שתי פעמים/twice)\r\n" +
				" \r\n" +
				"אֵל נָא אוֹצָרְךָ הַטּוֹב תִּפְתַּח מִזְּבוּלָהּ, וְהָאָרֶץ תִּתֵּן יְבוּלָהּ. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"אֵל נָא נִטְפֵי נְדָבוֹת יְרַוּוּ דִּשְׁאֵי חָצִיר, וְהִשִּׂיג לָכֶם דַּיִשׁ אֶת־בָּצִיר. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"אֵל נָא יְבוּל הָאָרֶץ לְבָרֵךְ הֵעָתֵר, אָכוֹל וְשָׂבוֹעַ וְהוֹתֵר. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"אֵל נָא יוֹם זֶה חֲתוֹם נָא חוֹתֶמֶת, וּבָרֵךְ חִטָּה וּשְְׂעוֹרָה וְְכֻסֶּמֶת. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"אֵל נָא וְְגֶשֶׁם נְְדָבוֹת תְְּחוֹלֵל רוּחַ צָפוֹן, וּבָרֵךְ שִׁבֹּלֶת שׁוּעָל וְְשִׁיפוֹן. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"אֵל נָא סַפֵּק סֶפֶק בְּכָל־חֹדֶשׁ וָחֹדֶשׁ, וּבָרֵךְ אֹרֶז וְדֹחַן וּפוֹל וְְעֶדֶשׁ. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"אֵל נָא פְְּצֵה שָׁנָה זוֹ מִשָּׁמִיר וָשַׁית, וּבָרֵךְ עֵץ שֶׁמֶן וָזַיִת. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"אֵל נָא בְּמָטָר רַוֵּה חַרְבֹנֵי יְְשִׁימוֹן, וּבָרֵךְ גֶּפֶן וּתְאֵנָה וְְרִמּוֹן. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"אֵל נָא רוֹמֵם עֲצֶרֶת עוֹלְְלֵי טִפּוּחִים, וּבָרֵךְ אֱגוֹז וְתָמָר וְְתַפּוּחִים. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"אֵל נָא יָדְךָ הַרְחֵב וְרַבֵּה חֲזִיזֵי מְעוֹנִים, וּבָרֵךְ בָּטְנִים וּשְׁקֵדִים וְעַרְמוֹנִים. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"אֵל נָא צִדְקְךָ מֵעַמְּךָ בַּל יִפָּסֵק, וּבָרֵךְ חָרוּב וּקְרֻסְטְמַל וַאֲפַרְסֵק. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"אֵל נָא חַלֵּץ קְהִלָּה אֲשֶׁר סְבִיבֶיךָ תַעֲרֹג, וּבָרֵךְ הַתּוּת וְהָאֱגוֹז וְהָאֶתְרוֹג. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"אֵל נָא קְרָא נָא שָׂבָע בְּמִטְרוֹת רְקִיעִים, וּבָרֵךְ כָּל־מִינֵי יְרָקוֹת וּזְרָעִים. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				" \r\n" +
				"אָֽנָּֽא אֵל נָא הוֹשַׁעֲנָא וְהַצְלִיחָה נָא: (שתי פעמים/twice)\r\n" +
				" \r\n" +
				"אֵל נָא יוֹם זֶה עַל קֵץ תַּפְסִיעַ. וְחַלֵּץ שְׁסוּעָה מִכַּף מַשְׁסִיעַ. גֶּפֶן מִמִּצְרַֽיִם תַּסִּיעַ. הוֹשַׁעֲנָא וְהַצְלִיחָה נָא:\r\n" +
				"אֵל נָא וּמִנּוֹף נֵהַלְתָּ גִּזְעֶיהָ. וַתַּפְרִיחַ זְמוֹרֵי זְרוּעֶיהָ. תְּגָרֵשׁ גּוֹיִם וַתִּטָּעֶהָ. הוֹשַׁעֲנָא וְהַצְלִיחָה נָא:\r\n" +
				"אֵל נָא סְמָדָרֶיהָ הֱנִיצוֹתָ בְּמֶרֶץ. וּפִנִּיתָ לְפָנֶיהָ שִׁבְעָה גּוֹיִם בְּעֶרֶץ. וַתַּשְׁרֵשׁ שָׁרָשֶׁיהָ וַתְּמַלֵּא־אָרֶץ. הוֹשַׁעֲנָא וְהַצְלִיחָה נָא:\r\n" +
				"אֵל נָא פְּאֵרוֹת הִפְרַחְתָּ פִּרְיָם, וּבַטּוֹב הִשְׂבַּעְתָּ עֶדְיָם, תְּשַׁלַּח קְצִירֶיהָ עַד־יָם. הוֹשַׁעֲנָא וְהַצְלִיחָה נָא:\r\n" +
				"אֵל נָא הֲלֹא אַתָּה נְטַעְתָּהּ וַתִּצְּרֶהָ, וּמֵאָז נְצַרְתָּהּ וַתִּשְׁמְרֶה. לָמָּה פָּרַצְתָּ גְדֵרֶיהָ. הוֹשַׁעֲנָא וְהַצְלִיחָה נָא:\r\n" +
				"אֵל נָא קָדוֹשׁ רַב עֱזוּזוֹת. הַבֵּט מִשָּׁמַֽיִם לַחֲזוֹת. וּפְקֹד גֶּפֶן זֹאת. הוֹשַׁעֲנָא וְהַצְלִיחָה נָא:\r\n" +
				"אֵל נָא טוּבְךָ גַּלֵּה לַעֲמוּסֵי מֵעָֽיִם. יִשְׂבְּעוּ טוּבְךָ נוֹחֲלֵי דָת יוֹמָֽיִם, וּמִמַּעַיְנֵי הַיְשׁוּעָה יִשְׁאֲבוּן מָֽיִם. הוֹשַׁעֲנָא וְהַצְלִיחָה נָא:\r\n" +
				" \r\n" +
				"אָֽנָּֽא אֵל נָא הוֹשַׁעֲנָא וְהַרְוִיחָה נָּא אָבִֽינוּ אָתָּה: (שתי פעמים/twice)\r\n" +
				" \r\n" +
				"אֵל נָא לְמַעַן אָב אֻמַּץ מִמּוֹצְאֵי עֲלִילָה עַל מָֽיִם. בְְּצִלְּךָ גּוֹנַנְתּוֹ וְהִצַּלְתּוֹ מִשְּׁטִיפַת מָֽיִם. בִּגְלָלוֹ נִשְׁבַּעְתָּ שֶׁלֹּא לְהָבִיא מַבּוּל מָֽיִם. בַּעֲבוּרוֹ לֹא תִמְנַע מָֽיִם. הוֹשַׁעֲנָא וְהַרְוִיחָה נָּא:\r\n" +
				"אֵל נָא לְמַעַן אָב נָאַם יֻקַּח־נָא מְעַט־מָֽיִם, בּוֹגְדִים הִמְשִׁיךְ אַחֲרֶיךָ אֵל מוֹדֵד בְּשָׁעֳלוֹ מָֽיִם, בִּתֵּק זָרִים עוֹבְדֵי אֵשׁ וּמָֽיִם, בַּעֲבוּרוֹ לֹא תִמְנַע מָֽיִם. הוֹשַׁעֲנָא וְהַרְוִיחָה נָּא:\r\n" +
				"אֵל נָא לְמַעַן בֵּן הַנֶּעֱקַד וְחָפַר בְּאֵר מָֽיִם, גָּר בִּגְרָר וְְרָבוּ עַל הַמָּיִם. בִּשְּׂרוּהוּ עֲבָדָיו מָצָאנוּ מָֽיִם, בַּעֲבוּרוֹ לֹא תִמְנַע מָֽיִם. הוֹשַׁעֲנָא וְהַרְוִיחָה נָּא:\r\n" +
				"אֵל נָא לְמַעַן תָּם גָּל אֶבֶן מֵעַל בְּאֵר מָֽיִם. דָּלָה וְהִשְׁקָה צֹאן לָבָן מָֽיִם. וְהִצִּיג מַקְלוֹת בְּשִׁקֲתוֹת הַמָּיִם. בַּעֲבוּרוֹ לֹא תִמְנַע מָֽיִם. הוֹשַׁעֲנָא וְהַרְוִיחָה נָּא:\r\n" +
				"אֵל נָא לְמַעַן דָּגוּל מָשׁוּי מִמָּיִם, הֶעֱבִיר חֶבְלָךְ בְּתוֹךְ גַּלֵּי מָֽיִם, פָּתַח צוּר וַיָּזוּבוּ מָֽיִם, בַּעֲבוּרוֹ לֹא תִמְנַע מָֽיִם. הוֹשַׁעֲנָא וְהַרְוִיחָה נָּא:\r\n" +
				" \r\n" +
				"אָֽנָּֽא אֵל נָא. רְפָא נָא. סְלַח נָא, הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא, אָבִֽינוּ אָתָּה: (שתי פעמים/twice)\r\n" +
				" \r\n" +
				"לְמַעַן אָב נִפְקַד וַיִבָּחֵן, כִּכְלוֹת דּוֹר צוֹחֵן, וְנֹחַ מָצָא חֵן. בַּעֲבוּרוֹ תַּלְבִּישׁ תְּהִלָה, לְעוֹרְכֵי לְךָ תְּפִלָה. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"לְמַעַן נֶאֱמָן אַמִּיץ בְּלִי חֵשֶׁל. וְנִצַּל מִכֶּשֶׁל. וַיִּטַּע אֵשֶׁל. בַּעֲבוּרוֹ הַיוֹם תַּכְלֵל. גּוֹמְרֵי לְךָ הַלֵּל. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"לְמַעַן יָחִיד מְקוֹרָאִי. בֵּרְכוֹ אֵל רוֹאִי, בִּבְאֵר לְחַי רֹאִי. בַּעֲבוּרוֹ הַיוֹם יֻכְסַף. יוֹסְפֵי לְךָ מוּסָף. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"לְמַעַן יָשַׁן בְּטַבּוּר עוֹלָם. וְסוֹף נֶעְלַם חָלַם, וַיַּחֲלֹם וְהִנֵּה סֻלָּם. בַּעֲבוּרוֹ תְּבָרֵךְ רֹבַע. סוֹבְבֵי שֶׁבַע. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"לְמַעַן וָתִיק קָרַן עוֹר פָּנָיו וְאוֹר עֵינָיו, וְהָאִישׁ מֹשֶׁה מְאֹד עָנָיו. בַּעֲבוּרוֹ תְּבָרֵך שָׁנָה, לְצוֹעֲקֵי הוֹשַׁעֲנָא. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				"לְמַעַן פּוֹעֲלֵי רַע הָלַם, וְשָׁלוֹם לוֹ הֻשְׁלַם, בְּרִית כְּהֻנַּת עוֹלָם. בַּעֲבוּרוֹ גְּאוֹן עָרִיץ תְּחַסֵּר, וְתַשְׁמִיעַ מְבַשֵּׂר. הוֹשַׁעֲנָא וְהוֹשִֽׁיעָה נָּא:\r\n" +
				" \r\n" +
				"הוֹשִׁיעֵֽנוּ מוֹשִׁיעֵֽנוּ. כִּי לְךָ עֵינֵֽינוּ. וּלְכָה לִישׁוּעָתֵֽנוּ:\r\n" +
				" \r\n" +
				"יוֹשֵׁב קֶדֶם אָיוֹם וְנוֹרָא, יוֹם זֶה תְּאַמֵּץ סוֹבְבֵי תוֹרָה. וְשָׁנָה זוֹ תְּהֵא שְׁנַת אוֹרָה. כִּי לְךָ עֵינֵֽינוּ. וּלְכָה לִישׁוּעָתֵֽנוּ:\r\n" +
				"וְנוֹפֵף קוֹרְאֶיךָ בְּרוּח נְמוּכָה. סוֹבְבִים שִׁבְעָה הַיּוֹם נְסוּבָה, וְשָׁנָה זוֹ תְּהֵא שְׁנַת בְּרָכָה. כִּי לְךָ עֵינֵֽינוּ. וּלְכָה לִישׁוּעָתֵֽנוּ:\r\n" +
				"שַׁגֵּב שָׁנָה זוֹ מִכָּל־מַחֲלָה, וְשִׁיתָהּ גְּשׁוּמָה דְּשׁוּנָה וּטְלוּלָה, וְשָׁנָה זוֹ תְּהֵא שְׁנַת גִּילָה. כִּי לְךָ עֵינֵֽינוּ. וּלְכָה לִישׁוּעָתֵֽנוּ:\r\n" +
				"פְּתָחֶיךָ הַרְחֵב לְאוֹם יָפָה כְּתִרְצָה. מִתְחַנֶּנֶת לְפָנֶֽיךָ בְהֶגְיוֹן מְלִיצָה. וְשָׁנָה זוֹ תְּהֵא שְׁנַת דִּיצָה. כִּי לְךָ עֵינֵֽינוּ. וּלְכָה לִישׁוּעָתֵֽנוּ:\r\n" +
				" \r\n" +
				"הָאֵל לְמוֹשָׁעוֹת. עַם נוֹשַׁע בַּיהֹוָה. הוֹשַׁעֲנָא בְּחַסְדְּךָ מְיַחֲלִים לַיהֹוָה. כִּי לִישׁוּעָֽתְךָֽ קִוִּֽינוּ יְהֹוָה. אָדָם וּבְהֵמָה תוֹשִֽׁיעַ יְהֹוָה. כִּי לִישׁוּעָֽתְךָֽ קִוִּֽינוּ יְהֹוָה: (שתי פעמים/twice)\r\n" +
				" \r\n" +
				"תִּפְתַּח אֶרֶץ וְיִפְרוּ יֶשַׁע. לְעַם אֲשֶׁר בְּכִפּוּרָם פְּדִיתָם מִפֶּשַׁע. תַּאֲוַת עֲנָוִים שָׁמַעְתָּ יְהֹוָה. כִּי לִישׁוּעָֽתְךָֽ קִוִּֽינוּ יְהֹוָה:\r\n" +
				"מִפֶּלֶג מָלֵא רַוֵּה לְאֻמֶּךָ. כְּיוֹם אֲשֶׁר יָצָאתָ לְיֵשַׁע עַמֶּךָ. יוֹם אֲשֶׁר נֶאֱמַר בּוֹ וַיּוֹשַׁע יְהֹוָה. כִּי לִישׁוּעָֽתְךָֽ קִוִּֽינוּ יְהֹוָה:\r\n" +
				"הֱיֵה נָא לִישׁוּעָה צוּר עוֹנֶה בַצַּר. פְּדוּתִי קָרֵב כִּי יָדְךָ לֹא תִקְצַר. רְאֵה כִּי תָּאַבְתִּי יְשׁוּעָתְךָ יְהֹוָה. כִּי לִישׁוּעָֽתְךָֽ קִוִּֽינוּ יְהֹוָה:\r\n" +
				"הוֹשִֽׁיעָה אַסִּיר צוֹעֵק מִבֵּית כֶּלֶא, לְשַׁוְעִי הִמָּצֵא צוּר עוֹשֶׂה פֶלֶא. פְּתַח פֶּלֶג מָלֵא. יִשְׂבְּעוּ עֲצֵי יְהֹוָה. כִּי לִישׁוּעָֽתְךָֽ קִוִּֽינוּ יְהֹוָה:\r\n" +
				"הַטֵּה אָזְנְךָ שְׁמַע נָא וְהוֹשַׁע נָא. נְפָשׁוֹת הַטְּרוּחוֹת בְּמַאֲרִיכֵי תְּחִנָה. שִׂפְתוֹתָם תַּבַּעְנָה יְשׁוּעָתָה לַיהֹוָה. כִּי לִישׁוּעָֽתְךָֽ קִוִּֽינוּ יְהֹוָה:\r\n" +
				"רְצֵה שַׁוְעַת אֲמֵלִים. יְשׁוּעָתְךָ מְיַחֲלִים, וּמְזוֹנָם שׁוֹאֲלִים, בְּיוֹם לוּלָב נוֹטְלִים. גְּשָׁמִים וּטְלָלִים, תַּזִּיל מִזְּבוּלִים. וְחִישׁ יֵלְכוּ גְּאוּלִים. וּפְדוּיֵי יְהֹוָה. כִּי לִישׁוּעָֽתְךָֽ קִוִּֽינוּ יְהֹוָה:\r\n" +
				" \r\n" +
				"קוֹל מְבַשֵּׂר מְבַשֵּׂר וְאוֹמֵר: (ז׳ פעמים/seven times)\r\n" +
				" \r\n" +
				"יְפֵה נוֹף אֲנוֹפֵף בְּחֶזְיוֹן תְּעוּדָה, יִשְׂמַח הַר־צִיּוֹן תָּגֵלְנָה בְּנוֹת יְהוּדָה. מְבַשֵּׂר מְבַשֵּׂר וְאוֹמֵר:\r\n" +
				"וָוֵי נָוֵךְ אֲפַסֵּג וְאַרְחִיב גְּבוּלֵךְ. כִּי יְהֹוָה יִהְיֶה־לָּךְְ לְאוֹר עוֹלָם וְשָׁלְמוּ יְמֵי אֶבְלֵךְ. מְבַשֵּׂר מְבַשֵּׂר וְאוֹמֵר:\r\n" +
				"סֹבּוּ צִיּוֹן וְהַקִּיפוּהָ סִפְרוּ מִגְדָּלֶיהָ. שִׂישׂוּ אִתָּהּ מָשׂוֹשׂ כָּל־הַמִּתְאַבְּלִים עָלֶיהָ. מְבַשֵּׂר מְבַשֵּׂר וְאוֹמֵר:\r\n" +
				"פֶּתַע אַשְׁלִיךְ עַל אֱדוֹם נַעֲלַֽיִם. פִּצְחוּ רַנְּנוּ יַחְדָּו חָרְבוֹת יְרוּשָׁלַֽיִם. מְבַשֵּׂר מְבַשֵּׂר וְאוֹמֵר:\r\n" +
				"קֵץ יְשׁוּעָתִי חַשְׁתִּי מִמְּעוֹן שַׁחַק. קֵרַבְתִּי צִדְקָתִי לֹא תִרְחָק. מְבַשֵּׂר מְבַשֵּׂר וְאוֹמֵר:\r\n" +
				"הִתְעוֹרְרִי מִמִּזְרַח וּבֹאִי מִמַּעֲרָב, הַר־צִיּוֹן יַרְכְּתֵי צָפוֹן קִרְיַת מֶלֶך רָב. מְבַשֵּׂר מְבַשֵּׂר וְאוֹמֵר:\r\n" +
				" \r\n" +
				"קוֹל מְבַשֵּׂר מְבַשֵּׂר וְאוֹמֵר: (שתי פעמים/twice)\r\n" +
				" \r\n" +
				"כַּכָּתוּב: מַה־נָּאו֨וּ עַל־הֶהָרִ֜ים רַגְלֵ֣י מְבַשֵּׂ֗ר מַשְׁמִ֧יעַ שָׁל֛וֹם מְבַשֵּׂ֥ר ט֖וֹב מַשְׁמִ֣יעַ יְשׁוּעָ֑ה אֹמֵ֥ר לְצִיּ֖וֹן מָלַ֥ךְ אֱלֹהָֽיִךְ׃ וְנֶאֱמַר: ק֥וֹל צֹפַ֛יִךְ נָ֥שְׂאוּ ק֖וֹל יַחְדָּ֣ו יְרַנֵּ֑נוּ כִּ֣י עַ֤יִן בְּעַ֙יִן֙ יִרְא֔וּ בְּשׁ֥וּב יְהֹוָ֖ה צִיּֽוֹן׃ וְנֶאֱמַר: פִּצְח֤וּ רַנְּנוּ֙ יַחְדָּ֔ו חׇרְב֖וֹת יְרוּשָׁלָ֑͏ִם כִּֽי־נִחַ֤ם יְהֹוָה֙ עַמּ֔וֹ גָּאַ֖ל יְרוּשָׁלָֽ͏ִם׃ וְנֶאֱמַר: כִּֽי־נִחַ֨ם יְהֹוָ֜ה צִיּ֗וֹן נִחַם֙ כׇּל־חׇרְבֹתֶ֔יהָ וַיָּ֤שֶׂם מִדְבָּרָהּ֙ כְּעֵ֔דֶן וְעַרְבָתָ֖הּ כְּגַן־יְהֹוָ֑ה שָׂשׂ֤וֹן וְשִׂמְחָה֙ יִמָּ֣צֵא בָ֔הּ תּוֹדָ֖ה וְק֥וֹל זִמְרָֽה׃ וְנֶאֱמַר: רָנּ֤וּ שָׁמַ֙יִם֙ וְגִ֣ילִי אָ֔רֶץ וּפִצְח֥וּ הָרִ֖ים רִנָּ֑ה כִּֽי־נִחַ֤ם יְהֹוָה֙ עַמּ֔וֹ וַעֲנִיָּ֖יו יְרַחֵֽם׃ וְנֶאֱמַר: וְֽהָלְכ֞וּ עַמִּ֣ים רַבִּ֗ים וְאָֽמְרוּ֙ לְכ֣וּ ׀ וְנַעֲלֶ֣ה אֶל־הַר־יְהֹוָ֗ה אֶל־בֵּית֙ אֱלֹהֵ֣י יַעֲקֹ֔ב וְיֹרֵ֙נוּ֙ מִדְּרָכָ֔יו וְנֵלְכָ֖ה בְּאֹרְחֹתָ֑יו כִּ֤י מִצִּיּוֹן֙ תֵּצֵ֣א תוֹרָ֔ה וּדְבַר־יְהֹוָ֖ה מִירוּשָׁלָֽ͏ִם׃ וְנֶאֱמַר: וּפְדוּיֵ֨י יְהֹוָ֜ה יְשֻׁב֗וּן וּבָ֤אוּ צִיּוֹן֙ בְּרִנָּ֔ה וְשִׂמְחַ֥ת עוֹלָ֖ם עַל־רֹאשָׁ֑ם שָׂשׂ֤וֹן וְשִׂמְחָה֙ יַשִּׂ֔יגוּ וְנָ֖סוּ יָג֥וֹן וַאֲנָחָֽה׃ וְנֶאֱמַר: חָשַׂ֤ף יְהֹוָה֙ אֶת־זְר֣וֹעַ קׇדְשׁ֔וֹ לְעֵינֵ֖י כׇּל־הַגּוֹיִ֑ם וְרָאוּ֙ כׇּל־אַפְסֵי־אָ֔רֶץ אֵ֖ת יְשׁוּעַ֥ת אֱלֹהֵֽינוּ׃ וְנֶאֱמַר: וְיִֽהְי֨וּ דְבָרַ֜י אֵ֗לֶּה אֲשֶׁ֤ר הִתְחַנַּ֙נְתִּי֙ לִפְנֵ֣י יְהֹוָ֔ה קְרֹבִ֛ים אֶל־יְהֹוָ֥ה אֱלֹהֵ֖ינוּ יוֹמָ֣ם וָלָ֑יְלָה לַעֲשׂ֣וֹת ׀ מִשְׁפַּ֣ט עַבְדּ֗וֹ וּמִשְׁפַּ֛ט עַמּ֥וֹ יִשְׂרָאֵ֖ל דְּבַר־י֥וֹם בְּיוֹמֽוֹ׃ לְמַ֗עַן דַּ֚עַת כׇּל־עַמֵּ֣י הָאָ֔רֶץ כִּ֥י יְהֹוָ֖ה ה֣וּא הָאֱלֹהִ֑ים אֵ֖ין עֽוֹד׃");
		} else {
			addToSiddurHighlighted(
				"אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא. אֲנִי וָהוּ הוֹשִֽׁיעָה נָּא:\n\n" +
				"כַּכָּתוּב: הוֹשִׁ֤יעָה ׀ אֶת־עַמֶּ֗ךָ וּבָרֵ֥ךְ אֶת־נַחֲלָתֶ֑ךָ וּרְעֵ֥ם וְ֝נַשְּׂאֵ֗ם עַד־הָעוֹלָֽם: וְנֶאֱמַר: וְיִהְי֨וּ דְבָרַ֜י אֵ֗לֶּה אֲשֶׁ֤ר הִתְחַנַּ֙נְתִּי֙ לִפְנֵ֣י יְהֹוָ֔ה קְרֹבִ֛ים אֶל־יְהֹוָ֥ה אֱלֹהֵ֖ינוּ יוֹמָ֣ם וָלָ֑יְלָה לַעֲשׂ֣וֹת ׀ מִשְׁפַּ֣ט עַבְדּ֗וֹ וּמִשְׁפַּ֛ט עַמּ֥וֹ יִשְׂרָאֵ֖ל דְּבַר־י֥וֹם בְּיוֹמֽוֹ: לְמַ֗עַן דַּ֚עַת כָּל־עַמֵּ֣י הָאָ֔רֶץ כִּ֥י יְהֹוָ֖ה ה֣וּא הָאֱלֹהִ֑ים אֵ֖ין עֽוֹד: לֹא־יָמ֡וּשׁ סֵפֶר֩ הַתּוֹרָ֨ה הַזֶּ֜ה מִפִּ֗יךָ וְהָגִ֤יתָ בּוֹ֙ יוֹמָ֣ם וָלַ֔יְלָה לְמַ֙עַן֙ תִּשְׁמֹ֣ר לַעֲשׂ֔וֹת כְּכָל־הַכָּת֖וּב בּ֑וֹ כִּי־אָ֛ז תַּצְלִ֥יחַ אֶת־דְּרָכֶ֖ךָ וְאָ֥ז תַּשְׂכִּֽיל: הֲל֤וֹא צִוִּיתִ֙יךָ֙ חֲזַ֣ק וֶאֱמָ֔ץ אַל־תַּעֲרֹ֖ץ וְאַל־תֵּחָ֑ת כִּ֤י עִמְּךָ֙ יְהֹוָ֣ה אֱלֹהֶ֔יךָ בְּכֹ֖ל אֲשֶׁ֥ר תֵּלֵֽךְ:");
		}
	}

	private void addAmidahToSiddur(boolean isMincha, boolean isArvit) {
		addCategoryToSiddur("עמידה");

		addToSiddur(
			"אֲ֭דֹנָי שְׂפָתַ֣י תִּפְתָּ֑ח וּ֝פִ֗י יַגִּ֥יד תְּהִלָּתֶֽךָ׃ \n\n" +
			"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ וֵֽאלֹהֵי אֲבוֹתֵֽינוּ, אֱלֹהֵי אַבְרָהָם, אֱלֹהֵי יִצְחָק, וֵֽאלֹהֵי יַעֲקֹב. הָאֵל הַגָּדוֹל הַגִּבּוֹר וְהַנּוֹרָא, אֵל עֶלְיוֹן, גּוֹמֵל חֲסָדִים טוֹבִים, קוֹנֵה הַכֹּל, וְזוֹכֵר חַסְדֵּי אָבוֹת, וּמֵבִיא גוֹאֵל לִבְנֵי בְנֵיהֶם לְמַֽעַן שְׁמוֹ בְּאַֽהֲבָה:");

		if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()) {
			addToSiddurHighlighted("זָכְרֵנוּ לְחַיִּים, מֶלֶךְ חָפֵץ בַּחַיִּים, כָּתְבֵנוּ בְּסֵפֶר חַיִּים, לְמַעַנָךְ אֱלֹהִים חַיִּים.");
		}

		addToSiddur(
			"מֶֽלֶךְ עוֹזֵר וּמוֹשִֽׁיעַ וּמָגֵן: בָּרוּךְ אַתָּה יַהַוַהַ, מָגֵן אַבְרָהָם: \n\n" +
			"אַתָּה גִּבּוֹר לְעוֹלָם אֲדֹנָי, מְחַיֶּה מֵתִים אַתָּה, רַב לְהוֹשִֽׁיעַ.");

		if (jewishDateInfo.getIsMashivHaruchOrMoridHatalSaid().equals("משיב הרוח")) {
			addToSiddurHighlighted(
					"מַשִּׁיב הָרֽוּחַ וּמוֹרִיד הַגֶּֽשֶׁם.");
		} else {
			addToSiddurHighlighted(
					"מוֹרִיד הַטָּל.");
		}

		addToSiddur(
			"מְכַלְכֵּל חַיִּים בְּחֶֽסֶד, מְחַיֵּה מֵתִים בְּרַֽחֲמִים רַבִּים, סוֹמֵךְ נֽוֹפְלִים, וְרוֹפֵא חוֹלִים, וּמַתִּיר אֲסוּרִים, וּמְקַיֵּם אֱמֽוּנָתוֹ לִֽישֵׁנֵי עָפָר. מִי כָמֽוֹךָ בַּֽעַל גְּבוּרוֹת, וּמִי דֽוֹמֶה לָךְ, מֶֽלֶךְ מֵמִית וּמְחַיֶּה וּמַצְמִֽיחַ יְשׁוּעָה.");

		if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva())
			addToSiddurHighlighted("מִי כָמוֹךָ אָב הָרַחֲמָן, זוֹכֵר יְצוּרָיו בְּרַחֲמִים לְחַיִּים.");

		addToSiddur("וְנֶֽאֱמָן אַתָּה לְהַֽחֲיוֹת מֵתִים: בָּרוּךְ אַתָּה יֵהֵוֵהֵ, מְחַיֵּה הַמֵּתִים:");

		if (!isArvit) {
			addToSiddur(lineBreak);
			addToSiddur(
				"בחזרת הש\"ץ אומרים (Chazzan and the congregation say together)\n" +
				"נַקְדִּישָׁךְ וְנַעֲרִיצָךְ, כְּנֹֽעַם שִֽׂיחַ סוֹד שַׂרְפֵי קֹֽדֶשׁ, הַמְשַׁלְּשִׁים לְךָ קְדֻשָּׁה, וְכֵן כָּתוּב עַל יַד נְבִיאָךְ: וְקָרָ֨א זֶ֤ה אֶל־זֶה֙ וְאָמַ֔ר קָד֧וֹשׁ ׀ קָד֛וֹשׁ קָד֖וֹשׁ יְהֹוָ֣ה צְבָא֑וֹת מְלֹ֥א כָל־הָאָ֖רֶץ כְּבוֹדֽוֹ׃ לְעֻמָּתָם מְשַׁבְּחִים וְאוֹמְרִים: בָּר֥וּךְ כְּבוֹד־יְהֹוָ֖ה מִמְּקוֹמֽוֹ׃ וּבְדִבְרֵי קָדְשָׁךְ כָּתוּב לֵאמֹר: יִמְלֹ֤ךְ יְהֹוָ֨ה ׀ לְעוֹלָ֗ם אֱלֹהַ֣יִךְ צִ֭יּוֹן לְדֹ֥ר וָדֹ֗ר הַֽלְלוּיָֽהּ:");
			addToSiddur(lineBreak);
		}

		if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()) {
			addToSiddur(
					"אַתָּה קָדוֹשׁ וְשִׁמְךָ קָדוֹשׁ, וּקְדוֹשִׁים בְּכָל־יוֹם יְהַֽלְלֽוּךָ סֶּֽלָה: בָּרוּךְ אַתָּה יֹהֵוָהֵ, ");
			addToSiddurHighlighted("הַמֶּלֶךְ הַקָּדוֹשׁ:");
		} else {
			addToSiddur(
					"אַתָּה קָדוֹשׁ וְשִׁמְךָ קָדוֹשׁ, וּקְדוֹשִׁים בְּכָל־יוֹם יְהַֽלְלֽוּךָ סֶּֽלָה: בָּרוּךְ אַתָּה יֹהֵוָהֵ, הָאֵל הַקָּדוֹשׁ:");
		}

		addToSiddur("אַתָּה חוֹנֵן לְאָדָם דַּֽעַת וּמְלַמֵּד לֶאֱנוֹשׁ בִּינָה.");

		if (isArvit) {
			Calendar calendar = jewishDateInfo.getJewishCalendar().getGregorianCalendar();
			calendar.add(Calendar.DATE, -1);
			jewishDateInfo.setCalendar(calendar);
			if (jewishDateInfo.getJewishCalendar().isAssurBemelacha()) {
				calendar.add(Calendar.DATE, 1);
				jewishDateInfo.setCalendar(calendar);

				if (!jewishDateInfo.getJewishCalendar().isAssurBemelacha()) {
					addToSiddurHighlighted(
							"אַתָּה חוֹנַנְתָּנוּ יְהֹוָה אֱלֹהֵינוּ מַדָּע וְהַשְׂכֵּל, אַתָּה אָמַרְתָּ לְהַבְדִּיל בֵּין קֹדֶשׁ לְחֹל וּבֵין אוֹר לְחֹשֶׁךְ וּבֵין יִשְׂרָאֵל לָעַמִּים, וּבֵין יוֹם הַשְּׁבִיעִי לְשֵׁשֶׁת יְמֵי הַמַּעֲשֶׂה. כְּשֵׁם שֶׁהִבְדַּלְתָּנוּ יְהֹוָה אֱלֹהֵינוּ מֵעַמֵּי הָאֲרָצוֹת וּמִמִּשְׁפְּחוֹת הָאֲדָמָה, כָּךְ פְּדֵנוּ וְהַצִּילֵנוּ מִשָּׂטָן רָע וּמִפֶּגַע רָע, וּמִכָּל מִינֵי גְּזֵרוֹת קָשׁוֹת וְרָעוֹת הַמִּתְרַגְּשׁוֹת לָבֹא בָעוֹלָם.");
				}
				calendar.add(Calendar.DATE, -1);
				jewishDateInfo.setCalendar(calendar);
			}
			calendar.add(Calendar.DATE, 1);
			jewishDateInfo.setCalendar(calendar);
		}

		addToSiddur(
			"וְחָנֵּֽנוּ מֵאִתְּךָ חָכְמָה בִּינָה וָדָֽעַת: בָּרוּךְ אַתָּה יַהַוַהַ, חוֹנֵן הַדָּֽעַת: \n\n" +
			"הֲשִׁיבֵֽנוּ אָבִֽינוּ לְתֽוֹרָתֶֽךָ, וְקָֽרְבֵֽנוּ מַלְכֵּֽנוּ לַֽעֲבֽוֹדָתֶֽךָ, וְהַֽחֲזִירֵֽנוּ בִּתְשׁוּבָה שְׁלֵמָה לְפָנֶֽיךָ: בָּרוּךְ אַתָּה יֵהֵוֵהֵ, הָרוֹצֶה בִּתְשׁוּבָה: \n\n" +
			"סְלַח לָֽנוּ אָבִֽינוּ כִּי חָטָֽאנוּ, מְחוֹל לָֽנוּ מַלְכֵּֽנוּ כִּי פָשָֽׁעְנוּ, כִּי אֵל טוֹב וְסַלָּח אָֽתָּה: בָּרוּךְ אַתָּה יֶהֶוֶהֶ, חַנּוּן הַמַּרְבֶּה לִסְלֹחַ: \n\n" +
			"רְאֵה נָא בְעָנְיֵֽנוּ, וְרִיבָֽה רִיבֵֽנוּ, וּמַהֵר לְגָאֳלֵֽנוּ גְּאוּלָּה שְׁלֵמָה לְמַֽעַן שְׁמֶֽךָ, כִּי אֵל גּוֹאֵל חָזָק אָֽתָּה: בָּרוּךְ אַתָּה יְהְוְהְ, גּוֹאֵל יִשְׂרָאֵל:");

		if (jewishDateInfo.getJewishCalendar().isTaanis()
			&& jewishDateInfo.getJewishCalendar().getYomTovIndex() != JewishCalendar.YOM_KIPPUR
			&& !isArvit) {
			addToSiddurHighlighted(
				"בתענית ציבור השליח ציבור אומר בחזרה (Only Chazzan)\n" +
				"עֲנֵֽנוּ אָבִינוּ עֲנֵֽנוּ בְּיוֹם צוֹם הַתַּֽעֲנִית הַזֶּה, כִּי בְצָרָה גְדוֹלָה אֲנָֽחְנוּ. אַל־תֵּֽפֶן לְרִשְׁעֵֽנוּ, וְאַל־תִּתְעַלָּם מַלְכֵּֽנוּ מִבַּקָּשָׁתֵֽנוּ. הֱיֵה נָא קָרוֹב לְשַׁוְעָתֵֽנוּ, טֶֽרֶם נִקְרָא אֵלֶֽיךָ אַתָּה תַעֲנֶה, נְדַבֵּר וְאַתָּה תִשְׁמַע, כַּדָּבָר שֶׁנֶּאֱמַר: וְהָיָ֥ה טֶֽרֶם־יִקְרָ֖אוּ וַאֲנִ֣י אֶעֱנֶ֑ה ע֛וֹד הֵ֥ם מְדַבְּרִ֖ים וַאֲנִ֥י אֶשְׁמָֽע: כִּי אַתָּה יְהֹוָה פּוֹדֶה וּמַצִּיל, וְעוֹנֶה וּמְרַחֵם בְּכָל־עֵת צָרָה וְצוּקָה: \n" +
				"בָּרוּךְ אַתָּה יְהֹוָה הָעוֹנֶה לְעַמּוֹ יִשְׂרָאֵל בְּעֵת צָרָה:");
		}

		addToSiddur(
			"רְפָאֵֽנוּ יְהֹוָה וְנֵֽרָפֵא, הֽוֹשִׁיעֵֽנוּ וְנִוָּשֵֽׁעָה, כִּי תְהִלָּתֵֽנוּ אָֽתָּה, וְהַֽעֲלֵה אֲרוּכָה וּמַרְפֵּא לְכָל־תַּֽחֲלוּאֵֽינוּ וּלְכָל־מַכְאוֹבֵֽינוּ וּלְכָל־מַכּוֹתֵֽינוּ. כִּי אֵל רוֹפֵא רַחְמָן וְנֶֽאֱמָן אָֽתָּה: בָּרוּךְ אַתָּה יֹהֹוֹהֹ, רוֹפֵא חוֹלֵי עַמּוֹ יִשְׂרָאֵל:");

		if (jewishDateInfo.getIsBarcheinuOrBarechAleinuSaid().equals("ברכנו")) {
			addToSiddurHighlighted(
				"בָּֽרְכֵֽנוּ יְהֹוָה אֱלֹהֵֽינוּ בְּכָל־מַֽעֲשֵׂי יָדֵֽינוּ, וּבָרֵךְ שְׁנָתֵֽנוּ בְּטַֽלְלֵי רָצוֹן בְּרָכָה וּנְדָבָה, וּתְהִי אַֽחֲרִיתָהּ חַיִּים וְשָׂבָע וְשָׁלוֹם כַּשָּׁנִים הַטּוֹבוֹת לִבְרָכָה, כִּי אֵל טוֹב וּמֵטִיב אַתָּה וּמְבָרֵךְ הַשָּׁנִים: בָּרוּךְ אַתָּה יִהִוִהִ, מְבָרֵךְ הַשָּׁנִים");
		} else {
			addToSiddurHighlighted(
				"בָּרֵךְ עָלֵֽינוּ יְהֹוָה אֱלֹהֵֽינוּ אֶת־הַשָּׁנָה הַזֹּאת וְאֶת־כָּל־מִינֵי תְּבוּאָתָהּ לְטוֹבָה, וְתֵן טַל וּמָטָר לִבְרָכָה עַל כָּל־פְּנֵי הָאֲדָמָה, וְרַוֵּה פְּנֵי תֵבֵל וְשַׂבַּע אֶת־הָעוֹלָם כֻּלּוֹ מִטּוּבָךְ, וּמַלֵּא יָדֵֽינוּ מִבִּרְכוֹתֶֽיךָ וּמֵעֹֽשֶׁר מַתְּנוֹת יָדֶֽיךָ. שָׁמְרָה וְהַצִּֽילָה שָׁנָה זוֹ מִכָּל־דָּבָר רָע, וּמִכָּל־מִינֵי מַשְׁחִית וּמִכָּל־מִינֵי פֻרְעָנוּת, וַעֲשֵׂה לָהּ תִּקְוָה טוֹבָה וְאַחֲרִית שָׁלוֹם. חוּס וְרַחֵם עָלֶֽיהָ וְעַל כָּל־תְּבוּאָתָהּ וּפֵירוֹתֶיהָ, וּבָֽרְכָֽהּ בְּגִשְׁמֵי רָצוֹן בְּרָכָה וּנְדָבָה, וּתְהִי אַחֲרִיתָהּ חַיִּים וְשָׂבָע וְשָׁלוֹם. כַּשָּׁנִים הַטּוֹבוֹת לִבְרָכָה, כִּי אֵל טוֹב וּמֵטִיב אַתָּה וּמְבָרֵךְ הַשָּׁנִים. בָּרוּךְ אַתָּה יִהִוִהִ, מְבָרֵךְ הַשָּׁנִים:");
		}

		addToSiddur(
				"תְּקַע בְּשׁוֹפָר גָּדוֹל לְחֵֽרוּתֵֽנוּ, וְשָׂא נֵס לְקַבֵּץ גָּֽלֻיּוֹתֵֽינוּ, וְקַבְּצֵֽנוּ יַֽחַד מֵאַרְבַּע כַּנְפוֹת הָאָֽרֶץ לְאַרְצֵֽנוּ: בָּרוּךְ אַתָּה יֻהֻוֻהֻ, מְקַבֵּץ נִדְחֵי עַמּוֹ יִשְׂרָאֵל:");

		if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()) {
			addToSiddur(
				"הָשִֽׁיבָה שֽׁוֹפְטֵֽינוּ כְּבָרִֽאשׁוֹנָה, וְיֽוֹעֲצֵֽינוּ כְּבַתְּחִלָּה, וְהָסֵר מִמֶּֽנּוּ יָגוֹן וַֽאֲנָחָה. וּמְלוֹךְ עָלֵֽינוּ מְהֵרָה אַתָּה יְהֹוָה לְבַדְּךָ, בְּחֶֽסֶד וּבְרַֽחֲמִים, בְּצֶֽדֶק וּבְמִשְׁפָּט: בָּרוּךְ אַתָּה יוּהוּווּהוּ, ");
			addToSiddurHighlighted("הַמֶּלֶךְ הַמִּשְׁפָּט:");
		} else {
			addToSiddur(
				"הָשִֽׁיבָה שֽׁוֹפְטֵֽינוּ כְּבָרִֽאשׁוֹנָה, וְיֽוֹעֲצֵֽינוּ כְּבַתְּחִלָּה, וְהָסֵר מִמֶּֽנּוּ יָגוֹן וַֽאֲנָחָה. וּמְלוֹךְ עָלֵֽינוּ מְהֵרָה אַתָּה יְהֹוָה לְבַדְּךָ, בְּחֶֽסֶד וּבְרַֽחֲמִים, בְּצֶֽדֶק וּבְמִשְׁפָּט: בָּרוּךְ אַתָּה יוּהוּווּהוּ, מֶֽלֶךְ אוֹהֵב צְדָקָה וּמִשְׁפָּט:");
		}

		addToSiddur(
			"לַמִּינִים וְלַמַּלְשִׁינִים אַל־תְּהִי תִקְוָה, וְכָל־הַזֵּדִים כְּרֶֽגַע יֹאבֵֽדוּ, וְכָל־אֽוֹיְבֶֽיךָ וְכָל־שֽׂוֹנְאֶֽיךָ מְהֵרָה יִכָּרֵֽתוּ, וּמַלְכוּת הָֽרִשְׁעָה מְהֵרָה תְעַקֵּר וּתְשַׁבֵּר וּתְכַלֵּם וְתַכְנִיעֵם בִּמְהֵרָה בְיָמֵֽינוּ: בָּרוּךְ אַתָּה יָהָוָהָ, שׁוֹבֵר אוֹיְבִים וּמַכְנִֽיעַ זֵדִים: \n\n" +
			"עַל הַצַּדִּיקִים וְעַל הַֽחֲסִידִים, וְעַל שְׁאֵרִית עַמְּךָ בֵּית יִשְׂרָאֵל, וְעַל זִקְנֵיהֶם, וְעַל פְּלֵיטַת בֵּית סֽוֹפְרֵיהֶם, וְעַל גֵּרֵי הַצֶּֽדֶק וְעָלֵֽינוּ, יֶֽהֱמוּ נָא רַֽחֲמֶֽיךָ, יְהֹוָה אֱלֹהֵֽינוּ, וְתֵן שָׂכָר טוֹב לְכָל־הַבּֽוֹטְחִים בְּשִׁמְךָ בֶּֽאֱמֶת, וְשִׂים חֶלְקֵֽנוּ עִמָּהֶם. וּלְעוֹלָם לֹא נֵבוֹשׁ כִּי בְךָ בָטָֽחְנוּ, וְעַל חַסְדְּךָ הַגָּדוֹל בֶּֽאֱמֶת נִשְׁעָֽנְנוּ: בָּרוּךְ אַתָּה יוּהוּווּהוּ, מִשְׁעָן וּמִבְטָח לַצַּדִּיקִים:");

		String tishkon = "תִּשְׁכּוֹן בְּתוֹךְ יְרוּשָׁלַֽיִם עִֽירְךָ כַּאֲשֶׁר דִּבַּֽרְתָּ, וְכִסֵּא דָוִד עַבְדְּךָ מְהֵרָה בְּתוֹכָהּ תָּכִין, וּבְנֵה אוֹתָהּ בִּנְיַן עוֹלָם בִּמְהֵרָה בְיָמֵֽינוּ:";
		if (jewishDateInfo.getJewishCalendar().isTishaBav()) {
			addToSiddur(tishkon);
			addToSiddurHighlighted(
				"נַחֵם יְהֹוָה אֱלֹהֵינוּ אֶת אֲבֵלֵי צִיּוֹן וְאֶת אֲבֵלֵי יְרוּשָׁלַיִם, וְאֶת הָעִיר הַחֲרֵבָה וְהַבְּזוּיָה, וְהַשּׁוֹמֵמָה, מִבְּלִי בָנֶיהָ הִיא יוֹשֶׁבֶת, וְרֹאשָׁהּ חָפוּי כְּאִשָּׁה עֲקָרָה שֶׁלֹא יָלָדָה. וַיְבַלְּעוּהָ לִגְיוֹנִים וַיִּירָשׁוּהָ, וַיַּטִּילוּ אֶת עַמְּךָ יִשְׂרָאֵל לַחֶרֶב, וַיַּהַרְגוּ בְזָדוֹן חֲסִידֵי עֶלְיוֹן. עַל כֵּן צִיּוֹן בְּמֶרֶר תִּבְכֶּה, וִירוּשָׁלַיִם תִּתֵּן קוֹלָהּ: לִבִּי לִבִּי עַל חַלְלֵיהֶם, מֵעַי מֵעַי עַל הֲרוּגֵיהֶם: כִּי אַתָּה יְהֹוָה בָּאֵשׁ הֵצַתָּהּ, וּבָאֵשׁ אַתָּה עָתִיד לִבְנוֹתָהּ, כַּכָּתוּב: וַאֲנִי אֶהְיֶה לָּהּ נְאֻם יְהֹוָה חוֹמַת אֵשׁ סָבִיב וּלְכָבוֹד אֶהְיֶה בְתוֹכָהּ׃\n" +
				"בָּרוּךְ אַתָּה יְהֹוָה, מְנַחֵם צִיּוֹן בְּבִנְיַן יְרוּשָׁלַיִם:");
		} else {
			addToSiddur(tishkon + " בָּרוּךְ אַתָּה יֻהֻוֻהֻ, בּוֹנֵה יְרוּשָׁלָיִם:");
		}

		addToSiddur(
			"אֶת צֶֽמַח דָּוִד עַבְדְּךָ מְהֵרָה תַצְמִֽיחַ, וְקַרְנוֹ תָּרוּם בִּישֽׁוּעָתֶֽךָ, כִּי לִֽישׁוּעָֽתְךָ קִוִּֽינוּ וְצִפִּינוּ כָּל־הַיּוֹם: בָּרוּךְ אַתָּה יִהִוִהִ, מַצְמִֽיחַ קֶֽרֶן יְשׁוּעָה: \n\n" +
			"שְׁמַע קוֹלֵֽנוּ, יְהֹוָה אֱלֹהֵֽינוּ, אָב הָרַֽחֲמָן, חוּס וְרַחֵם עָלֵֽינוּ, וְקַבֵּל בְּרַֽחֲמִים וּבְרָצוֹן אֶת־תְּפִלָּתֵֽנוּ, כִּי אֵל שׁוֹמֵֽעַ תְּפִלּוֹת וְתַֽחֲנוּנִים אָֽתָּה. וּמִלְּפָנֶֽיךָ מַלְכֵּֽנוּ, רֵיקָם אַל־תְּשִׁיבֵֽנוּ, חָנֵּֽנוּ וַֽעֲנֵֽנוּ וּשְׁמַע תְּפִלָּתֵֽנוּ.");

		if ((jewishDateInfo.getJewishCalendar().isTaanis() && !isArvit)
				|| jewishDateInfo.getJewishCalendar().isTishaBav()) {
			addToSiddurHighlighted(
				(isArvit ? "" : "בתענית אומר היחיד עננו (Only by yourself)\n") +
				"עֲנֵנוּ אָבִינוּ עֲנֵנוּ בְּיוֹם צוֹם הַתַּֽעֲנִית הַזֶּה כִּי בְצָרָה גְדוֹלָה אֲנָֽחְנוּ. אַל־תֵּֽפֶן לְרִשְׁעֵֽנוּ, וְאַל־תִּתְעַלָּם מַלְכֵּֽנוּ מִבַּקָּשָׁתֵֽנוּ. הֱיֵה נָא קָרוֹב לְשַׁוְעָתֵֽנוּ. טֶֽרֶם נִקְרָא אֵלֶֽיךָ אַתָּה תַֽעֲנֶה, נְדַבֵּר וְאַתָּה תִשְׁמַע, כַּדָּבָר שֶׁנֶּאֱמַר: וְהָיָ֥ה טֶֽרֶם־יִקְרָ֖אוּ וַאֲנִ֣י אֶעֱנֶ֑ה ע֛וֹד הֵ֥ם מְדַבְּרִ֖ים וַאֲנִ֥י אֶשְׁמָֽע: כִּי אַתָּה יְהֹוָה פּוֹדֶה וּמַצִּיל וְעוֹנֶה וּמְרַחֵם בְּכָל־עֵת צָרָה וְצוּקָה.");
		}

		addToSiddur(
			"כִּי אַתָּה שׁוֹמֵעַ תְּפִלַּת כָּל־פֶּה: בָּרוּךְ אַתָּה יֹהְוָה, שׁוֹמֵֽעַ תְּפִלָּה: \n\n" +
			"רְצֵה יְהֹוָה אֱלֹהֵֽינוּ בְּעַמְּךָ יִשְׂרָאֵל וְלִתְפִלָּתָם שְׁעֵה, וְהָשֵׁב הָֽעֲבוֹדָה לִדְבִיר בֵּיתֶֽךָ, וְאִשֵּׁי יִשְׂרָאֵל וּתְפִלָּתָם, מְהֵרָה בְּאַֽהֲבָה תְקַבֵּל בְּרָצוֹן, וּתְהִי לְרָצוֹן תָּמִיד עֲבוֹדַת יִשְׂרָאֵל עַמֶּֽךָ:");

		// Yaaleh Veyavo here:

		if (jewishDateInfo.getJewishCalendar().isRoshChodesh() || jewishDateInfo.getJewishCalendar().isCholHamoed()) {
			addToSiddurHighlighted(
				"אֱלֹהֵֽינוּ וֵאלֹהֵי אֲבוֹתֵֽינוּ, יַעֲלֶה וְיָבֹא, וְיַגִּֽיעַ וְיֵרָאֶה, וְיֵרָצֶה וְיִשָּׁמַע, וְיִפָּקֵד וְיִזָּכֵר, זִכְרוֹנֵֽנוּ וְזִכְרוֹן אֲבוֹתֵֽינוּ, זִכְרוֹן יְרוּשָׁלַֽיִם עִירָךְ, וְזִכְרוֹן מָשִֽׁיחַ בֶּן־דָּוִד עַבְדָּךְ, וְזִכְרוֹן כָּל־עַמְּךָ בֵּית יִשְׂרָאֵל לְפָנֶֽיךָ, לִפְלֵיטָה, לְטוֹבָה, לְחֵן, לְחֶֽסֶד וּלְרַחֲמִים, לְחַיִּים טוֹבִים וּלְשָׁלוֹם, בְּיוֹם");
			if (jewishDateInfo.getJewishCalendar().isRoshChodesh()) {
				addToSiddurHighlighted("רֹאשׁ הַחֹֽדֶשׁ הַזֶּה,");
			} else if (jewishDateInfo.getJewishCalendar().isCholHamoedPesach()) {
				addToSiddurHighlighted("חַג הַמַּצּוֹת הַזֶּה, בְּיוֹם מִקְרָא קֹֽדֶשׁ הַזֶּה,");
			} else if (jewishDateInfo.getJewishCalendar().isCholHamoedSuccos()) {
				addToSiddurHighlighted("חַג הַסֻּכּוֹת הַזֶּה, בְּיוֹם מִקְרָא קֹֽדֶשׁ הַזֶּה");
			}
			addToSiddurHighlighted(
				"לְרַחֵם בּוֹ עָלֵֽינוּ וּלְהוֹשִׁיעֵֽנוּ. זָכְרֵֽנוּ יְהֹוָה אֱלֹהֵֽינוּ בּוֹ לְטוֹבָה, וּפָקְדֵֽנוּ בוֹ לִבְרָכָה, וְהוֹשִׁיעֵֽנוּ בוֹ לְחַיִּים טוֹבִים, בִּדְבַר יְשׁוּעָה וְרַחֲמִים. חוּס וְחָנֵּֽנוּ, וַחֲמוֹל וְרַחֵם עָלֵֽינוּ, וְהוֹשִׁיעֵֽנוּ כִּי אֵלֶֽיךָ עֵינֵֽינוּ, כִּי אֵל מֶֽלֶךְ חַנּוּן וְרַחוּם אָֽתָּה:");
		}

		addToSiddur(
			"וְאַתָּה בְּרַֽחֲמֶֽיךָ הָרַבִּים, תַּחְפֹּץ בָּֽנוּ וְתִרְצֵֽנוּ, וְתֶֽחֱזֶֽינָה עֵינֵֽינוּ בְּשֽׁוּבְךָ לְצִיּוֹן בְּרַֽחֲמִים: בָּרוּךְ אַתָּה יִהִוִהִ, הַמַּֽחֲזִיר שְׁכִֽינָתוֹ לְצִיּוֹן:\n\n" +
			"מוֹדִים אֲנַֽחְנוּ לָךְ, שֶׁאַתָּה הוּא יְהֹוָה אֱלֹהֵֽינוּ וֵֽאלֹהֵי אֲבוֹתֵֽינוּ לְעוֹלָם וָעֶד, צוּרֵֽנוּ צוּר חַיֵּֽינוּ וּמָגֵן יִשְׁעֵֽנוּ אַתָּה הוּא, לְדוֹר וָדוֹר נוֹדֶה לְךָ וּנְסַפֵּר תְּהִלָּתֶֽךָ, עַל חַיֵּֽינוּ הַמְּסוּרִים בְּיָדֶֽךָ, וְעַל נִשְׁמוֹתֵֽינוּ הַפְּקוּדוֹת לָךְ, וְעַל נִסֶּֽיךָ שֶׁבְּכָל־יוֹם עִמָּֽנוּ, וְעַל נִפְלְאוֹתֶֽיךָ וְטֽוֹבוֹתֶֽיךָ שֶׁבְּכָל־עֵת, עֶֽרֶב וָבֹֽקֶר וְצָֽהֳרָֽיִם. הַטּוֹב, כִּי לֹא כָלוּ רַחֲמֶֽיךָ, הַמְּרַחֵם, כִּי לֹא תַֽמּוּ חֲסָדֶֽיךָ, כִּי מֵֽעוֹלָם קִוִּֽינוּ לָךְ:");

		if (!isArvit) {
			addToSiddur(lineBreak);
			addToSiddur(
				"בחזרת הש\"ץ כשהחזן אומר מודים, הקהל אומרים (As the Chazzan recites Modim in his repetition, say alongside him this paragraph silently):\n\n" +
				"מוֹדִים אֲנַחְנוּ לָךְ, שָׁאַתָּה הוּא יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, אֱלֹהֵי כָל בָּשָׁר, יוֹצְרֵנוּ יוֹצֵר בְּרֵאשִׁית. בְּרָכוֹת וְהוֹדָאוֹת לְשִׁמְךָ הַגָּדוֹל וְהַקָּדוֹשׁ, עַל שֶׁהֶחֱיִיתָנוּ וְקִיַּמְתָּנוּ. כֵּן תְּחַיֵּנוּ וּתְחָנֵּנוּ וְתֶאֱסוֹף גָּלֻיּוֹתֵינוּ לְחַצְרוֹת קָדְשֶׁךָ, לִשְׁמֹר חֻקֶּיךָ וְלַעֲשׂוֹת רְצוֹנְךָ וּלְעָבְדְךָ בְלֵבָב שָׁלֵם, עַל שֶׁאֲנַחְנוּ מוֹדִים לָךְ, בָּרוּךְ אֵל הַהוֹדָאוֹת.");
			addToSiddur(lineBreak);
		}

		if (jewishDateInfo.getJewishCalendar().isChanukah() || jewishDateInfo.getJewishCalendar().isPurim()) {
			if (jewishDateInfo.getJewishCalendar().getIsSafekMukafChoma()) {
				addToSiddurHighlighted("בספק מוקפת חומה, עדיף שלא לומר ועל הניסים ב-15./In a safek mukaf choma, it is better not to say \"Al Hanisim\" on the 15th. (הליכות עולם רלב)");
			}
			addToSiddurHighlighted("וְעַל הַנִּסִּים וְעַל הַפֻּרְקָן וְעַל הַגְּבוּרוֹת וְעַל הַתְּשׁוּעוֹת וְעַל הַנִּפְלָאוֹת וְעַל הַנֶּחָמוֹת שֶׁעָשִֽׂיתָ לַאֲבוֹתֵֽינוּ בַּיָּמִים הָהֵם בַּזְּמַן הַזֶּה:");

			if (jewishDateInfo.getJewishCalendar().isPurim()) {
				addToSiddurHighlighted(
					"בִּימֵי מָרְדְּכַי וְאֶסְתֵּר בְּשׁוּשַׁן הַבִּירָה. כְּשֶׁעָמַד עֲלֵיהֶם הָמָן הָרָשָׁע. בִּקֵּשׁ לְהַשְׁמִיד לַהֲרֹג וּלְאַבֵּד אֶת־כָּל־הַיְּהוּדִים מִנַּֽעַר וְעַד זָקֵן טַף וְנָשִׁים בְּיוֹם אֶחָד. בִּשְׁלֹשָׁה עָשָׂר לְחֹֽדֶשׁ שְׁנֵים עָשָׂר. הוּא חֹֽדֶשׁ אֲדָר. וּשְׁלָלָם לָבוֹז. וְאַתָּה בְּרַחֲמֶֽיךָ הָרַבִּים הֵפַֽרְתָּ אֶת־עֲצָתוֹ וְקִלְקַֽלְתָּ אֶת־מַחֲשַׁבְתּוֹ. וַהֲשֵׁבֽוֹתָ לּוֹ גְּמוּלוֹ בְרֹאשׁוֹ. וְתָלוּ אוֹתוֹ וְאֶת־בָּנָיו עַל הָעֵץ. וְעָשִֽׂיתָ עִמָּהֶם נִסִּים וְנִפְלָאוֹת וְנוֹדֶה לְשִׁמְךָ הַגָּדוֹל סֶֽלָה:");
			} else {
				addToSiddurHighlighted(
					"בִּימֵי מַתִּתְיָה בֶן־יוֹחָנָן כֹּהֵן גָּדוֹל. חַשְׁמוֹנָאי וּבָנָיו כְּשֶׁעָֽמְדָֽה מַלְכוּת יָוָן הָרְשָׁעָה עַל עַמְּךָ יִשְׂרָאֵל. לְשַׁכְּחָם תּוֹרָתָךְ וּלְהַעֲבִירָם מֵחֻקֵּי רְצוֹנָךְ. וְאַתָּה בְּרַחֲמֶֽיךָ הָרַבִּים עָמַֽדְתָּ לָהֶם בְּעֵת צָרָתָם. רַֽבְתָּ אֶת רִיבָם. דַּֽנְתָּ אֶת דִּינָם. נָקַֽמְתָּ אֶת נִקְמָתָם. מָסַֽרְתָּ גִבּוֹרִים בְּיַד חַלָּשִׁים. וְרַבִּים בְּיַד מְעַטִּים. וּרְשָׁעִים בְּיַד צַדִּיקִים. וּטְמֵאִים בְּיַד טְהוֹרִים. וְזֵדִים בְּיַד עֽוֹסְקֵֽי תוֹרָתֶֽךָ. לְךָ עָשִֽׂיתָ שֵׁם גָּדוֹל וְקָדוֹשׁ בְּעוֹלָמָךְ. וּלְעַמְּךָ יִשְׂרָאֵל עָשִֽׂיתָ תְּשׁוּעָה גְדוֹלָה וּפֻרְקָן כְּהַיּוֹם הַזֶּה. וְאַחַר כָּךְ בָּֽאוּ בָנֶֽיךָ לִדְבִיר בֵּיתֶֽךָ. וּפִנּוּ אֶת־הֵיכָלֶֽךָ. וְטִהֲרוּ אֶת־מִקְדָּשֶֽׁךָ. וְהִדְלִֽיקוּ נֵרוֹת בְּחַצְרוֹת קָדְשֶֽׁךָ. וְקָֽבְעֽוּ שְׁמוֹנַת יְמֵי חֲנֻכָּה אֵֽלּוּ בְּהַלֵּל וּבְהוֹדָאָה. וְעָשִֽׂיתָ עִמָּהֶם נִסִּים וְנִפְלָאוֹת וְנוֹדֶה לְשִׁמְךָ הַגָּדוֹל סֶֽלָה:");
			}
		}

		addToSiddur("וְעַל כֻּלָּם יִתְבָּרַךְ, וְיִתְרוֹמָם, וְיִתְנַשֵּׂא, תָּמִיד, שִׁמְךָ מַלְכֵּֽנוּ, לְעוֹלָם וָעֶד. וְכָל־הַחַיִּים יוֹדֽוּךָ סֶּֽלָה:");

		if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()) {
			addToSiddurHighlighted("וּכְתֹב לְחַיִּים טוֹבִים כָּל בְּנֵי בְרִיתֶךָ.");
		}

		addToSiddur("וִֽיהַֽלְלוּ וִֽיבָֽרְכוּ אֶת־שִׁמְךָ הַגָּדוֹל בֶּֽאֱמֶת לְעוֹלָם כִּי טוֹב, הָאֵל יְשֽׁוּעָתֵֽנוּ וְעֶזְרָתֵֽנוּ סֶֽלָה, הָאֵל הַטּוֹב: " + "בָּרוּךְ אַתָּה יֻהֻוֻהֻ, הַטּוֹב שִׁמְךָ וּלְךָ נָאֶה לְהוֹדוֹת:");

		String birkatKohanim = "בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָֽעוֹלָם, אֲשֶׁר קִדְּשָֽׁנוּ בִּקְדֻשָּׁתוֹ שֶׁל־אַֽהֲרֹן, וְצִוָּֽנוּ לְבָרֵךְ אֶת־עַמּוֹ יִשְׂרָאֵל בְּאַֽהֲבָה: הקהל עונים אָמֵן: \n\n" +
			"ואומר החזן והכהנים אחריו מילה במילה (The chazzan says and the cohanim repeat word for word): \n\n" +
			"יְבָרֶכְךָ֥ יְהֹוָ֖ה וְיִשְׁמְרֶֽךָ׃ ועונים (We answer) אָמֵן: \n\n" +
			"יָאֵ֨ר יְהֹוָ֧ה ׀ פָּנָ֛יו אֵלֶ֖יךָ וִֽיחֻנֶּֽךָּ׃ ועונים (We answer) אָמֵן: \n\n" +
			"יִשָּׂ֨א יְהֹוָ֤ה ׀ פָּנָיו֙ אֵלֶ֔יךָ וְיָשֵׂ֥ם לְךָ֖ שָׁלֽוֹם׃ ועונים (We answer) אָמֵן: \n\n" +
			"אם אין כהנים אומר החזן (if there is no cohen): \n\n" +
			"אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, בָּרְכֵנוּ בַּבְּרָכָה הַמְשֻׁלֶּשֶת בַּתּוֹרָה הַכְּתוּבָה עַל יְדֵי מֹשֶׁה עַבְדֶּֽךָ, הָאֲמוּרָה מִפִּי אַהֲרֹן וּבָנָיו הַכֹּהֲנִים עִם קְדוֹשֶׁיךָ כָּאָמוּר: \n\n" +
			"יְבָרֶכְךָ֥ יְהֹוָ֖ה וְיִשְׁמְרֶֽךָ׃ ועונים כֵּן יְהִי רָצוֹן: \n\n" +
			"יָאֵ֨ר יְהֹוָ֧ה ׀ פָּנָ֛יו אֵלֶ֖יךָ וִֽיחֻנֶּֽךָּ׃ ועונים כֵּן יְהִי רָצוֹן: \n\n" +
			"יִשָּׂ֨א יְהֹוָ֤ה ׀ פָּנָיו֙ אֵלֶ֔יךָ וְיָשֵׂ֥ם לְךָ֖ שָׁלֽוֹם׃ ועונים כֵּן יְהִי רָצוֹן: וְשָׂמ֥וּ אֶת־שְׁמִ֖י עַל־בְּנֵ֣י יִשְׂרָאֵ֑ל וַאֲנִ֖י אֲבָרְכֵֽם:";

		if (!isArvit && isMincha && jewishDateInfo.getJewishCalendar().isTaanis()) {
			addToSiddurHighlighted(lineBreak);
			addToSiddurHighlighted(
				"בחזרת הש\"ץ בתענית ציבור כשמתפללים מנחה קטנה תוך חצי שעה סמוך לשקיעה, אומרים ברכת כהנים: (Cohanim go up on a fast day close to sunset and say)\n\nאם יש יותר מכהן אחד קורא להם החזן (If there is more than one cohen, the chazzan calls out):\n\nכֹּהֲנִים:\n\nהכהנים מברכים: " +
				birkatKohanim);
			addToSiddurHighlighted(lineBreak);
		} else if (!isArvit && !isMincha) {
			addToSiddur(lineBreak);
			addToSiddur(
				"בחזרת הש\"ץ אומרים ברכת כהנים, אם יש יותר מכהן אחד קורא להם החזן (If there is more than one cohen, the chazzan calls out):\n\nכֹּהֲנִים:\n\nהכהנים מברכים:\n\n" +
				birkatKohanim);
			addToSiddur(lineBreak);
		}

		addToSiddur(
			"שִׂים שָׁלוֹם טוֹבָה וּבְרָכָה, חַיִּים חֵן וָחֶֽסֶד צְדָקָה וְרַֽחֲמִים, עָלֵֽינוּ וְעַל כָּל־יִשְׂרָאֵל עַמֶּֽךָ. וּבָֽרְכֵֽנוּ אָבִֽינוּ כֻּלָּֽנוּ כְּאֶחָד בְּאוֹר פָּנֶֽיךָ, כִּי בְאוֹר פָּנֶֽיךָ נָתַֽתָּ לָּֽנוּ יְהֹוָה אֱלֹהֵֽינוּ תּוֹרָה וְחַיִּים, אַֽהֲבָה וָחֶֽסֶד, צְדָקָה וְרַֽחֲמִים, בְּרָכָה וְשָׁלוֹם. וְטוֹב בְּעֵינֶֽיךָ לְבָֽרְכֵֽנוּ וּלְבָרֵךְ אֶת־כָּל־עַמְּךָ יִשְׂרָאֵל, בְּרֹב עֹז וְשָׁלוֹם:");

		if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()) {
			addToSiddurHighlighted(
				"וּבְסֵפֶר חַיִּים, בְּרָכָה וְשָׁלוֹם, וּפַרְנָסָה טוֹבָה וִישׁוּעָה וְנֶחָמָה, וּגְזֵרוֹת טוֹבוֹת, נִזָּכֵר וְנִכָּתֵב לְפָנֶיךָ, אֲנַחְנוּ וְכָל עַמְּךָ בֵּית יִשְׂרָאֵל, לְחַיִּים טוֹבִים וּלְשָׁלוֹם.");
		}

		addToSiddur(
			"בָּרוּךְ אַתָּה יוּהוּווּהוּ, הַמְּבָרֵךְ אֶת עַמּוֹ יִשְׂרָאֵל בַּשָּׁלוֹם. אָמֵן: \n\n" +
			"יִֽהְי֥וּ לְרָצ֨וֹן ׀ אִמְרֵי־פִ֡י וְהֶגְי֣וֹן לִבִּ֣י לְפָנֶ֑יךָ יְ֝הֹוָ֗ה צוּרִ֥י וְגֹאֲלִֽי׃");
		if (jewishDateInfo.getJewishCalendar().getYomTovIndex() == JewishCalendar.EREV_YOM_KIPPUR && isMincha) {
			addToSiddurHighlighted(
				"אָֽנָּֽא יְהֹוָה וֵאלֹהֵי אֲבוֹתֵֽינוּ. תָּבֹא לְפָנֶֽיךָ תְּפִלָּתֵֽנוּ. וְאַל־תִּתְעַלַּם מַלְכֵּֽנוּ מִתְּחִנָּתֵֽנוּ. שֶׁאֵין אֲנַחְנוּ עַזֵּי פָנִים וּקְשֵׁי עֹֽרֶף לוֹמַר לְפָנֶֽיךָ יְהֹוָה אֱלֹהֵֽינוּ וֵאלֹהֵי אֲבוֹתֵֽינוּ, צַדִּיקִים אֲנַחְנוּ וְלֹא חָטָֽאנוּ. אֲבָל חָטָֽאנוּ. עָוִֽינוּ. פָּשַֽׁעְנוּ. אֲנַֽחְנוּ וַאֲבוֹתֵֽינוּ וְאַנְשֵׁי בֵיתֵֽנוּ: אָשַׁמְנוּ. בָּגַדְנוּ. גָּזַלְנוּ. דִּבַּרְנוּ דֹפִי וְלָשׁוֹן הָרָע. הֶעֱוִֽינוּ. וְהִרְשַׁעְנוּ. זַדְנוּ. חָמַסְנוּ. טָפַלְנוּ שֶׁקֶר וּמִרְמָה. יָעַצְנוּ עֵצוֹת רָעוֹת. כִּזַּבְנוּ. כָּעַסְנוּ. לַצְנוּ. מָרַדְנוּ. מָרִֽינוּ דְבָרֶֽיךָ. נִאַצְנוּ. נִאַפְנוּ. סָרַרְנוּ. עָוִֽינוּ. פָּשַׁעְנוּ. פָּגַמְנוּ. צָרַרְנוּ. צִעַרְנוּ אָב וָאֵם. קִשִּׁינוּ עֹרֶף. רָשַׁעְנוּ. שִׁחַתְנוּ. תִּעַבְנוּ. תָּעִֽינוּ וְתִעֲתַעְנוּ. וְסַרְנוּ מִמִּצְוֹתֶֽיךָ וּמִמִּשְׁפָּטֶֽיךָ הַטּוֹבִים וְלֹא שָׁוָה לָֽנוּ. וְאַתָּה צַדִּיק עַל־כָּל־הַבָּא עָלֵֽינוּ. כִּי אֱמֶת עָשִׂיתָ. וַאֲנַחְנוּ הִרְשָׁעְנוּ: \n\n" +
				"מַה־נֹּאמַר לְפָנֶֽיךָ יוֹשֵׁב מָרוֹם. וּמַה־נְּסַפֵּר לְפָנֶֽיךָ שׁוֹכֵן שְׁחָקִים: הֲלֹא הַנִּסְתָּרוֹת וְהַנִּגְלוֹת. אַתָּה יוֹדֵֽעַ: אַתָּה יוֹדֵֽעַ רָזֵי עוֹלָם. וְתַעֲלוּמוֹת סִתְרֵי כָל־חָי: אַתָּה חוֹפֵשׂ כָּל־חַדְרֵי־בָֽטֶן. רוֹאֶה כְלָיוֹת וָלֵב: אֵין דָּבָר נֶעְלָם מִמָּךְ. וְאֵין נִסְתָּר מִנֶּֽגֶד עֵינֶֽיךָ: \n\n" +
				"יְהִי רָצוֹן מִלְּפָנֶֽיךָ יְהֹוָה אֱלֹהֵֽינוּ וֵאלֹהֵי אֲבוֹתֵֽינוּ, שֶׁתִּמְחֹל לָֽנוּ אֶת־כָּל־חַטֹּאתֵֽינוּ, וּתְכַפֵּר לָֽנוּ אֶת־כָּל־עֲוֹנוֹתֵֽינוּ, וְתִמְחֹל וְתִסְלַח לְכָל פְּשָׁעֵֽינוּ. \n\n" +
				"על סדר א״ב \n\n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּאֹנֶס: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בִּבְלִי דַעַת: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּגִלּוּי עֲרָיוֹת: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּדַעַת וּבְמִרְמָה: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּהִרְהוּר הַלֵּב: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּוִדּוּי פֶּה: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּזָדוֹן: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּחֹזֶק יָד: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּטֻמְאַת שְׂפָתָיִם: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּיֵצֶר הָרָע: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּיוֹדְעִים וּבְלֹא יוֹדְעִים: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּכַחַשׁ וּבְכָזָב: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּלָשׁוֹן הָרָע: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּמַרְאִית הָעָיִן: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּנֶשֶׁךְ וּבְמַרְבִּית: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּשִׂיחַ שִׂפְתוֹתֵינוּ: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בַּסֵּתֶר: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּעֵינַיִם רָמוֹת: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּפִתְחוֹן פֶּה: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּצַעֲדֵי רַגְלַיִם לְהָרָע: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בִּקְפִיצַת יָד: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּרָצוֹן: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בִּשְׁגָגָה: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בִּתְשׂוּמֶת יָד: \n\n" +
				"על סדר תשר״ק \n\n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּתִמְהוֹן לֵבָב: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּשִׂנְאַת חִנָּם: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּרַגְלַיִם מְמַהֲרוֹת לָרוּץ לְרָעָה: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בִּרְכִילוּת: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּקִשּׁוּי עֹרֶף: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּצַוָּאר עָתָק: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בִּפְרִיקַת עֹל: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּעַזּוּת מֶצַח: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּסִקּוּר עָיִן: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בִּנְטִיַּת גָּרוֹן: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּמַשָּא וּמַתָּן: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בִּלְשׁוֹן תַּרְמִית: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בִּכְנֵסִיָּה שֶׁלֹּא לְשֵׁם שָׁמָיִם: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּיוּהְרָא: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּטֻמְאַת רַעְיוֹן: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּחִלּוּל הַשֵּׁם: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּזִלְזוּל הוֹרִים וּמוֹרִים: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּוִיעוּד עֲבֵרָה: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּהוֹצָאַת דִּבָּה: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בִּדְבָרִים בְּטֵלִים: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּגַאֲוָה וָבוּז: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּגִלְגּוּל זֶה וּבְגִלְגּוּלִים אֲחֵרִים: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּבִטּוּי שְׂפָתָיִם: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בַּאֲכִילַת אִסּוּר: \n" +
				"עַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ בְּמָאתַיִם וְאַרְבָּעִים וּשְׁמוֹנָה אֵבָרִים וּשְׁלֹשׁ מֵאוֹת וְשִׁשִּׁים וַחֲמִשָּׁה גִּידִים שֶׁל גּוּפֵנוּ וְנַפְשֵׁנוּ וְרוּחֵנוּ וְנִשְׁמָתֵנוּ וּנְשָׁמָה לְנִשְׁמָתֵנוּ: \n" +
				"וְעַל חֵטְא שֶׁחָטָאנוּ לְפָנֶיךָ שֶׁגָּרַמְנוּ פְּגַם וּמוּם בְּמָאתַיִם וְאַרְבָּעִים וּשְׁמוֹנָה אֵבָרִים וּשְׁלֹשׁ מֵאוֹת וְשִׁשִּׁים וַחֲמִשָּׁה גִּידִים שֶׁל אֲחֵרִים וּבְגוּפָם וְנַפְשָׁם וְרוּחָם וְנִשְׁמָתָם וּנְשָׁמָה לְנִשְׁמָתָם: \n" +
				"עַל חֲטָאִים שֶׁאֲנַחְנוּ חַיָּבִים עֲלֵיהֶם עַל בִּטּוּל מִצְוֹת עֲשֵׂה: \n" +
				"עַל חֲטָאִים שֶׁאֲנַחְנוּ חַיָּבִים עֲלֵיהֶם עַל לָאו הַנִּתַּק לַעֲשֵׂה: \n" +
				"עַל חֲטָאִים שֶׁאֲנַחְנוּ חַיָּבִים עֲלֵיהֶם עַל לָאו שֶׁאֵין בּוֹ מַעֲשֶׂה: \n" +
				"עַל חֲטָאִים שֶׁאֲנַחְנוּ חַיָּבִים עֲלֵיהֶם עֹלָה: \n" +
				"עַל חֲטָאִים שֶׁאֲנַחְנוּ חַיָּבִים עֲלֵיהֶם חַטָּאת: \n" +
				"עַל חֲטָאִים שֶׁאֲנַחְנוּ חַיָּבִים עֲלֵיהֶם קָרְבַּן עוֹלֶה וְיוֹרֵד: \n" +
				"עַל חֲטָאִים שֶׁאֲנַחְנוּ חַיָּבִים עֲלֵיהֶם אָשָׁם תָּלוּי וְאָשָׁם וַדָּאי: \n" +
				"עַל חֲטָאִים שֶׁאֲנַחְנוּ חַיָּבִים עֲלֵיהֶם מַכַּת מַרְדוּת: \n" +
				"עַל חֲטָאִים שֶׁאֲנַחְנוּ חַיָּבִים עֲלֵיהֶם מַלְקוֹת אַרְבָּעִים: \n" +
				"עַל חֲטָאִים שֶׁאֲנַחְנוּ חַיָּבִים עֲלֵיהֶם מִיתָה בִּידֵי שָׁמָיִם: \n" +
				"עַל חֲטָאִים שֶׁאֲנַחְנוּ חַיָּבִים עֲלֵיהֶם מִיתוֹת מְשֻׁנּוֹת: \n" +
				"עַל חֲטָאִים שֶׁאֲנַחְנוּ חַיָּבִים עֲלֵיהֶם כָּרֵת וַעֲרִירִי: \n" +
				"עַל חֲטָאִים שֶׁאֲנַחְנוּ חַיָּבִים עֲלֵיהֶם גִּלְגּוּל בְּדוֹמֵם וְצוֹמֵחַ וְחַי בִּלְתִּי מְדַבֵּר. וְחַי מְדַבֵּר: \n" +
				"עַל חֲטָאִים שֶׁאֲנַחְנוּ חַיָּבִים עֲלֵיהֶם כָּל מִינִי יִסּוּרִים: \n" +
				"עַל חֲטָאִים שֶׁאֲנַחְנוּ חַיָּבִים עֲלֵיהֶם כָּל מִינִי עֳנָשִׁים: \n" +
				"עַל חֲטָאִים שֶׁאֲנַחְנוּ חַיָּבִים עֲלֵיהֶם אַרְבַּע מִיתוֹת בֵּית דִּין. סְקִילָה, שְׂרֵפָה, הֶרֶג וְחֶנֶק. עַל מִצְוֹת עֲשֵׂה. וְעַל מִצְוֹת לֹא תַעֲשֶׂה. בֵּין שֶׁיֵּשׁ בָּם קוּם עֲשֵׂה. וּבֵין שֶׁאֵין בָּם קוּם עֲשֵׂה. בֵּין שֶׁגְּלוּיִים לָנוּ. וּבֵין שֶׁאֵינָן גְּלוּיִים לָנוּ. אֶת שֶׁגְּלוּיִים לָנוּ כְּבָר אָמַרְנוּם לְפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, וְהוֹדִינוּ לְךָ עֲלֵיהֶם. וְאֶת שֶׁאֵינָן גְּלוּיִים לָנוּ, הֵם גְּלוּיִים וִידוּעִים לְפָנֶיךָ, כִּי הַכֹּל גָּלוּי וְצָפוּי לְפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ. כְּמוֹ שֶׁנֶּאֱמַר: הַנִּ֨סְתָּרֹ֔ת לַיהֹוָ֖ה אֱלֹהֵ֑ינוּ וְהַנִּגְלֹ֞ת לָ֤ׄנׄוּׄ וּׄלְׄבָׄנֵ֙ׄיׄנׄוּ֙ׄ עַׄד־עוֹלָ֔ם לַעֲשׂ֕וֹת אֶת־כׇּל־דִּבְרֵ֖י הַתּוֹרָ֥ה הַזֹּֽאת׃ כִּי אַתָּה סוֹלְחָן לְיִשְׂרָאֵל וּמוֹחֲלָן לְשִׁבְטֵי יְשֻׁרוּן. וּמִבַּלְעָדֶיךָ אֵין לָנוּ מֶלֶךְ מוֹחֵל וְסוֹלֵחַ: \n\n" +
				"אֱלהַי. עַד שֶׁלֹּא נוֹצַרְתִּי אֵינִי כְדַאי, וְעַכְשָׁו שֶׁנּוֹצַרְתִּי כְּאִלּוּ לֹא נוֹצַרְתִּי. עָפָר אֲנִי בְּחַיָּי, קַל וָחֹמֶר בְּמִיתָתִי. הֲרֵי אֲנִי לְפָנֶיךָ יְהֹוָה אֱלהַי וֵאלֹהֵי אֲבוֹתַי, כִּכְלִי מָלֵא בּוּשָׁה וּכְלִמָּה: \n\n" +
				"יְהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהַי וֵאלֹהֵי אֲבוֹתַי, שֶׁלֹּא אֶחֱטָא עוֹד. וּמַה שֶּׁחָטָאתִי לְפָנֶיךָ מְחֹק בְּרַחֲמֶיךָ הָרַבִּים, אֲבָל לֹא עַל יְדֵי יִסּוּרִין וְחוֹלָאִים רָעִים :יִֽהְי֥וּ לְרָצ֨וֹן ׀ אִמְרֵי־פִ֡י וְהֶגְי֣וֹן לִבִּ֣י לְפָנֶ֑יךָ יְ֝הֹוָ֗ה צוּרִ֥י וְגֹאֲלִֽי׃");
		}

		addToSiddur(
			"אֱלֹהַי, נְצֹר לְשׁוֹנִי מֵרָע וְשִׂפְתוֹתַי מִדַּבֵּר מִרְמָה, וְלִמְקַלְלַי נַפְשִׁי תִדֹּם, וְנַפְשִׁי כֶּֽעָפָר לַכֹּל תִּֽהְיֶה, פְּתַח לִבִּי בְּתוֹרָתֶֽךָ, וְאַחֲרֵי מִצְוֹתֶֽיךָ תִּרְדֹּף נַפְשִׁי. וְכָל־הַקָּמִים עָלַי לְרָעָה, מְהֵרָה הָפֵר עֲצָתָם וְקַלְקֵל מַחְשְׁבוֹתָם. עֲשֵׂה לְמַֽעַן שְׁמָךְ, עֲשֵׂה לְמַֽעַן יְמִינָךְ, עֲשֵׂה לְמַֽעַן תּֽוֹרָתָךְ, עֲשֵׂה לְמַֽעַן קְדֻשָּׁתָךְ. לְ֭מַעַן יֵחָלְצ֣וּן יְדִידֶ֑יךָ הוֹשִׁ֖יעָה יְמִֽינְךָ֣ וַעֲנֵֽנִי: \n\n" +
			"יִֽהְי֥וּ לְרָצ֨וֹן ׀ אִמְרֵי־פִ֡י וְהֶגְי֣וֹן לִבִּ֣י לְפָנֶ֑יךָ יְ֝הֹוָ֗ה צוּרִ֥י וְגֹאֲלִֽי׃");

		if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()) {
			addToSiddur("עֹשֶׂה");
			addToSiddurHighlighted("הַשָּׁלוֹם");
			addToSiddur(
					"בִּמְרוֹמָיו, הוּא בְּרַחֲמָיו יַעֲשֶׂה שָׁלוֹם עָלֵֽינוּ, וְעַל כָּל־עַמּוֹ יִשְׂרָאֵל, וְאִמְרוּ אָמֵן:");
		} else {
			addToSiddur(
					"עֹשֶׂה שָׁלוֹם בִּמְרוֹמָיו, הוּא בְּרַחֲמָיו יַעֲשֶׂה שָׁלוֹם עָלֵֽינוּ, וְעַל כָּל־עַמּוֹ יִשְׂרָאֵל, וְאִמְרוּ אָמֵן:");
		}

		addToSiddur(
				"יְהִי רָצוֹן מִלְּפָנֶֽיךָ, יְהֹוָה אֱלֹהֵֽינוּ וֵֽאלֹהֵי אֲבוֹתֵֽינוּ, שֶׁתִּבְנֶה בֵּית הַמִּקְדָשׁ בִּמְהֵרָה בְיָמֵֽינוּ, וְתֵן חֶלְקֵֽנוּ בְתוֹרָתָךְ לַעֲשׂוֹת חֻקֵּי רְצוֹנָךְ וּלְעָבְדָךְ בְּלֵבָב שָׁלֵם:");
	}

	private void addAvinuMalkeinu(boolean isTachanunSaid) {
		boolean say = isTachanunSaid;
		if (jewishDateInfo.getJewishCalendar().getYomTovIndex() == JewishCalendar.EREV_YOM_KIPPUR) {
			say = true;
		}
		if (jewishDateInfo.getJewishCalendar().isAseresYemeiTeshuva()) {
			addCategoryToSiddur("אבינו מלכנו");
			addToSiddurHighlighted(
				(say ? "אָבִינוּ מַלְכֵּנוּ חָטָאנוּ לְפָנֶיךָ רַחֵם עָלֵינוּ: \n" : "") +
				"אָבִינוּ מַלְכֵּנוּ אֵין לָנוּ מֶלֶךְ אֶלָּא אָתָּה: \n" +
				"אָבִינוּ מַלְכֵּנוּ עֲשֵׂה עִמָּנוּ לְמַעַן שְׁמֶךָ: \n" +
				"אָבִינוּ מַלְכֵּנוּ חַדֵּשׁ עָלֵינוּ שָׁנָה טוֹבָה: \n" +
				"אָבִינוּ מַלְכֵּנוּ בַּטֵּל מֵעָלֵינוּ כָּל־גְּזֵרוֹת קָשׁוֹת וְרָעוֹת: \n" +
				"אָבִינוּ מַלְכֵּנוּ בַּטֵּל מַחְשְׁבוֹת שֹׂנְאֵינוּ: \n" +
				"אָבִינוּ מַלְכֵּנוּ הָפֵר עֲצַת אוֹיְבֵינוּ: \n" +
				"אָבִינוּ מַלְכֵּנוּ כַּלֵּה כָּל צַר וּמַשְׂטִין מֵעָלֵינוּ: \n" +
				"אָבִינוּ מַלְכֵּנוּ כַּלֵּה דֶבֶר וְחֶרֶב וְרָעָה וְרָעָב וּשְׁבִי וּבִזָּה וּמַשְׁחִית וּמַגֵּפָה וְיֵצֶר הָרָע וְחוֹלָאִים רָעִים מִבְּנֵי בְרִיתֶךָ: \n" +
				"אָבִינוּ מַלְכֵּנוּ שְׁלַח רְפוּאָה שְׁלֵמָה לְכָל חוֹלֵי עַמֶּךָ: \n" +
				"אָבִינוּ מַלְכֵּנוּ מְנַע מַגֵּפָה מִנַּחֲלָתֶךָ: \n" +
				"אָבִינוּ מַלְכֵּנוּ זְכוֹר כִּי עָפָר אֲנָחְנוּ: \n" +
				(say ? "אָבִינוּ מַלְכֵּנוּ מְחוֹל וּסְלַח לְכָל עֲוֹנוֹתֵינוּ: \n" : "") +
				(say ? "אָבִינוּ מַלְכֵּנוּ קְרַע רוֹעַ גְּזַר דִּינֵנוּ: (יכוין בשם קר\"ע שט\"ן) \n" : "")
				+
				(say ? "אָבִינוּ מַלְכֵּנוּ מְחוֹק בְּרַחֲמֶיךָ הָרַבִּים כָּל שִׁטְרֵי חוֹבוֹתֵינוּ: \n"
						: "")
				+
				(say ? "אָבִינוּ מַלְכֵּנוּ מְחֵה וְהַעֲבֵר פְּשָׁעֵינוּ מִנֶּגֶד עֵינֶיךָ: \n" : "") +
				"אָבִינוּ מַלְכֵּנוּ כָּתְבֵנוּ בְּסֵפֶר חַיִּים טוֹבִים: \n" +
				"אָבִינוּ מַלְכֵּנוּ כָּתְבֵנוּ בְּסֵפֶר צַדִּיקִים וַחֲסִידִים: \n" +
				"אָבִינוּ מַלְכֵּנוּ כָּתְבֵנוּ בְּסֵפֶר יְשָׁרִים וּתְמִימִים: \n" +
				"אָבִינוּ מַלְכֵּנוּ כָּתְבֵנוּ בְּסֵפֶר פַּרְנָסָה וְכַלְכָּלָה טוֹבָה: \n" +
				(say ? "אָבִינוּ מַלְכֵּנוּ כָּתְבֵנוּ בְּסֵפֶר מְחִילָה וּסְלִיחָה וְכַפָּרָה: \n" : "") +
				"אָבִינוּ מַלְכֵּנוּ כָּתְבֵנוּ בְּסֵפֶר גְּאֻלָּה וִישׁוּעָה: \n" +
				"אָבִינוּ מַלְכֵּנוּ זָכְרֵנוּ בְּזִכְרוֹן טוֹב מִלְּפָנֶיךָ: \n" +
				"אָבִינוּ מַלְכֵּנוּ הַצְמַח לָנוּ יְשׁוּעָה בְּקָרוֹב: \n" +
				"אָבִינוּ מַלְכֵּנוּ הָרֵם קֶרֶן יִשְׂרָאֵל עַמֶּךָ: \n" +
				"אָבִינוּ מַלְכֵּנוּ וְהָרֵם קֶרֶן מְשִׁיחֶךָ: \n" +
				"אָבִינוּ מַלְכֵּנוּ חָנֵּנוּ וַעֲנֵנוּ: \n" +
				"אָבִינוּ מַלְכֵּנוּ הַחֲזִירֵנוּ בִּתְשׁוּבָה שְׁלֵמָה לְפָנֶיךָ: \n" +
				"אָבִינוּ מַלְכֵּנוּ שְׁמַע קוֹלֵנוּ חוּס וְרַחֵם עָלֵינוּ: \n" +
				"אָבִינוּ מַלְכֵּנוּ עֲשֵׂה לְמַעֲנָךְ אִם לֹא לְמַעֲנֵנוּ: \n" +
				"אָבִינוּ מַלְכֵּנוּ קַבֵּל בְּרַחֲמִים וּבְרָצוֹן אֶת תְּפִלָּתֵנוּ: \n" +
				"אָבִינוּ מַלְכֵּנוּ אַל תְּשִׁיבֵנוּ רֵיקָם מִלְּפָנֶיךָ:");
		} else {
			addToSiddur(lineBreak);
			addInfoToSiddur(
				"In a time of sorrow, the below prayer should be said/בשעת צרה שלא תבוא, נהגו לומר \"אבינו מלכנו\" גם בשאר ימות השנה",
				"\n\n" +
				(say ? "אָבִינוּ מַלְכֵּנוּ חָטָאנוּ לְפָנֶיךָ רַחֵם עָלֵינוּ: \n" : "") +
				"אָבִינוּ מַלְכֵּנוּ אֵין לָנוּ מֶלֶךְ אֶלָּא אָתָּה: \n" +
				"אָבִינוּ מַלְכֵּנוּ עֲשֵׂה עִמָּנוּ לְמַעַן שְׁמֶךָ: \n" +
				"אָבִינוּ מַלְכֵּנוּ בַּטֵּל מֵעָלֵינוּ כָּל־גְּזֵרוֹת קָשׁוֹת וְרָעוֹת: \n" +
				"אָבִינוּ מַלְכֵּנוּ בַּטֵּל מַחְשְׁבוֹת שֹׂנְאֵינוּ: \n" +
				"אָבִינוּ מַלְכֵּנוּ הָפֵר עֲצַת אוֹיְבֵינוּ: \n" +
				"אָבִינוּ מַלְכֵּנוּ כַּלֵּה כָּל צַר וּמַשְׂטִין מֵעָלֵינוּ: \n" +
				"אָבִינוּ מַלְכֵּנוּ כַּלֵּה דֶבֶר וְחֶרֶב וְרָעָה וְרָעָב וּשְׁבִי וּבִזָּה וּמַשְׁחִית וּמַגֵּפָה וְיֵצֶר הָרָע וְחוֹלָאִים רָעִים מִבְּנֵי בְרִיתֶךָ: \n" +
				"אָבִינוּ מַלְכֵּנוּ שְׁלַח רְפוּאָה שְׁלֵמָה לְכָל חוֹלֵי עַמֶּךָ: \n" +
				"אָבִינוּ מַלְכֵּנוּ מְנַע מַגֵּפָה מִנַּחֲלָתֶךָ: \n" +
				"אָבִינוּ מַלְכֵּנוּ זְכוֹר כִּי עָפָר אֲנָחְנוּ: \n" +
				(say ? "אָבִינוּ מַלְכֵּנוּ מְחוֹל וּסְלַח לְכָל עֲוֹנוֹתֵינוּ: \n" : "") +
				(say ? "אָבִינוּ מַלְכֵּנוּ קְרַע רוֹעַ גְּזַר דִּינֵנוּ: (יכוין בשם קר\"ע שט\"ן) \n" : "")
				+
				(say ? "אָבִינוּ מַלְכֵּנוּ מְחוֹק בְּרַחֲמֶיךָ הָרַבִּים כָּל שִׁטְרֵי חוֹבוֹתֵינוּ: \n"
						: "")
				+
				(say ? "אָבִינוּ מַלְכֵּנוּ מְחֵה וְהַעֲבֵר פְּשָׁעֵינוּ מִנֶּגֶד עֵינֶיךָ: \n" : "") +
				"אָבִינוּ מַלְכֵּנוּ זָכְרֵנוּ בְּזִכְרוֹן טוֹב מִלְּפָנֶיךָ: \n" +
				"אָבִינוּ מַלְכֵּנוּ הַצְמַח לָנוּ יְשׁוּעָה בְּקָרוֹב: \n" +
				"אָבִינוּ מַלְכֵּנוּ הָרֵם קֶרֶן יִשְׂרָאֵל עַמֶּךָ: \n" +
				"אָבִינוּ מַלְכֵּנוּ וְהָרֵם קֶרֶן מְשִׁיחֶךָ: \n" +
				"אָבִינוּ מַלְכֵּנוּ חָנֵּנוּ וַעֲנֵנוּ: \n" +
				"אָבִינוּ מַלְכֵּנוּ הַחֲזִירֵנוּ בִּתְשׁוּבָה שְׁלֵמָה לְפָנֶיךָ: \n" +
				"אָבִינוּ מַלְכֵּנוּ שְׁמַע קוֹלֵנוּ חוּס וְרַחֵם עָלֵינוּ: \n" +
				"אָבִינוּ מַלְכֵּנוּ עֲשֵׂה לְמַעֲנָךְ אִם לֹא לְמַעֲנֵנוּ: \n" +
				"אָבִינוּ מַלְכֵּנוּ קַבֵּל בְּרַחֲמִים וּבְרָצוֹן אֶת תְּפִלָּתֵנוּ: \n" +
				"אָבִינוּ מַלְכֵּנוּ אַל תְּשִׁיבֵנוּ רֵיקָם מִלְּפָנֶיךָ:");
			addToSiddur(lineBreak);
		}
	}

	public ArrayList<HighlightString> getMusafPrayers() {
		siddur = new ArrayList<>();

		addCategoryToSiddur("מוסף");
		addToSiddur(
			"אֲ֭דֹנָי שְׂפָתַ֣י תִּפְתָּ֑ח וּ֝פִ֗י יַגִּ֥יד תְּהִלָּתֶֽךָ׃ \n\n" +
			"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ וֵֽאלֹהֵי אֲבוֹתֵֽינוּ, אֱלֹהֵי אַבְרָהָם, אֱלֹהֵי יִצְחָק, וֵֽאלֹהֵי יַעֲקֹב. הָאֵל הַגָּדוֹל הַגִּבּוֹר וְהַנּוֹרָא, אֵל עֶלְיוֹן, גּוֹמֵל חֲסָדִים טוֹבִים, קוֹנֵה הַכֹּל, וְזוֹכֵר חַסְדֵּי אָבוֹת, וּמֵבִיא גוֹאֵל לִבְנֵי בְנֵיהֶם לְמַֽעַן שְׁמוֹ בְּאַֽהֲבָה: מֶֽלֶךְ עוֹזֵר וּמוֹשִֽׁיעַ וּמָגֵן: בָּרוּךְ אַתָּה יַהַוַהַ, מָגֵן אַבְרָהָם: \n\n" +
			"אַתָּה גִבּוֹר לְעוֹלָם אֲדֹנָי, מְחַיֶּה מֵתִים אַתָּה, רַב לְהוֹשִֽׁיעַ");

		if (jewishDateInfo.getIsMashivHaruchOrMoridHatalSaid().equals("משיב הרוח")) {
			addToSiddurHighlighted("מַשִּׁיב הָרֽוּחַ וּמוֹרִיד הַגֶּֽשֶׁם.");
		} else {
			addToSiddurHighlighted("מוֹרִיד הַטָּל.");
		}

		addToSiddur(
			"מְכַלְכֵּל חַיִּים בְּחֶֽסֶד, מְחַיֵּה מֵתִים בְּרַֽחֲמִים רַבִּים, סוֹמֵךְ נֽוֹפְלִים, וְרוֹפֵא חוֹלִים, וּמַתִּיר אֲסוּרִים, וּמְקַיֵּם אֱמֽוּנָתוֹ לִֽישֵׁנֵי עָפָר. מִי כָמֽוֹךָ בַּֽעַל גְּבוּרוֹת, וּמִי דֽוֹמֶה לָךְ, מֶֽלֶךְ מֵמִית וּמְחַיֶּה וּמַצְמִֽיחַ יְשׁוּעָה. וְנֶֽאֱמָן אַתָּה לְהַֽחֲיוֹת מֵתִים: בָּרוּךְ אַתָּה יֵהֵוֵהֵ, מְחַיֵּה הַמֵּתִים:");

		addToSiddur(lineBreak);
		addToSiddur(
			"כֶּתֶר יִתְּנוּ לְךָ, יְהֹוָה אֱלֹהֵינוּ, מַלְאָכִים הֲמוֹנֵי מַעְלָה, וְעַמְּךָ יִשְׂרָאֵל קְבוּצֵי מַטָּה. יַחַד כֻּלָּם קְדֻשָּׁה לְךָ יְשַׁלֵּשׁוּ, כַּדָּבָר הָאָמוּר עַל יַד נְבִיאָךְ וְקָרָ֨א זֶ֤ה אֶל־זֶה֙ וְאָמַ֔ר קָד֧וֹשׁ ׀ קָד֛וֹשׁ קָד֖וֹשׁ יְהֹוָ֣ה צְבָא֑וֹת מְלֹ֥א כָל־הָאָ֖רֶץ כְּבוֹדֽוֹ׃ לְעֻמָּתָם מְשַׁבְּחִים וְאוֹמְרִים בָּר֥וּךְ כְּבוֹד־יְהֹוָ֖ה מִמְּקוֹמֽוֹ׃ וּבְדִבְרֵי קָדְשְׁךָ כָּתוּב לֵאמֹר יִמְלֹ֤ךְ יְהֹוָ֨ה ׀ לְעוֹלָ֗ם אֱלֹהַ֣יִךְ צִ֭יּוֹן לְדֹ֥ר וָדֹ֗ר הַֽלְלוּיָֽהּ:");
		addToSiddur(lineBreak);

		addToSiddur(
			"אַתָּה קָדוֹשׁ וְשִׁמְךָ קָדוֹשׁ, וּקְדוֹשִׁים בְּכָל־יוֹם יְהַֽלְלֽוּךָ סֶּֽלָה: בָּרוּךְ אַתָּה יֹהֵוָהֵ, הָאֵל הַקָּדוֹשׁ:");

		if (jewishDateInfo.getJewishCalendar().isCholHamoed()) {
			addToSiddur(
				"אַתָּה בְּחַרְתָּנוּ מִכָּל הָעַמִּים, אָהַבְתָּ אוֹתָנוּ וְרָצִיתָ בָּנוּ, וְרוֹמַמְתָּנוּ מִכָּל הַלְּשׁוֹנוֹת, וְקִדַּשְׁתָּנוּ בְּמִצְוֹתֶיךָ, וְקֵרַבְתָּנוּ מַלְכֵּנוּ לַעֲבוֹדָתֶךָ, וְשִׁמְךָ הַגָּדוֹל וְהַקָּדוֹשׁ עָלֵינוּ קָרָאתָ.");

			if (jewishDateInfo.getJewishCalendar().isCholHamoedSuccos()) {
				addToSiddurHighlighted(
					"וַתִּֽתֶּן לָֽנוּ יְהֹוָה אֱלֹהֵֽינוּ בְּאַהֲבָה מוֹעֲדִים לְשִׂמְחָה, חַגִּים וּזְמַנִּים לְשָׂשׂוֹן, אֶת יוֹם חַג הַסֻּכּוֹת הַזֶּה, אֶת יוֹם מִקְרָא קֹֽדֶשׁ הַזֶּה, זְמַן שִׂמְחָתֵֽנוּ בְּאַהֲבָה מִקְרָא קֹֽדֶשׁ זֵֽכֶר לִיצִיאַת מִצְרָֽיִם.");
			} else {
				addToSiddurHighlighted(
					"וַתִּֽתֶּן לָֽנוּ יְהֹוָה אֱלֹהֵֽינוּ בְּאַהֲבָה מוֹעֲדִים לְשִׂמְחָה, חַגִּים וּזְמַנִּים לְשָׂשׂוֹן, אֶת יוֹם חַג הַמַּצּוֹת הַזֶּה, אֶת יוֹם מִקְרָא קֹֽדֶשׁ הַזֶּה, זְמַן חֵרוּתֵנוּ בְּאַהֲבָה מִקְרָא קֹֽדֶשׁ זֵֽכֶר לִיצִיאַת מִצְרָֽיִם.");
			}

			addToSiddur(
				"אֱלֹהֵֽינוּ וֵאלֹהֵי אֲבוֹתֵֽינוּ, מִפְּנֵי חֲטָאֵינוּ גָּלִינוּ מֵאַרְצֵנוּ, וְנִתְרַחַקְנוּ מֵעַל אַדְמָתֵנוּ, וְאֵין אֲנַחְנוּ יְכוֹלִים לַעֲלוֹת וְלֵרָאוֹת וּלְהִשְׁתַּחֲוֹת לְפָנֶיךָ בְּבֵית בְּחִירָתָךְ, בִּנְוֵה הֲדָרָךְ, בַּבַּיִת הַגָּדוֹל וְהַקָּדוֹשׁ שֶׁנִּקְרָא שִׁמְךָ עָלָיו, מִפְּנֵי הַיָּד שֶׁנִּשְׁתַּלְּחָה בְּמִקְדָּשָׁךְ.");

			if (jewishDateInfo.getJewishCalendar().isCholHamoedSuccos()) {
				addToSiddurHighlighted(
					"יְהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, מֶלֶךְ רַחֲמָן, שֶׁתָּשׁוּב וּתְרַחֵם עָלֵינוּ וְעַל מִקְדָּשְׁךָ בְּרַחֲמֶיךָ הָרַבִּים, וְתִבְנֵהוּ מְהֵרָה וּתְגַדֵּל כְּבוֹדוֹ. אָבִינוּ, מַלְכֵּנוּ, אֱלֹהֵינוּ, גַּלֵּה כְּבוֹד מַלְכוּתְךָ עָלֵינוּ מְהֵרָה, וְהוֹפַע וְהִנָּשֵׂא עָלֵינוּ לְעֵינֵי כָל חַי, וְקָרֵב פְּזוּרֵינוּ מִבֵּין הַגּוֹיִם, וּנְפוּצוֹתֵינוּ כַּנֵּס מִיַּרְכְּתֵי אָרֶץ, וַהֲבִיאֵנוּ יְהֹוָה אֱלֹהֵינוּ לְצִיּוֹן עִירָךְ בְּרִנָּה, וְלִירוּשָׁלַיִם עִיר מִקְדָּשְׁךָ בְּשִׂמְחַת עוֹלָם, אָנָּא אֱלֹהֵינוּ, וְשָׁם נַעֲשֶׂה לְפָנֶיךָ אֶת קָרְבְּנוֹת חוֹבוֹתֵינוּ, תְּמִידִים כְּסִדְרָם וּמוּסָפִים כְּהִלְכָתָם. אֶת מוּסָף יוֹם חַג הַסֻּכּוֹת הַזֶּה וְיוֹם מִקְרָא קֹדֶשׁ הַזֶּה, נַעֲשֶׂה וְנַקְרִיב לְפָנֶיךָ בְּאַהֲבָה כְּמִצְוַת רְצוֹנָךְ, כְּמוֹ שֶׁכָּתַבְתָּ עָלֵינוּ בְּתוֹרָתָךְ, עַל יְדֵי מֹשֶׁה עַבְדֶּךָ.");
			} else {
				addToSiddurHighlighted(
					"יְהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, מֶלֶךְ רַחֲמָן, שֶׁתָּשׁוּב וּתְרַחֵם עָלֵינוּ וְעַל מִקְדָּשְׁךָ בְּרַחֲמֶיךָ הָרַבִּים, וְתִבְנֵהוּ מְהֵרָה וּתְגַדֵּל כְּבוֹדוֹ. אָבִינוּ, מַלְכֵּנוּ, אֱלֹהֵינוּ, גַּלֵּה כְּבוֹד מַלְכוּתְךָ עָלֵינוּ מְהֵרָה, וְהוֹפַע וְהִנָּשֵׂא עָלֵינוּ לְעֵינֵי כָל חַי, וְקָרֵב פְּזוּרֵינוּ מִבֵּין הַגּוֹיִם, וּנְפוּצוֹתֵינוּ כַּנֵּס מִיַּרְכְּתֵי אָרֶץ, וַהֲבִיאֵנוּ יְהֹוָה אֱלֹהֵינוּ לְצִיּוֹן עִירָךְ בְּרִנָּה, וְלִירוּשָׁלַיִם עִיר מִקְדָּשְׁךָ בְּשִׂמְחַת עוֹלָם, אָנָּא אֱלֹהֵינוּ, וְשָׁם נַעֲשֶׂה לְפָנֶיךָ אֶת קָרְבְּנוֹת חוֹבוֹתֵינוּ, תְּמִידִים כְּסִדְרָם וּמוּסָפִים כְּהִלְכָתָם. אֶת מוּסָף יוֹם חַג הַמַּצּוֹת הַזֶּה וְיוֹם מִקְרָא קֹדֶשׁ הַזֶּה, נַעֲשֶׂה וְנַקְרִיב לְפָנֶיךָ בְּאַהֲבָה כְּמִצְוַת רְצוֹנָךְ, כְּמוֹ שֶׁכָּתַבְתָּ עָלֵינוּ בְּתוֹרָתָךְ, עַל יְדֵי מֹשֶׁה עַבְדֶּךָ.");
			}

			addToSiddur(
				"אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, מֶלֶךְ רַחֲמָן רַחֵם עָלֵינוּ, טוֹב וּמֵטִיב הִדָּרֶשׁ לָנוּ, שׁוּבָה עָלֵינוּ בַּהֲמוֹן רַחֲמֶיךָ, בִּגְלַל אָבוֹת שֶׁעָשׂוּ רְצוֹנֶךָ, בְּנֵה בֵיתְךָ כְּבַתְּחִלָּה, כּוֹנֵן בֵּית מִקְדָּשְׁךָ עַל מְכוֹנוֹ, הַרְאֵנוּ בְּבִנְיָנוֹ, שַׂמְּחֵנוּ בְּתִקּוּנוֹ, וְהָשֵׁב שְׁכִינָתְךָ לְתוֹכוֹ, וְהָשֵׁב כֹּהֲנִים לַעֲבוֹדָתָם, וּלְוִיִּים לְדוּכָנָם, לְשִׁירָם וּלְזִמְרָם, וְהָשֵׁב יִשְׂרָאֵל לִנְוֵיהֶם. וְשָׁם נַעֲלֶה וְנֵרָאֶה וְנִשְׁתַּחֲוֶה לְפָנֶיךָ בְּשָׁלֹשׁ פַּעֲמֵי רְגָלֵינוּ בְּכָל שָׁנָה וְשָׁנָה, כַּכָּתוּב בַּתּוֹרָה שָׁל֣וֹשׁ פְּעָמִ֣ים ׀ בַּשָּׁנָ֡ה יֵרָאֶ֨ה כׇל־זְכוּרְךָ֜ אֶת־פְּנֵ֣י ׀ יְהֹוָ֣ה אֱלֹהֶ֗יךָ בַּמָּקוֹם֙ אֲשֶׁ֣ר יִבְחָ֔ר בְּחַ֧ג הַמַּצּ֛וֹת וּבְחַ֥ג הַשָּׁבֻע֖וֹת וּבְחַ֣ג הַסֻּכּ֑וֹת וְלֹ֧א יֵרָאֶ֛ה אֶת־פְּנֵ֥י יְהֹוָ֖ה רֵיקָֽם׃ אִ֖ישׁ כְּמַתְּנַ֣ת יָד֑וֹ כְּבִרְכַּ֛ת יְהֹוָ֥ה אֱלֹהֶ֖יךָ אֲשֶׁ֥ר נָֽתַן־לָֽךְ׃ " +
				"וְהַשִּׂיאֵנוּ יְהֹוָה אֱלֹהֵינוּ אֶת בִּרְכַּת מוֹעֲדֶיךָ לְחַיִּים בְּשִׂמְחָה וּבְשָׁלוֹם, כַּאֲשֶׁר רָצִיתָ וְאָמַרְתָּ לְבָרְכֵנוּ כֵּן תְּבָרְכֵנוּ סֶלָה. " +
				"קַדְּשֵׁנוּ בְּמִצְוֹתֶיךָ, שִׂים חֶלְקֵנוּ בְּתוֹרָתָךְ, שַׂבְּעֵנוּ מִטּוּבָךְ, שַׂמֵּחַ נַפְשֵׁנוּ בִּישׁוּעָתָךְ, וְטַהֵר לִבֵּנוּ לְעָבְדְּךָ בֶאֱמֶת, וְהַנְחִילֵנוּ יְהֹוָה אֱלֹהֵינוּ בְּשִׂמְחָה וּבְשָׂשׂוֹן מוֹעֲדֵי קָדְשֶׁךָ, וְיִשְׂמְחוּ בְךָ כָּל יִשְׂרָאֵל מְקַדְּשֵׁי שְׁמֶךָ. בָּרוּךְ אַתָּה יְהֹוָה, מְקַדֵּשׁ יִשְׂרָאֵל וְהַזְּמַנִּים:");
		} else {
			addToSiddur(
				"רָאשֵׁי חֳדָשִׁים לְעַמְּךָ נָתַתָּ, זְמַן כַּפָּרָה לְכָל־תּוֹלְדוֹתָם, בִּהְיוֹתָם מַקְרִיבִים לְפָנֶיךָ זִבְחֵי רָצוֹן, וּשְׂעִיר חַטָּאת לְכַפֵּר בַּעֲדָם, זִכָּרוֹן לְכֻלָּם הָיָה, תְּשׁוּעַת נַפְשָׁם מִיַּד שׂוֹנֵא. מִזְבֵּחַ חָדָשׁ בְּצִיּוֹן תָּכִין, וְעוֹלַת רֹאשׁ חֹדֶשׁ נַעֲלֶה עָלָיו, וּשְׂעִיר עִזִּים נַעֲשֶׂה בְרָצוֹן, וּבַעֲבוֹדַת בֵּית הַמִּקְדָּשׁ נִשְׂמַח כֻּלָּנוּ, וְשִׁירֵי דָּוִד עַבְדָּךְ נִשְׁמַע בְּעִירָךְ הָאֲמוּרִים לִפְנֵי מִזְבָּחָךְ. אַהֲבַת עוֹלָם תָּבִיא לָהֶם, וּבְרִית אָבוֹת לְבָּנִים תִּזְכּוֹר: \n\n" +
				"יְהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, שֶׁתַּעֲלֵנוּ בְשִׂמְחָה לְאַרְצֵנוּ וְתִטָּעֵנוּ בִּגְבוּלֵנוּ, וְשָׁם נַעֲשֶׂה לְפָנֶיךָ אֶת קָרְבְּנוֹת חוֹבוֹתֵינוּ, תְּמִידִים כְּסִדְרָם וּמוּסָפִים כְּהִלְכָתָם. אֶת מוּסַף יוֹם רֹאשׁ הַחֹדֶשׁ הַזֶּה, נַעֲשֶׂה וְנַקְרִיב לְפָנֶיךָ בְּאַהֲבָה כְּמִצְוַת רְצוֹנָךְ, כְּמוֹ שֶׁכָּתַבְתָּ עָלֵינוּ בְּתוֹרָתָךְ עַל יְדֵי מֹשֶׁה עַבְדָּךְ כָּאָמוּר: \n\n" +
				"וּבְרָאשֵׁי֙ חׇדְשֵׁיכֶ֔ם תַּקְרִ֥יבוּ עֹלָ֖ה לַיהֹוָ֑ה פָּרִ֨ים בְּנֵֽי־בָקָ֤ר שְׁנַ֙יִם֙ וְאַ֣יִל אֶחָ֔ד כְּבָשִׂ֧ים בְּנֵי־שָׁנָ֛ה שִׁבְעָ֖ה תְּמִימִֽם׃ וּמִנְחָתָם וְנִסְכֵּיהֶם כַּמְדֻבָּר: שְׁלֹשָׁה עֶשְׂרֹנִים לַפָּר וּשְׁנֵי עֶשְׂרֹנִים לָאַיִל וְעִשָּׂרוֹן לַכֶּבֶשׂ, וְיַיִן כְּנִסְכּוֹ, וְשָׂעִיר לְכַפֵּר, וּשְׁנֵי תְמִידִים כְּהִלְכָתָם:");

			String[] hatima = {
				"אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, חַדֵּשׁ עָלֵינוּ אֶת הַחֹדֶשׁ הַזֶּה לְטוֹבָה וְלִבְרָכָה, לְשָׂשׂוֹן וּלְשִׂמְחָה, לִישׁוּעָה וּלְנֶחָמָה, לְפַרְנָסָה וּלְכַלְכָּלָה, לְחַיִּים טוֹבִים וּלְשָׁלוֹם, לִמְחִילַת חֵטְא, וְלִסְלִיחַת עָוֹן,",
				"וּלְכַפָּרַת פֶּשַׁע.",
				"וְיִהְיֶה רֹאשׁ הַחֹדֶשׁ הַזֶּה סוֹף וָקֵץ לְכָל צָרוֹתֵינוּ, תְּחִלָּה וָרֹאשׁ לְפִדְיוֹן נַפְשֵׁנוּ, כִּי בְעַמְּךָ יִשְׂרָאֵל מִכָּל הָאֻמּוֹת בָּחַרְתָּ, וְחֻקֵּי רָאשֵׁי חֳדָשִׁים לָהֶם קָבָעְתָּ: בָּרוּךְ אַתָּה יוּהוּווּהוּ, מְקַדֵּשׁ יִשְׂרָאֵל וְרָאשֵׁי חֳדָשִׁים:"
			};
			if (jewishDateInfo.getIsUlChaparatPeshaSaid().equals("אומרים וּלְכַפָּרַת פֶּשַׁע")
					|| jewishDateInfo.getIsUlChaparatPeshaSaid().equals("Say וּלְכַפָּרַת פֶּשַׁע")) {
				addToSiddur(hatima[0]);
				addToSiddurHighlighted(hatima[1]);
				addToSiddur(hatima[2]);
			} else {
				addToSiddur(hatima[0] + ". " + hatima[2]);
			}
		}

		addToSiddur(
			"רְצֵה יְהֹוָה אֱלֹהֵֽינוּ בְּעַמְּךָ יִשְׂרָאֵל וְלִתְפִלָּתָם שְׁעֵה, וְהָשֵׁב הָֽעֲבוֹדָה לִדְבִיר בֵּיתֶֽךָ, וְאִשֵּׁי יִשְׂרָאֵל וּתְפִלָּתָם, מְהֵרָה בְּאַֽהֲבָה תְקַבֵּל בְּרָצוֹן, וּתְהִי לְרָצוֹן תָּמִיד עֲבוֹדַת יִשְׂרָאֵל עַמֶּֽךָ: וְאַתָּה בְּרַֽחֲמֶֽיךָ הָרַבִּים, תַּחְפֹּץ בָּֽנוּ וְתִרְצֵֽנוּ, וְתֶֽחֱזֶֽינָה עֵינֵֽינוּ בְּשֽׁוּבְךָ לְצִיּוֹן בְּרַֽחֲמִים: בָּרוּךְ אַתָּה יִהִוִהִ, הַמַּֽחֲזִיר שְׁכִֽינָתוֹ לְצִיּוֹן: \n\n" +
			"מוֹדִים אֲנַֽחְנוּ לָךְ, שֶׁאַתָּה הוּא יְהֹוָה אֱלֹהֵֽינוּ וֵֽאלֹהֵי אֲבוֹתֵֽינוּ לְעוֹלָם וָעֶד, צוּרֵֽנוּ צוּר חַיֵּֽינוּ וּמָגֵן יִשְׁעֵֽנוּ אַתָּה הוּא, לְדוֹר וָדוֹר נוֹדֶה לְךָ וּנְסַפֵּר תְּהִלָּתֶֽךָ, עַל חַיֵּֽינוּ הַמְּסוּרִים בְּיָדֶֽךָ, וְעַל נִשְׁמוֹתֵֽינוּ הַפְּקוּדוֹת לָךְ, וְעַל נִסֶּֽיךָ שֶׁבְּכָל־יוֹם עִמָּֽנוּ, וְעַל נִפְלְאוֹתֶֽיךָ וְטֽוֹבוֹתֶֽיךָ שֶׁבְּכָל־עֵת, עֶֽרֶב וָבֹֽקֶר וְצָֽהֳרָֽיִם. הַטּוֹב, כִּי לֹא כָלוּ רַחֲמֶֽיךָ, הַמְּרַחֵם, כִּי לֹא תַֽמּוּ חֲסָדֶֽיךָ, כִּי מֵֽעוֹלָם קִוִּֽינוּ לָךְ:");

		addToSiddur(lineBreak);
		addToSiddur(
			"בחזרת הש\"ץ כשהחזן אומר מודים, הקהל אומרים: (When the chazzan says modim)\n\n" +
			"מוֹדִים אֲנַחְנוּ לָךְ, שָׁאַתָּה הוּא יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, אֱלֹהֵי כָל בָּשָׁר, יוֹצְרֵנוּ יוֹצֵר בְּרֵאשִׁית. בְּרָכוֹת וְהוֹדָאוֹת לְשִׁמְךָ הַגָּדוֹל וְהַקָּדוֹשׁ, עַל שֶׁהֶחֱיִיתָנוּ וְקִיַּמְתָּנוּ. כֵּן תְּחַיֵּנוּ וּתְחָנֵּנוּ וְתֶאֱסוֹף גָּלֻיּוֹתֵינוּ לְחַצְרוֹת קָדְשֶׁךָ, לִשְׁמֹר חֻקֶּיךָ וְלַעֲשׂוֹת רְצוֹנְךָ וּלְעָבְדְךָ בְלֵבָב שָׁלֵם, עַל שֶׁאֲנַחְנוּ מוֹדִים לָךְ, בָּרוּךְ אֵל הַהוֹדָאוֹת.");
		addToSiddur(lineBreak);

		if (jewishDateInfo.getJewishCalendar().isChanukah()) {
			addToSiddurHighlighted(
				"וְעַל הַנִּסִּים וְעַל הַפֻּרְקָן וְעַל הַגְּבוּרוֹת וְעַל הַתְּשׁוּעוֹת וְעַל הַנִּפְלָאוֹת וְעַל הַנֶּחָמוֹת שֶׁעָשִֽׂיתָ לַאֲבוֹתֵֽינוּ בַּיָּמִים הָהֵם בַּזְּמַן הַזֶּה:\n\n" +
				"בִּימֵי מַתִּתְיָה בֶן־יוֹחָנָן כֹּהֵן גָּדוֹל. חַשְׁמוֹנָאי וּבָנָיו כְּשֶׁעָֽמְדָֽה מַלְכוּת יָוָן הָרְשָׁעָה עַל עַמְּךָ יִשְׂרָאֵל. לְשַׁכְּחָם תּוֹרָתָךְ וּלְהַעֲבִירָם מֵחֻקֵּי רְצוֹנָךְ. וְאַתָּה בְּרַחֲמֶֽיךָ הָרַבִּים עָמַֽדְתָּ לָהֶם בְּעֵת צָרָתָם. רַֽבְתָּ אֶת רִיבָם. דַּֽנְתָּ אֶת דִּינָם. נָקַֽמְתָּ אֶת נִקְמָתָם. מָסַֽרְתָּ גִבּוֹרִים בְּיַד חַלָּשִׁים. וְרַבִּים בְּיַד מְעַטִּים. וּרְשָׁעִים בְּיַד צַדִּיקִים. וּטְמֵאִים בְּיַד טְהוֹרִים. וְזֵדִים בְּיַד עֽוֹסְקֵֽי תוֹרָתֶֽךָ. לְךָ עָשִֽׂיתָ שֵׁם גָּדוֹל וְקָדוֹשׁ בְּעוֹלָמָךְ. וּלְעַמְּךָ יִשְׂרָאֵל עָשִֽׂיתָ תְּשׁוּעָה גְדוֹלָה וּפֻרְקָן כְּהַיּוֹם הַזֶּה. וְאַחַר כָּךְ בָּֽאוּ בָנֶֽיךָ לִדְבִיר בֵּיתֶֽךָ. וּפִנּוּ אֶת־הֵיכָלֶֽךָ. וְטִהֲרוּ אֶת־מִקְדָּשֶֽׁךָ. וְהִדְלִֽיקוּ נֵרוֹת בְּחַצְרוֹת קָדְשֶֽׁךָ. וְקָֽבְעֽוּ שְׁמוֹנַת יְמֵי חֲנֻכָּה אֵֽלּוּ בְּהַלֵּל וּבְהוֹדָאָה. וְעָשִֽׂיתָ עִמָּהֶם נִסִּים וְנִפְלָאוֹת וְנוֹדֶה לְשִׁמְךָ הַגָּדוֹל סֶֽלָה:");
		}

		addToSiddur(
			"וְעַל כֻּלָּם יִתְבָּרַךְ, וְיִתְרוֹמָם, וְיִתְנַשֵּׂא, תָּמִיד, שִׁמְךָ מַלְכֵּֽנוּ, לְעוֹלָם וָעֶד. וְכָל־הַחַיִּים יוֹדֽוּךָ סֶּֽלָה: " +
			"וִֽיהַֽלְלוּ וִֽיבָֽרְכוּ אֶת־שִׁמְךָ הַגָּדוֹל בֶּֽאֱמֶת לְעוֹלָם כִּי טוֹב, הָאֵל יְשֽׁוּעָתֵֽנוּ וְעֶזְרָתֵֽנוּ סֶֽלָה, הָאֵל הַטּוֹב: בָּרוּךְ אַתָּה יֻהֻוֻהֻ, הַטּוֹב שִׁמְךָ וּלְךָ נָאֶה לְהוֹדוֹת:");

		addToSiddur(lineBreak);
		addToSiddur(
			"בחזרת הש\"ץ אומרים ברכת כהנים, אם יש יותר מכהן אחד קורא להם החזן: כֹּהֲנִים: הכהנים מברכים (Cohanim say) :" +
			"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָֽעוֹלָם, אֲשֶׁר קִדְּשָֽׁנוּ בִּקְדֻשָּׁתוֹ שֶׁל־אַֽהֲרֹן, וְצִוָּֽנוּ לְבָרֵךְ אֶת־עַמּוֹ יִשְׂרָאֵל בְּאַֽהֲבָה: הקהל עונים אָמֵן: \n\n" +
			"ואומר החזן והכהנים אחריו מילה במילה: \n\n" +
			"יְבָרֶכְךָ֥ יְהֹוָ֖ה וְיִשְׁמְרֶֽךָ׃ ועונים אָמֵן: \n\n" +
			"יָאֵ֨ר יְהֹוָ֧ה ׀ פָּנָ֛יו אֵלֶ֖יךָ וִֽיחֻנֶּֽךָּ׃ ועונים אָמֵן: \n\n" +
			"יִשָּׂ֨א יְהֹוָ֤ה ׀ פָּנָיו֙ אֵלֶ֔יךָ וְיָשֵׂ֥ם לְךָ֖ שָׁלֽוֹם׃ ועונים אָמֵן: \n\n" +
			"אם אין כהנים אומר החזן: \n\n" +
			"אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, בָּרְכֵנוּ בַּבְּרָכָה הַמְשֻׁלֶּשֶת בַּתּוֹרָה הַכְּתוּבָה עַל יְדֵי מֹשֶׁה עַבְדֶּֽךָ, הָאֲמוּרָה מִפִּי אַהֲרֹן וּבָנָיו הַכֹּהֲנִים עִם קְדוֹשֶׁיךָ כָּאָמוּר: \n\n" +
			"יְבָרֶכְךָ֥ יְהֹוָ֖ה וְיִשְׁמְרֶֽךָ׃ ועונים כֵּן יְהִי רָצוֹן: \n\n" +
			"יָאֵ֨ר יְהֹוָ֧ה ׀ פָּנָ֛יו אֵלֶ֖יךָ וִֽיחֻנֶּֽךָּ׃ ועונים כֵּן יְהִי רָצוֹן: \n\n" +
			"יִשָּׂ֨א יְהֹוָ֤ה ׀ פָּנָיו֙ אֵלֶ֔יךָ וְיָשֵׂ֥ם לְךָ֖ שָׁלֽוֹם׃ ועונים כֵּן יְהִי רָצוֹן: וְשָׂמ֥וּ אֶת־שְׁמִ֖י עַל־בְּנֵ֣י יִשְׂרָאֵ֑ל וַאֲנִ֖י אֲבָרְכֵֽם:");
		addToSiddur(lineBreak);

		addToSiddur(
			"שִׂים שָׁלוֹם טוֹבָה וּבְרָכָה, חַיִּים חֵן וָחֶֽסֶד צְדָקָה וְרַֽחֲמִים, עָלֵֽינוּ וְעַל כָּל־יִשְׂרָאֵל עַמֶּֽךָ. וּבָֽרְכֵֽנוּ אָבִֽינוּ כֻּלָּֽנוּ כְּאֶחָד בְּאוֹר פָּנֶֽיךָ, כִּי בְאוֹר פָּנֶֽיךָ נָתַֽתָּ לָּֽנוּ יְהֹוָה אֱלֹהֵֽינוּ תּוֹרָה וְחַיִּים, אַֽהֲבָה וָחֶֽסֶד, צְדָקָה וְרַֽחֲמִים, בְּרָכָה וְשָׁלוֹם. וְטוֹב בְּעֵינֶֽיךָ לְבָֽרְכֵֽנוּ וּלְבָרֵךְ אֶת־כָּל־עַמְּךָ יִשְׂרָאֵל, בְּרֹב עֹז וְשָׁלוֹם: " +
			"בָּרוּךְ אַתָּה יוּהוּווּהוּ, הַמְּבָרֵךְ אֶת עַמּוֹ יִשְׂרָאֵל בַּשָּׁלוֹם. אָמֵן: \n\n" +
			"יִֽהְי֥וּ לְרָצ֨וֹן ׀ אִמְרֵי־פִ֡י וְהֶגְי֣וֹן לִבִּ֣י לְפָנֶ֑יךָ יְ֝הֹוָ֗ה צוּרִ֥י וְגֹאֲלִֽי׃ \n\n" +
			"אֱלֹהַי, נְצֹר לְשׁוֹנִי מֵרָע וְשִׂפְתוֹתַי מִדַּבֵּר מִרְמָה, וְלִמְקַלְלַי נַפְשִׁי תִדֹּם, וְנַפְשִׁי כֶּֽעָפָר לַכֹּל תִּֽהְיֶה, פְּתַח לִבִּי בְּתוֹרָתֶֽךָ, וְאַחֲרֵי מִצְוֹתֶֽיךָ תִּרְדֹּף נַפְשִׁי. וְכָל־הַקָּמִים עָלַי לְרָעָה, מְהֵרָה הָפֵר עֲצָתָם וְקַלְקֵל מַחְשְׁבוֹתָם. עֲשֵׂה לְמַֽעַן שְׁמָךְ, עֲשֵׂה לְמַֽעַן יְמִינָךְ, עֲשֵׂה לְמַֽעַן תּֽוֹרָתָךְ, עֲשֵׂה לְמַֽעַן קְדֻשָּׁתָךְ. לְ֭מַעַן יֵחָלְצ֣וּן יְדִידֶ֑יךָ הוֹשִׁ֖יעָה יְמִֽינְךָ֣ וַעֲנֵֽנִי: \n\n" +
			"יִֽהְי֥וּ לְרָצ֨וֹן ׀ אִמְרֵי־פִ֡י וְהֶגְי֣וֹן לִבִּ֣י לְפָנֶ֑יךָ יְ֝הֹוָ֗ה צוּרִ֥י וְגֹאֲלִֽי׃\n\nעֹשֶׂה שָׁלוֹם " +
			"בִּמְרוֹמָיו, הוּא בְּרַחֲמָיו יַעֲשֶׂה שָׁלוֹם עָלֵֽינוּ, וְעַל כָּל־עַמּוֹ יִשְׂרָאֵל, וְאִמְרוּ אָמֵן: \n\n" +
			"יְהִי רָצוֹן מִלְּפָנֶֽיךָ, יְהֹוָה אֱלֹהֵֽינוּ וֵֽאלֹהֵי אֲבוֹתֵֽינוּ, שֶׁתִּבְנֶה בֵּית הַמִּקְדָשׁ בִּמְהֵרָה בְיָמֵֽינוּ, וְתֵן חֶלְקֵֽנוּ בְתוֹרָתָךְ לַעֲשׂוֹת חֻקֵּי רְצוֹנָךְ וּלְעָבְדָךְ בְּלֵבָב שָׁלֵם:");

		addToSiddur(
			"יְהִ֤י שֵׁ֣ם יְהֹוָ֣ה מְבֹרָ֑ךְ מֵ֝עַתָּ֗ה וְעַד־עוֹלָֽם׃ מִמִּזְרַח־שֶׁ֥מֶשׁ עַד־מְבוֹא֑וֹ מְ֝הֻלָּ֗ל שֵׁ֣ם יְהֹוָֽה׃ רָ֖ם עַל־כׇּל־גּוֹיִ֥ם ׀ יְהֹוָ֑ה עַ֖ל הַשָּׁמַ֣יִם כְּבוֹדֽוֹ׃ יְהֹוָ֥ה אֲדֹנֵ֑ינוּ מָה־אַדִּ֥יר שִׁ֝מְךָ֗ בְּכׇל־הָאָֽרֶץ׃ \n\n" +
			"ואומר החזן קדיש תתקבל (Chazzan only)");
		addKaddishTitkabal(false);

		if (jewishDateInfo.getJewishCalendar().isCholHamoedPesach()) {
			addToSiddur(
				"הֹד֣וּ לַיהֹוָ֣ה כִּי־ט֑וֹב כִּ֖י לְעוֹלָ֣ם חַסְדּֽוֹ׃ יֹ֭אמְרוּ גְּאוּלֵ֣י יְהֹוָ֑ה אֲשֶׁ֥ר גְּ֝אָלָ֗ם מִיַּד־צָֽר׃ וּֽמֵאֲרָצ֗וֹת קִ֫בְּצָ֥ם מִמִּזְרָ֥ח וּמִֽמַּעֲרָ֑ב מִצָּפ֥וֹן וּמִיָּֽם׃ תָּע֣וּ בַ֭מִּדְבָּר בִּישִׁימ֣וֹן דָּ֑רֶךְ עִ֥יר מ֝וֹשָׁ֗ב לֹ֣א מָצָֽאוּ׃ רְעֵבִ֥ים גַּם־צְמֵאִ֑ים נַ֝פְשָׁ֗ם בָּהֶ֥ם תִּתְעַטָּֽף׃ וַיִּצְעֲק֣וּ אֶל־יְ֭הֹוָה בַּצַּ֣ר לָהֶ֑ם מִ֝מְּצ֥וּקוֹתֵיהֶ֗ם יַצִּילֵֽם׃ וַֽ֭יַּדְרִיכֵם בְּדֶ֣רֶךְ יְשָׁרָ֑ה לָ֝לֶ֗כֶת אֶל־עִ֥יר מוֹשָֽׁב׃ יוֹד֣וּ לַיהֹוָ֣ה חַסְדּ֑וֹ וְ֝נִפְלְאוֹתָ֗יו לִבְנֵ֥י אָדָֽם׃ כִּֽי־הִ֭שְׂבִּיעַ נֶ֣פֶשׁ שֹׁקֵקָ֑ה וְנֶ֥פֶשׁ רְ֝עֵבָ֗ה מִלֵּא־טֽוֹב׃ יֹ֭שְׁבֵי חֹ֣שֶׁךְ וְצַלְמָ֑וֶת אֲסִירֵ֖י עֳנִ֣י וּבַרְזֶֽל׃ כִּֽי־הִמְר֥וּ אִמְרֵי־אֵ֑ל וַעֲצַ֖ת עֶלְי֣וֹן נָאָֽצוּ׃ וַיַּכְנַ֣ע בֶּעָמָ֣ל לִבָּ֑ם כָּ֝שְׁל֗וּ וְאֵ֣ין עֹזֵֽר׃ וַיִּזְעֲק֣וּ אֶל־יְ֭הֹוָה בַּצַּ֣ר לָהֶ֑ם מִ֝מְּצֻ֥קוֹתֵיהֶ֗ם יוֹשִׁיעֵֽם׃ י֭וֹצִיאֵם מֵחֹ֣שֶׁךְ וְצַלְמָ֑וֶת וּמוֹסְר֖וֹתֵיהֶ֣ם יְנַתֵּֽק׃ יוֹד֣וּ לַיהֹוָ֣ה חַסְדּ֑וֹ וְ֝נִפְלְאוֹתָ֗יו לִבְנֵ֥י אָדָֽם׃ כִּֽי־שִׁ֭בַּר דַּלְת֣וֹת נְחֹ֑שֶׁת וּבְרִיחֵ֖י בַרְזֶ֣ל גִּדֵּֽעַ׃ אֱ֭וִלִים מִדֶּ֣רֶךְ פִּשְׁעָ֑ם וּֽ֝מֵעֲוֺ֥נֹתֵיהֶ֗ם יִתְעַנּֽוּ׃ כׇּל־אֹ֭כֶל תְּתַעֵ֣ב נַפְשָׁ֑ם וַ֝יַּגִּ֗יעוּ עַד־שַׁ֥עֲרֵי מָֽוֶת׃ וַיִּזְעֲק֣וּ אֶל־יְ֭הֹוָה בַּצַּ֣ר לָהֶ֑ם מִ֝מְּצֻ֥קוֹתֵיהֶ֗ם יוֹשִׁיעֵֽם׃ יִשְׁלַ֣ח דְּ֭בָרוֹ וְיִרְפָּאֵ֑ם וִ֝ימַלֵּ֗ט מִשְּׁחִֽיתוֹתָֽם׃ יוֹד֣וּ לַיהֹוָ֣ה חַסְדּ֑וֹ וְ֝נִפְלְאוֹתָ֗יו לִבְנֵ֥י אָדָֽם׃ וְ֭יִזְבְּחוּ זִבְחֵ֣י תוֹדָ֑ה וִיסַפְּר֖וּ מַעֲשָׂ֣יו בְּרִנָּֽה׃ יוֹרְדֵ֣י הַ֭יָּם בׇּאֳנִיּ֑וֹת עֹשֵׂ֥י מְ֝לָאכָ֗ה בְּמַ֣יִם רַבִּֽים׃ הֵ֣מָּה רָ֭אוּ מַעֲשֵׂ֣י יְהֹוָ֑ה וְ֝נִפְלְאוֹתָ֗יו בִּמְצוּלָֽה׃ וַיֹּ֗אמֶר וַֽ֭יַּעֲמֵד ר֣וּחַ סְעָרָ֑ה וַתְּרוֹמֵ֥ם גַּלָּֽיו׃ יַעֲל֣וּ שָׁ֭מַיִם יֵרְד֣וּ תְהוֹמ֑וֹת נַ֝פְשָׁ֗ם בְּרָעָ֥ה תִתְמוֹגָֽג׃ יָח֣וֹגּוּ וְ֭יָנוּעוּ כַּשִּׁכּ֑וֹר וְכׇל־חׇ֝כְמָתָ֗ם תִּתְבַּלָּֽע׃ וַיִּצְעֲק֣וּ אֶל־יְ֭הֹוָה בַּצַּ֣ר לָהֶ֑ם וּֽ֝מִמְּצ֥וּקֹתֵיהֶ֗ם יוֹצִיאֵֽם׃ יָקֵ֣ם סְ֭עָרָה לִדְמָמָ֑ה וַ֝יֶּחֱשׁ֗וּ גַּלֵּיהֶֽם׃ וַיִּשְׂמְח֥וּ כִֽי־יִשְׁתֹּ֑קוּ וַ֝יַּנְחֵ֗ם אֶל־מְח֥וֹז חֶפְצָֽם׃ יוֹד֣וּ לַיהֹוָ֣ה חַסְדּ֑וֹ וְ֝נִפְלְאוֹתָ֗יו לִבְנֵ֥י אָדָֽם׃ וִֽ֭ירוֹמְמוּהוּ בִּקְהַל־עָ֑ם וּבְמוֹשַׁ֖ב זְקֵנִ֣ים יְהַלְלֽוּהוּ׃ יָשֵׂ֣ם נְהָר֣וֹת לְמִדְבָּ֑ר וּמֹצָ֥אֵי מַ֗֝יִם לְצִמָּאֽוֹן׃ אֶ֣רֶץ פְּ֭רִי לִמְלֵחָ֑ה מֵ֝רָעַ֗ת י֣וֹשְׁבֵי בָֽהּ׃ יָשֵׂ֣ם מִ֭דְבָּר לַאֲגַם־מַ֑יִם וְאֶ֥רֶץ צִ֝יָּ֗ה לְמֹצָ֥אֵי מָֽיִם׃ וַיּ֣וֹשֶׁב שָׁ֣ם רְעֵבִ֑ים וַ֝יְכוֹנְנ֗וּ עִ֣יר מוֹשָֽׁב׃ וַיִּזְרְע֣וּ שָׂ֭דוֹת וַיִּטְּע֣וּ כְרָמִ֑ים וַ֝יַּעֲשׂ֗וּ פְּרִ֣י תְבוּאָֽה׃ וַיְבָרְכֵ֣ם וַיִּרְבּ֣וּ מְאֹ֑ד וּ֝בְהֶמְתָּ֗ם לֹ֣א יַמְעִֽיט׃ וַיִּמְעֲט֥וּ וַיָּשֹׁ֑חוּ מֵעֹ֖צֶר רָעָ֣ה וְיָגֽוֹן׃ שֹׁפֵ֣ךְ בּ֭וּז עַל־נְדִיבִ֑ים וַ֝יַּתְעֵ֗ם בְּתֹ֣הוּ לֹא־דָֽרֶךְ׃ וַיְשַׂגֵּ֣ב אֶבְי֣וֹן מֵע֑וֹנִי וַיָּ֥שֶׂם כַּ֝צֹּ֗אן מִשְׁפָּחֽוֹת׃ יִרְא֣וּ יְשָׁרִ֣ים וְיִשְׂמָ֑חוּ וְכׇל־עַ֝וְלָ֗ה קָ֣פְצָה פִּֽיהָ׃ מִי־חָכָ֥ם וְיִשְׁמׇר־אֵ֑לֶּה וְ֝יִתְבּוֹנְנ֗וּ חַֽסְדֵ֥י יְהֹוָֽה׃");
		} else if (jewishDateInfo.getJewishCalendar().isCholHamoedSuccos()) {
			addToSiddur(
				"לַמְנַצֵּ֗חַ מַשְׂכִּ֥יל לִבְנֵי־קֹֽרַח׃ כְּאַיָּ֗ל תַּעֲרֹ֥ג עַל־אֲפִֽיקֵי־מָ֑יִם כֵּ֤ן נַפְשִׁ֨י תַעֲרֹ֖ג אֵלֶ֣יךָ אֱלֹהִֽים׃ צָמְאָ֬ה נַפְשִׁ֨י ׀ לֵאלֹהִים֮ לְאֵ֢ל חָ֥י מָתַ֥י אָב֑וֹא וְ֝אֵרָאֶ֗ה פְּנֵ֣י אֱלֹהִֽים׃ הָיְתָה־לִּ֬י דִמְעָתִ֣י לֶ֭חֶם יוֹמָ֣ם וָלָ֑יְלָה בֶּאֱמֹ֥ר אֵלַ֥י כׇּל־הַ֝יּ֗וֹם אַיֵּ֥ה אֱלֹהֶֽיךָ׃ אֵ֤לֶּה אֶזְכְּרָ֨ה ׀ וְאֶשְׁפְּכָ֬ה עָלַ֨י ׀ נַפְשִׁ֗י כִּ֤י אֶעֱבֹ֨ר ׀ בַּסָּךְ֮ אֶדַּדֵּ֗ם עַד־בֵּ֥ית אֱלֹ֫הִ֥ים בְּקוֹל־רִנָּ֥ה וְתוֹדָ֗ה הָמ֥וֹן חוֹגֵֽג׃ מַה־תִּשְׁתּ֬וֹחֲחִ֨י ׀ נַפְשִׁי֮ וַתֶּהֱמִ֢י עָ֫לָ֥י הוֹחִ֣לִי לֵ֭אלֹהִים כִּי־ע֥וֹד אוֹדֶ֗נּוּ יְשׁוּע֥וֹת פָּנָֽיו׃ אֱלֹהַ֗י עָלַי֮ נַפְשִׁ֢י תִשְׁתּ֫וֹחָ֥ח עַל־כֵּ֗ן אֶ֭זְכׇּרְךָ מֵאֶ֣רֶץ יַרְדֵּ֑ן וְ֝חֶרְמוֹנִ֗ים מֵהַ֥ר מִצְעָֽר׃ תְּהוֹם־אֶל־תְּה֣וֹם ק֭וֹרֵא לְק֣וֹל צִנּוֹרֶ֑יךָ כׇּֽל־מִשְׁבָּרֶ֥יךָ וְ֝גַלֶּ֗יךָ עָלַ֥י עָבָֽרוּ׃ יוֹמָ֤ם ׀ יְצַוֶּ֬ה יְהֹוָ֨ה ׀ חַסְדּ֗וֹ וּ֭בַלַּיְלָה שִׁירֹ֣ה עִמִּ֑י תְּ֝פִלָּ֗ה לְאֵ֣ל חַיָּֽי׃ אוֹמְרָ֤ה ׀ לְאֵ֥ל סַלְעִי֮ לָמָ֢ה שְׁכַ֫חְתָּ֥נִי לָֽמָּה־קֹדֵ֥ר אֵלֵ֗ךְ בְּלַ֣חַץ אוֹיֵֽב׃ בְּרֶ֤צַח ׀ בְּֽעַצְמוֹתַ֗י חֵרְפ֥וּנִי צוֹרְרָ֑י בְּאׇמְרָ֥ם אֵלַ֥י כׇּל־הַ֝יּ֗וֹם אַיֵּ֥ה אֱלֹהֶֽיךָ׃ מַה־תִּשְׁתּ֬וֹחֲחִ֨י ׀ נַפְשִׁי֮ וּֽמַה־תֶּהֱמִ֢י עָ֫לָ֥י הוֹחִ֣ילִי לֵ֭אלֹהִים כִּי־ע֣וֹד אוֹדֶ֑נּוּ יְשׁוּעֹ֥ת פָּ֝נַ֗י וֵאלֹהָֽי׃");
		} else {
			addToSiddur(
				"בָּרְכִ֥י נַפְשִׁ֗י אֶת־יְהֹ֫וָ֥ה יְהֹוָ֣ה אֱ֭לֹהַי גָּדַ֣לְתָּ מְּאֹ֑ד ה֖וֹד וְהָדָ֣ר לָבָֽשְׁתָּ׃ עֹֽטֶה־א֭וֹר כַּשַּׂלְמָ֑ה נוֹטֶ֥ה שָׁ֝מַ֗יִם כַּיְרִיעָֽה׃ הַ֥מְקָרֶ֥ה בַמַּ֗יִם עֲֽלִיּ֫וֹתָ֥יו הַשָּׂם־עָבִ֥ים רְכוּב֑וֹ הַֽ֝מְהַלֵּ֗ךְ עַל־כַּנְפֵי־רֽוּחַ׃ עֹשֶׂ֣ה מַלְאָכָ֣יו רוּח֑וֹת מְ֝שָׁרְתָ֗יו אֵ֣שׁ לֹהֵֽט׃ יָֽסַד־אֶ֭רֶץ עַל־מְכוֹנֶ֑יהָ בַּל־תִּ֝מּ֗וֹט עוֹלָ֥ם וָעֶֽד׃ תְּ֭הוֹם כַּלְּב֣וּשׁ כִּסִּית֑וֹ עַל־הָ֝רִ֗ים יַ֖עַמְדוּ מָֽיִם׃ מִן־גַּעֲרָ֣תְךָ֣ יְנוּס֑וּן מִן־ק֥וֹל רַֽ֝עַמְךָ֗ יֵחָפֵזֽוּן׃ יַעֲל֣וּ הָ֭רִים יֵרְד֣וּ בְקָע֑וֹת אֶל־מְ֝ק֗וֹם זֶ֤ה  ׀ יָסַ֬דְתָּ לָהֶֽם׃ גְּֽבוּל־שַׂ֭מְתָּ בַּל־יַעֲבֹר֑וּן בַּל־יְ֝שֻׁב֗וּן לְכַסּ֥וֹת הָאָֽרֶץ׃ הַֽמְשַׁלֵּ֣חַ מַ֭עְיָנִים בַּנְּחָלִ֑ים בֵּ֥ין הָ֝רִ֗ים יְהַלֵּכֽוּן׃ יַ֭שְׁקוּ כׇּל־חַיְת֣וֹ שָׂדָ֑י יִשְׁבְּר֖וּ פְרָאִ֣ים צְמָאָֽם׃ עֲ֭לֵיהֶם עוֹף־הַשָּׁמַ֣יִם יִשְׁכּ֑וֹן מִבֵּ֥ין עֳ֝פָאיִ֗ם יִתְּנוּ־קֽוֹל׃ מַשְׁקֶ֣ה הָ֭רִים מֵעֲלִיּוֹתָ֑יו מִפְּרִ֥י מַ֝עֲשֶׂ֗יךָ תִּשְׂבַּ֥ע הָאָֽרֶץ׃ מַצְמִ֤יחַ חָצִ֨יר  ׀ לַבְּהֵמָ֗ה וְ֭עֵשֶׂב לַעֲבֹדַ֣ת הָאָדָ֑ם לְה֥וֹצִיא לֶ֗֝חֶם מִן־הָאָֽרֶץ׃ וְיַ֤יִן  ׀ יְשַׂמַּ֬ח לְֽבַב־אֱנ֗וֹשׁ לְהַצְהִ֣יל פָּנִ֣ים מִשָּׁ֑מֶן וְ֝לֶ֗חֶם לְֽבַב־אֱנ֥וֹשׁ יִסְעָֽד׃ יִ֭שְׂבְּעוּ עֲצֵ֣י יְהֹוָ֑ה אַֽרְזֵ֥י לְ֝בָנ֗וֹן אֲשֶׁ֣ר נָטָֽע׃ אֲשֶׁר־שָׁ֭ם צִפֳּרִ֣ים יְקַנֵּ֑נוּ חֲ֝סִידָ֗ה בְּרוֹשִׁ֥ים בֵּיתָֽהּ׃ הָרִ֣ים הַ֭גְּבֹהִים לַיְּעֵלִ֑ים סְ֝לָעִ֗ים מַחְסֶ֥ה לַֽשְׁפַנִּֽים׃ עָשָׂ֣ה יָ֭רֵחַ לְמוֹעֲדִ֑ים שֶׁ֝֗מֶשׁ יָדַ֥ע מְבוֹאֽוֹ׃ תָּֽשֶׁת־חֹ֭שֶׁךְ וִ֣יהִי לָ֑יְלָה בּוֹ־תִ֝רְמֹ֗שׂ כׇּל־חַיְתוֹ־יָֽעַר׃ הַ֭כְּפִירִים שֹׁאֲגִ֣ים לַטָּ֑רֶף וּלְבַקֵּ֖שׁ מֵאֵ֣ל אׇכְלָֽם׃ תִּזְרַ֣ח הַ֭שֶּׁמֶשׁ יֵאָסֵפ֑וּן וְאֶל־מְ֝עוֹנֹתָ֗ם יִרְבָּצֽוּן׃ יֵצֵ֣א אָדָ֣ם לְפׇעֳל֑וֹ וְֽלַעֲבֹ֖דָת֣וֹ עֲדֵי־עָֽרֶב׃ מָה־רַבּ֬וּ מַעֲשֶׂ֨יךָ ׀ יְֽהֹוָ֗ה כֻּ֭לָּם בְּחׇכְמָ֣ה עָשִׂ֑יתָ מָלְאָ֥ה הָ֝אָ֗רֶץ קִנְיָנֶֽךָ׃ זֶ֤ה ׀ הַיָּ֥ם גָּדוֹל֮ וּרְחַ֢ב יָ֫דָ֥יִם שָֽׁם־רֶ֭מֶשׂ וְאֵ֣ין מִסְפָּ֑ר חַיּ֥וֹת קְ֝טַנּ֗וֹת עִם־גְּדֹלֽוֹת׃ שָׁ֭ם אֳנִיּ֣וֹת יְהַלֵּכ֑וּן לִ֝וְיָתָ֗ן זֶֽה־יָצַ֥רְתָּ לְשַֽׂחֶק־בּֽוֹ׃ כֻּ֭לָּם אֵלֶ֣יךָ יְשַׂבֵּר֑וּן לָתֵ֖ת אׇכְלָ֣ם בְּעִתּֽוֹ׃ תִּתֵּ֣ן לָ֭הֶם יִלְקֹט֑וּן תִּפְתַּ֥ח יָ֝דְךָ֗ יִשְׂבְּע֥וּן טֽוֹב׃ תַּסְתִּ֥יר פָּנֶיךָ֮ יִֽבָּהֵ֫ל֥וּן תֹּסֵ֣ף ר֭וּחָם יִגְוָע֑וּן וְֽאֶל־עֲפָרָ֥ם יְשׁוּבֽוּן׃ תְּשַׁלַּ֣ח ר֭וּחֲךָ יִבָּרֵא֑וּן וּ֝תְחַדֵּ֗שׁ פְּנֵ֣י אֲדָמָֽה׃ יְהִ֤י כְב֣וֹד יְהֹוָ֣ה לְעוֹלָ֑ם יִשְׂמַ֖ח יְהֹוָ֣ה בְּמַעֲשָֽׂיו׃ הַמַּבִּ֣יט לָ֭אָרֶץ וַתִּרְעָ֑ד יִגַּ֖ע בֶּהָרִ֣ים וְֽיֶעֱשָֽׁנוּ׃ אָשִׁ֣ירָה לַיהֹוָ֣ה בְּחַיָּ֑י אֲזַמְּרָ֖ה לֵאלֹהַ֣י בְּעוֹדִֽי׃ יֶעֱרַ֣ב עָלָ֣יו שִׂיחִ֑י אָ֝נֹכִ֗י אֶשְׂמַ֥ח בַּיהֹוָֽה׃ יִתַּ֤מּוּ חַטָּאִ֨ים ׀ מִן־הָאָ֡רֶץ וּרְשָׁעִ֤ים ׀ ע֤וֹד אֵינָ֗ם בָּרְכִ֣י נַ֭פְשִׁי אֶת־יְהֹוָ֗ה הַֽלְלוּיָֽהּ׃");
			if (jewishDateInfo.getJewishCalendar().isChanukah()) {
				addToSiddurHighlighted(
					"מִזְמ֡וֹר שִׁיר־חֲנֻכַּ֖ת הַבַּ֣יִת לְדָוִֽד׃ אֲרוֹמִמְךָ֣ יְ֭הֹוָה כִּ֣י דִלִּיתָ֑נִי וְלֹֽא־שִׂמַּ֖חְתָּ אֹיְבַ֣י לִֽי׃ יְהֹוָ֥ה אֱלֹהָ֑י שִׁוַּ֥עְתִּי אֵ֝לֶ֗יךָ וַתִּרְפָּאֵֽנִי׃ יְֽהֹוָ֗ה הֶעֱלִ֣יתָ מִן־שְׁא֣וֹל נַפְשִׁ֑י חִ֝יִּיתַ֗נִי מִיׇּֽרְדִי־בֽוֹר׃ זַמְּר֣וּ לַיהֹוָ֣ה חֲסִידָ֑יו וְ֝הוֹד֗וּ לְזֵ֣כֶר קׇדְשֽׁוֹ׃ כִּ֤י רֶ֨גַע ׀ בְּאַפּוֹ֮ חַיִּ֢ים בִּרְצ֫וֹנ֥וֹבָּ֭עֶרֶב יָלִ֥ין בֶּ֗כִי וְלַבֹּ֥קֶר רִנָּֽה׃ וַ֭אֲנִי אָמַ֣רְתִּי בְשַׁלְוִ֑י בַּל־אֶמּ֥וֹט לְעוֹלָֽם׃ יְֽהֹוָ֗ה בִּרְצוֹנְךָ֮ הֶעֱמַ֢דְתָּה לְֽהַרְרִ֫י עֹ֥ז הִסְתַּ֥רְתָּ פָנֶ֗יךָ הָיִ֥יתִי נִבְהָֽל׃ אֵלֶ֣יךָ יְהֹוָ֣ה אֶקְרָ֑א וְאֶל־אֲ֝דֹנָ֗י אֶתְחַנָּֽן׃ מַה־בֶּ֥צַע בְּדָמִי֮ בְּרִדְתִּ֢י אֶ֫ל שָׁ֥חַת הֲיוֹדְךָ֥ עָפָ֑ר הֲיַגִּ֥יד אֲמִתֶּֽךָ׃ שְׁמַע־יְהֹוָ֥ה וְחׇנֵּ֑נִי יְ֝הֹוָ֗ה הֱֽיֵה־עֹזֵ֥ר לִֽי׃ הָפַ֣כְתָּ מִסְפְּדִי֮ לְמָח֢וֹל לִ֥י פִּתַּ֥חְתָּ שַׂקִּ֑י וַֽתְּאַזְּרֵ֥נִי שִׂמְחָֽה׃ לְמַ֤עַן ׀ יְזַמֶּרְךָ֣ כָ֭בוֹד וְלֹ֣א יִדֹּ֑ם (יפסיק מעט/break) יְהֹוָ֥ה אֱ֝לֹהַ֗י לְעוֹלָ֥ם אוֹדֶֽךָּ׃");
			}
		}

		addKaddishYeheShelama();

		addToSiddur(
			"קַוֵּ֗ה אֶל־יְהֹ֫וָ֥ה חֲ֭זַק וְיַאֲמֵ֣ץ לִבֶּ֑ךָ וְ֝קַוֵּ֗ה אֶל־יְהֹוָֽה: אֵין־קָד֥וֹשׁ כַּיהֹוָ֖ה כִּ֣י אֵ֣ין בִּלְתֶּ֑ךָ וְאֵ֥ין צ֖וּר כֵּאלֹהֵֽינוּ׃ כִּ֤י מִ֣י אֱ֭לוֹהַּ מִבַּלְעֲדֵ֣י יְהֹוָ֑ה וּמִ֥י צ֝֗וּר זוּלָתִ֥י אֱלֹהֵֽינוּ׃ \n\n" +
			"אֵין כֵּאלֹהֵֽינוּ, אֵין כַּאדוֹנֵֽנוּ, אֵין כְּמַלְכֵּֽנוּ, אֵין כְּמוֹשִׁיעֵֽנוּ: מִי כֵּאלֹהֵֽינוּ, מִי כַּאדוֹנֵֽנוּ, מִי כְּמַלְכֵּֽנוּ, מִי כְּמוֹשִׁיעֵֽנוּ: נוֹדֶה לֵאלֹהֵֽינוּ, נוֹדֶה לַאדוֹנֵֽנוּ, נוֹדֶה לְמַלְכֵּֽנוּ, נוֹדֶה לְמוֹשִׁיעֵֽנוּ: בָּרוּךְ אֱלֹהֵֽינוּ, בָּרוּךְ אֲדוֹנֵֽנוּ, בָּרוּךְ מַלְכֵּֽנוּ, בָּרוּךְ מוֹשִׁיעֵֽנוּ: אַתָּה הוּא אֱלֹהֵֽינוּ, אַתָּה הוּא אֲדוֹנֵֽנוּ, אַתָּה הוּא מַלְכֵּֽנוּ, אַתָּה הוּא מוֹשִׁיעֵֽנוּ: אַתָּה תוֹשִׁיעֵֽנוּ, אַתָּ֣ה תָ֭קוּם תְּרַחֵ֣ם צִיּ֑וֹן כִּי־עֵ֥ת לְ֝חֶֽנְנָ֗הּ כִּי־בָ֥א מוֹעֵֽד:");

		addPitumHaketoret();
		addToSiddur(
			"תָּנָא דְבֵי אֵלִיָּהוּ, כָּל־הַשּׁוֹנֶה הֲלָכוֹת בְּכָל־יוֹם, מֻבְטָח לוֹ שֶׁהוּא בֶן־הָעוֹלָם הַבָּא, שֶׁנֶּאֱמַר הֲלִיכ֥וֹת עוֹלָ֖ם לֽוֹ׃ אַל־תִּקְרֵי הֲלִיכוֹת, אֶלָּא הֲלָכוֹת. אָמַר רִבִּי אֶלְעָזָר אָמַר רִבִּי חֲנִינָא תַּלְמִידֵי חֲכָמִים מַרְבִּים שָׁלוֹם בָּעוֹלָם, שֶׁנֶּאֱמַר וְכׇל־בָּנַ֖יִךְ לִמּוּדֵ֣י יְהֹוָ֑ה וְרַ֖ב שְׁל֥וֹם בָּנָֽיִךְ׃ אַל־תִּקְרֵי בָנָֽיִךְ אֶלָּא בוֹנָֽיִךְ: יְהִי־שָׁל֥וֹם בְּחֵילֵ֑ךְ שַׁ֝לְוָ֗ה בְּאַרְמְנוֹתָֽיִךְ׃ לְ֭מַעַן אַחַ֣י וְרֵעָ֑י אֲדַבְּרָה־נָּ֖א שָׁל֣וֹם בָּֽךְ׃ לְ֭מַעַן בֵּית־יְהֹוָ֣ה אֱלֹהֵ֑ינוּ אֲבַקְשָׁ֖ה ט֣וֹב לָֽךְ׃ וּרְאֵֽה־בָנִ֥ים לְבָנֶ֑יךָ שָׁ֝ל֗וֹם עַל־יִשְׂרָאֵֽל׃ שָׁל֣וֹם רָ֭ב לְאֹהֲבֵ֣י תוֹרָתֶ֑ךָ וְאֵֽין־לָ֥מוֹ מִכְשֽׁוֹל׃ יְֽהֹוָ֗ה עֹ֭ז לְעַמּ֣וֹ יִתֵּ֑ן יְהֹוָ֓ה ׀ יְבָרֵ֖ךְ אֶת־עַמּ֣וֹ בַשָּׁלֽוֹם׃ \n\n" +
			"ואומרים כאן קדיש \"על ישראל\" (Kaddish Al Yisrael is said here)");
		addKaddishAlYisrael();
		addBarchu(true);
		addAlenu();

		return siddur;
	}

	public ArrayList<HighlightString> getMinchaPrayers() {
		siddur = new ArrayList<>();
		if (jewishDateInfo.getJewishCalendar().isAssurBemelacha()) {
			addToSiddur("Shabbat and Yom Tov are currently not supported/שבת ויום טוב כרגע אינם נתמכים");
			addToSiddurHighlighted("Open Sefaria Siddur/פתח את סידור ספריה");
			return siddur;
		}

		addPatachEliyahu();

		if (jewishDateInfo.getJewishCalendar().isTaanis()
				&& jewishDateInfo.getJewishCalendar().getYomTovIndex() != JewishCalendar.YOM_KIPPUR) {
			addToSiddurHighlighted("Some communities put on their talit/tefilin for mincha today/קהילות מסוימות הולכות עם הטלית והתפילין למנחה היום.");
		}

		if (jewishDateInfo.getJewishCalendar().getYomTovIndex() == JewishCalendar.EREV_ROSH_HASHANA) {
			addToSiddurHighlighted("ויזהרו בתפלת מנחה של ערב ראש השנה כי היא תפלה האחרונה (של אותה השנה):/Be cautious with the Mincha prayer of Erev Rosh Hashanah, as it is the final prayer (of that year) (בן איש חי הלכות שנה א, נצבים, ב׳)");
		}

		addToSiddur(
			"לַמְנַצֵּ֥חַ עַֽל־הַגִּתִּ֑ית לִבְנֵי־קֹ֥רַח מִזְמֽוֹר׃ מַה־יְּדִיד֥וֹת מִשְׁכְּנוֹתֶ֗יךָ יְהֹוָ֥ה צְבָאֽוֹת׃ נִכְסְפָ֬ה וְגַם־כָּֽלְתָ֨ה ׀ נַפְשִׁי֮ לְחַצְר֢וֹת יְהֹ֫וָ֥ה לִבִּ֥י וּבְשָׂרִ֑י יְ֝רַנְּנ֗וּ אֶ֣ל אֵֽל־חָֽי׃ גַּם־צִפּ֨וֹר מָ֪צְאָה בַ֡יִת וּדְר֤וֹר ׀ קֵ֥ן לָהּ֮ אֲשֶׁר־שָׁ֢תָה אֶפְרֹ֫חֶ֥יהָ אֶֽת־מִ֭זְבְּחוֹתֶיךָ יְהֹוָ֣ה צְבָא֑וֹת מַ֝לְכִּ֗י וֵאלֹהָֽי׃ אַ֭שְׁרֵי יוֹשְׁבֵ֣י בֵיתֶ֑ךָ ע֗֝וֹד יְֽהַלְל֥וּךָ סֶּֽלָה׃ אַשְׁרֵ֣י אָ֭דָם עֽוֹז־ל֥וֹ בָ֑ךְ מְ֝סִלּ֗וֹת בִּלְבָבָֽם׃ עֹבְרֵ֤י ׀ בְּעֵ֣מֶק הַ֭בָּכָא מַעְיָ֣ן יְשִׁית֑וּהוּ גַּם־בְּ֝רָכ֗וֹת יַעְטֶ֥ה מוֹרֶֽה׃ יֵ֭לְכוּ מֵחַ֣יִל אֶל־חָ֑יִל יֵרָאֶ֖ה אֶל־אֱלֹהִ֣ים בְּצִיּֽוֹן׃ יְהֹ֘וָ֤ה אֱלֹהִ֣ים צְ֭בָאוֹת שִׁמְעָ֣ה תְפִלָּתִ֑י הַאֲזִ֨ינָה אֱלֹהֵ֖י יַעֲקֹ֣ב סֶֽלָה׃ מָ֭גִנֵּנוּ רְאֵ֣ה אֱלֹהִ֑ים וְ֝הַבֵּ֗ט פְּנֵ֣י מְשִׁיחֶֽךָ׃ כִּ֤י טֽוֹב־י֥וֹם בַּחֲצֵרֶ֗יךָ מֵ֫אָ֥לֶף בָּחַ֗רְתִּי הִ֭סְתּוֹפֵף בְּבֵ֣ית אֱלֹהַ֑י מִ֝דּ֗וּר בְּאׇהֳלֵי־רֶֽשַׁע׃ כִּ֤י שֶׁ֨מֶשׁ ׀ וּמָגֵן֮ יְהֹוָ֢ה אֱלֹ֫הִ֥ים חֵ֣ן וְ֭כָבוֹד יִתֵּ֣ן יְהֹוָ֑ה לֹ֥א יִמְנַע־ט֗֝וֹב לַֽהֹלְכִ֥ים בְּתָמִֽים׃ יְהֹוָ֥ה צְבָא֑וֹת אַֽשְׁרֵ֥י אָ֝דָ֗ם בֹּטֵ֥חַ בָּֽךְ׃ \n\n" +
			"וַיְדַבֵּ֥ר יְהֹוָ֖ה אֶל־מֹשֶׁ֥ה לֵּאמֹֽר׃ צַ֚ו אֶת־בְּנֵ֣י יִשְׂרָאֵ֔ל וְאָמַרְתָּ֖ אֲלֵהֶ֑ם אֶת־קׇרְבָּנִ֨י לַחְמִ֜י לְאִשַּׁ֗י רֵ֚יחַ נִֽיחֹחִ֔י תִּשְׁמְר֕וּ לְהַקְרִ֥יב לִ֖י בְּמוֹעֲדֽוֹ׃ וְאָמַרְתָּ֣ לָהֶ֔ם זֶ֚ה הָֽאִשֶּׁ֔ה אֲשֶׁ֥ר תַּקְרִ֖יבוּ לַיהֹוָ֑ה כְּבָשִׂ֨ים בְּנֵֽי־שָׁנָ֧ה תְמִימִ֛ם שְׁנַ֥יִם לַיּ֖וֹם עֹלָ֥ה תָמִֽיד׃ אֶת־הַכֶּ֥בֶשׂ אֶחָ֖ד תַּעֲשֶׂ֣ה בַבֹּ֑קֶר וְאֵת֙ הַכֶּ֣בֶשׂ הַשֵּׁנִ֔י תַּעֲשֶׂ֖ה בֵּ֥ין הָֽעַרְבָּֽיִם׃ וַעֲשִׂירִ֧ית הָאֵיפָ֛ה סֹ֖לֶת לְמִנְחָ֑ה בְּלוּלָ֛ה בְּשֶׁ֥מֶן כָּתִ֖ית רְבִיעִ֥ת הַהִֽין׃ עֹלַ֖ת תָּמִ֑יד הָעֲשֻׂיָה֙ בְּהַ֣ר סִינַ֔י לְרֵ֣יחַ נִיחֹ֔חַ אִשֶּׁ֖ה לַֽיהֹוָֽה׃ וְנִסְכּוֹ֙ רְבִיעִ֣ת הַהִ֔ין לַכֶּ֖בֶשׂ הָאֶחָ֑ד בַּקֹּ֗דֶשׁ הַסֵּ֛ךְ נֶ֥סֶךְ שֵׁכָ֖ר לַיהֹוָֽה׃ וְאֵת֙ הַכֶּ֣בֶשׂ הַשֵּׁנִ֔י תַּעֲשֶׂ֖ה בֵּ֣ין הָֽעַרְבָּ֑יִם כְּמִנְחַ֨ת הַבֹּ֤קֶר וּכְנִסְכּוֹ֙ תַּעֲשֶׂ֔ה אִשֵּׁ֛ה רֵ֥יחַ נִיחֹ֖חַ לַיהֹוָֽה׃");
		addPitumHaketoret();
		addCategoryToSiddur("אשרי");
		addToSiddur(
			"אַ֭שְׁרֵי יוֹשְׁבֵ֣י בֵיתֶ֑ךָ ע֝֗וֹד יְֽהַלְל֥וּךָ סֶּֽלָה: אַשְׁרֵ֣י הָ֭עָם שֶׁכָּ֣כָה לּ֑וֹ אַֽשְׁרֵ֥י הָ֝עָ֗ם שֱׁיְהֹוָ֥ה אֱלֹהָֽיו: \n" +
			"תְּהִלָּ֗ה לְדָ֫וִ֥ד אֲרוֹמִמְךָ֣ אֱלוֹהַ֣י הַמֶּ֑לֶךְ וַאֲבָרְכָ֥ה שִׁ֝מְךָ֗ לְעוֹלָ֥ם וָעֶֽד׃ בְּכָל־י֥וֹם אֲבָֽרְכֶ֑ךָּ וַאֲהַֽלְלָ֥ה שִׁ֝מְךָ֗ לְעוֹלָ֥ם וָעֶֽד׃ גָּ֘ד֤וֹל יְהֹוָ֣ה וּמְהֻלָּ֣ל מְאֹ֑ד וְ֝לִגְדֻלָּת֗וֹ אֵ֣ין חֵֽקֶר׃ דּ֣וֹר לְ֭דוֹר יְשַׁבַּ֣ח מַעֲשֶׂ֑יךָ וּגְב֖וּרֹתֶ֣יךָ יַגִּֽידוּ׃ הֲ֭דַר כְּב֣וֹד הוֹדֶ֑ךָ וְדִבְרֵ֖י נִפְלְאֹתֶ֣יךָ אָשִֽׂיחָה׃ וֶעֱז֣וּז נֽוֹרְאֹתֶ֣יךָ יֹאמֵ֑רוּ וּגְדֻלָּתְךָ֥ אֲסַפְּרֶֽנָּה׃ זֵ֣כֶר רַב־טוּבְךָ֣ יַבִּ֑יעוּ וְצִדְקָתְךָ֥ יְרַנֵּֽנוּ׃ חַנּ֣וּן וְרַח֣וּם יְהֹוָ֑ה אֶ֥רֶךְ אַ֝פַּ֗יִם וּגְדׇל־חָֽסֶד׃ טוֹב־יְהֹוָ֥ה לַכֹּ֑ל וְ֝רַחֲמָ֗יו עַל־כׇּל־מַעֲשָֽׂיו׃ יוֹד֣וּךָ יְ֭הֹוָה כׇּל־מַעֲשֶׂ֑יךָ וַ֝חֲסִידֶ֗יךָ יְבָרְכֽוּכָה׃ כְּב֣וֹד מַלְכוּתְךָ֣ יֹאמֵ֑רוּ וּגְבוּרָתְךָ֥ יְדַבֵּֽרוּ׃ לְהוֹדִ֤יעַ ׀ לִבְנֵ֣י הָ֭אָדָם גְּבוּרֹתָ֑יו וּ֝כְב֗וֹד הֲדַ֣ר מַלְכוּתֽוֹ׃ מַֽלְכוּתְךָ֗ מַלְכ֥וּת כׇּל־עֹלָמִ֑ים וּ֝מֶֽמְשַׁלְתְּךָ֗ בְּכׇל־דּ֥וֹר וָדֹֽר׃ סוֹמֵ֣ךְ יְ֭הֹוָה לְכׇל־הַנֹּפְלִ֑ים וְ֝זוֹקֵ֗ף לְכׇל־הַכְּפוּפִֽים׃ עֵֽינֵי־כֹ֭ל אֵלֶ֣יךָ יְשַׂבֵּ֑רוּ וְאַתָּ֤ה נֽוֹתֵן־לָהֶ֖ם אֶת־אׇכְלָ֣ם בְּעִתּֽוֹ׃ פּוֹתֵ֥חַ אֶת־יָדֶ֑ךָ וּמַשְׂבִּ֖יעַ לְכׇל־חַ֣י רָצֽוֹן׃ צַדִּ֣יק יְ֭הֹוָה בְּכׇל־דְּרָכָ֑יו וְ֝חָסִ֗יד בְּכׇל־מַעֲשָֽׂיו׃ קָר֣וֹב יְ֭הֹוָה לְכׇל־קֹרְאָ֑יו לְכֹ֤ל אֲשֶׁ֖ר יִקְרָאֻ֣הוּ בֶֽאֱמֶֽת׃ רְצוֹן־יְרֵאָ֥יו יַעֲשֶׂ֑ה וְֽאֶת־שַׁוְעָתָ֥ם יִ֝שְׁמַ֗ע וְיוֹשִׁיעֵֽם׃ שׁוֹמֵ֣ר יְ֭הֹוָה אֶת־כׇּל־אֹהֲבָ֑יו וְאֵ֖ת כׇּל־הָרְשָׁעִ֣ים יַשְׁמִֽיד׃ תְּהִלַּ֥ת יְהֹוָ֗ה יְֽדַבֶּ֫ר פִּ֥י וִיבָרֵ֣ךְ כׇּל־בָּ֭שָׂר שֵׁ֥ם קׇדְשׁ֗וֹ לְעוֹלָ֥ם וָעֶֽד׃ וַאֲנַ֤חְנוּ ׀ נְבָ֘רֵ֤ךְ יָ֗הּ מֵעַתָּ֥ה וְעַד־עוֹלָ֗ם הַֽלְלוּיָֽהּ׃"); // Ashrei

		if (jewishDateInfo.getJewishCalendar().isTaanis() && !jewishDateInfo.getJewishCalendar().isYomKippur()) {
			addHalfKaddish(false);
			addCategoryToSiddur("קריאה לתענית");
			addToSiddur(
				"יְהִ֨י יְהֹוָ֤ה אֱלֹהֵ֙ינוּ֙ עִמָּ֔נוּ כַּאֲשֶׁ֥ר הָיָ֖ה עִם־אֲבֹתֵ֑ינוּ אַל־יַעַזְבֵ֖נוּ וְאַֽל־יִטְּשֵֽׁנוּ׃ הוֹשִׁ֤יעָה ׀ אֶת־עַמֶּ֗ךָ וּבָרֵ֥ךְ אֶת־נַחֲלָתֶ֑ךָ וּֽרְעֵ֥ם וְ֝נַשְּׂאֵ֗ם עַד־הָעוֹלָֽם׃ בַּֽ֭עֲבוּר דָּוִ֣ד עַבְדֶּ֑ךָ אַל־תָּ֝שֵׁ֗ב פְּנֵ֣י מְשִׁיחֶֽךָ׃");
			addToSiddur(
				"שמוציאים ספר תורה אומרים (When they take out the sefer torah) \n\n" +
				"בָּרוּךְ הַמָּקוֹם שֶׁנָּתַן תּוֹרָה לְעַמּוֹ יִשְׂרָאֵל, בָּרוּךְ הוּא: אַשְׁרֵ֣י הָ֭עָם שֶׁכָּ֣כָה לּ֑וֹ אַֽשְׁרֵ֥י הָ֝עָ֗ם שֱׁיְהֹוָ֥ה אֱלֹהָֽיו׃ גַּדְּל֣וּ לַיהֹוָ֣ה אִתִּ֑י וּנְרוֹמְמָ֖ה שְׁמ֣וֹ יַחְדָּֽו׃ רוֹמְמ֡וּ יְהֹ֘וָ֤ה אֱלֹהֵ֗ינוּ וְֽ֭הִשְׁתַּחֲווּ לַהֲדֹ֥ם רַגְלָ֗יו קָד֥וֹשׁ הֽוּא׃ רוֹמְמ֡וּ יְהֹ֘וָ֤ה אֱלֹהֵ֗ינוּ וְֽ֭הִשְׁתַּחֲווּ לְהַ֣ר קׇדְשׁ֑וֹ כִּי־קָ֝ד֗וֹשׁ יְהֹוָ֥ה אֱלֹהֵֽינוּ׃ אֵין־קָד֥וֹשׁ כַּיהֹוָ֖ה כִּ֣י אֵ֣ין בִּלְתֶּ֑ךָ וְאֵ֥ין צ֖וּר כֵּאלֹהֵֽינוּ׃ כִּ֤י מִ֣י אֱ֭לוֹהַּ מִבַּלְעֲדֵ֣י יְהֹוָ֑ה וּמִ֥י צ֝֗וּר זוּלָתִ֥י אֱלֹהֵֽינוּ׃ תּוֹרָ֥ה צִוָּה־לָ֖נוּ מֹשֶׁ֑ה מוֹרָשָׁ֖ה קְהִלַּ֥ת יַעֲקֹֽב׃ עֵץ־חַיִּ֣ים הִ֭יא לַמַּחֲזִיקִ֣ים בָּ֑הּ וְֽתֹמְכֶ֥יהָ מְאֻשָּֽׁר׃ דְּרָכֶ֥יהָ דַרְכֵי־נֹ֑עַם וְֽכׇל־נְתִ֖יבוֹתֶ֣יהָ שָׁלֽוֹם׃ שָׁל֣וֹם רָ֭ב לְאֹהֲבֵ֣י תוֹרָתֶ֑ךָ וְאֵֽין־לָ֥מוֹ מִכְשֽׁוֹל׃ יְֽהֹוָ֗ה עֹ֭ז לְעַמּ֣וֹ יִתֵּ֑ן יְהֹוָ֓ה ׀ יְבָרֵ֖ךְ אֶת־עַמּ֣וֹ בַשָּׁלֽוֹם׃");
			addToSiddur(
				"כשמגיע לדוכן, מגביה את ספר התורה ומראה הכתב לקהל ואומרים (When it reaches the platform, raise the torah for everyone to see and say) \n\n" +
				"וְזֹ֖את הַתּוֹרָ֑ה אֲשֶׁר־שָׂ֣ם מֹשֶׁ֔ה לִפְנֵ֖י בְּנֵ֥י יִשְׂרָאֵֽל׃ תּוֹרָ֥ה צִוָּה־לָ֖נוּ מֹשֶׁ֑ה מוֹרָשָׁ֖ה קְהִלַּ֥ת יַעֲקֹֽב׃ הָאֵל֮ תָּמִ֢ים דַּ֫רְכּ֥וֹ אִמְרַֽת־יְהֹוָ֥ה צְרוּפָ֑ה מָגֵ֥ן ה֝֗וּא לְכֹ֤ל ׀ הַחֹסִ֬ים בּֽוֹ׃ \n\n" +
				"ואומר העולה: הַשֵּׁם עִמָּכֶם: \n\n" +
				"ועונים הקהל: יְבָרֶכְךָ הַשֵּׁם: \n\n" +
				"ואומר העולה: בָּרְכוּ אֶת יְהֹוָה הַמְּבֹרָךְ: \n\n" +
				"ועונים הקהל: בָּרוּךְ יְהֹוָה הַמְּבֹרָךְ לְעוֹלָם וָעֶד: \n\n" +
				"וחוזר העולה: בָּרוּךְ יְהֹוָה הַמְּבֹרָךְ לְעוֹלָם וָעֶד: \n\n" +
				"ומברך העולה לפני הקריאה \n\n" +
				"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ  מֶלֶךְ הָעוֹלָם, אֲשֶׁר בָּחַר בָּנוּ מִכָּל הָעַמִּים וְנָתַן לָנוּ אֶת תּוֹרָתוֹ. בָּרוּךְ אַתָּה יְהֹוָה, נוֹתֵן הַתּוֹרָה: [אמן] \n\n" +
				"אחר הקריאה מברך העולה \n\n" +
				"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ  מֶלֶךְ הָעוֹלָם, אֲשֶׁר נָתַן לָנוּ אֶת תּוֹרָתוֹ תּוֹרַת אֱמֶת, וְחַיֵּי עוֹלָם נָטַע בְּתוֹכֵנוּ. בָּרוּךְ אַתָּה יְהֹוָה, נוֹתֵן הַתּוֹרָה: [אמן] \n\n" +
				"מוציאים ספר תורה וקוראים ג' עולים (Three people go up for Aliya)\n\n" +
				WeeklyParashaReadings.getWeeklyParashaReading(
						jewishDateInfo.getJewishCalendar().getUpcomingParshah(),
						jewishDateInfo.getJewishCalendar(),
						false));
			if (jewishDateInfo.getJewishCalendar().isTishaBav()) {
				addToSiddurHighlighted("אין אומרים חצי קדיש (Do NOT say Half Kaddish here)");
				addToSiddurHighlighted(
					"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר בָּחַר בִּנְבִיאִים טוֹבִים וְרָצָה בְדִבְרֵיהֶם הַנֶּאֱמָרִים בֶּאֱמֶת. בָּרוּךְ אַתָּה יְהֹוָה, הַבּוֹחֵר בַּתּוֹרָה וּבְמֹשֶׁה עַבְדּוֹ, וּבְיִשְׂרָאֵל עַמּוֹ וּבִנְבִיאֵי הָאֱמֶת וְהַצֶּדֶק:");
				addToSiddurHighlighted(
					"שׁ֚וּבָה יִשְׂרָאֵ֔ל עַ֖ד יְהֹוָ֣ה אֱלֹהֶ֑יךָ כִּ֥י כָשַׁ֖לְתָּ בַּעֲוֺנֶֽךָ׃ \n" +
					"קְח֤וּ עִמָּכֶם֙ דְּבָרִ֔ים וְשׁ֖וּבוּ אֶל־יְהֹוָ֑ה אִמְר֣וּ אֵלָ֗יו כׇּל־תִּשָּׂ֤א עָוֺן֙ וְקַח־ט֔וֹב וּֽנְשַׁלְּמָ֥ה פָרִ֖ים שְׂפָתֵֽינוּ׃ \n" +
					"אַשּׁ֣וּר ׀ לֹ֣א יוֹשִׁיעֵ֗נוּ עַל־סוּס֙ לֹ֣א נִרְכָּ֔ב וְלֹא־נֹ֥אמַר ע֛וֹד אֱלֹהֵ֖ינוּ לְמַעֲשֵׂ֣ה יָדֵ֑ינוּ אֲשֶׁר־בְּךָ֖ יְרֻחַ֥ם יָתֽוֹם׃ \n" +
					"אֶרְפָּא֙ מְשׁ֣וּבָתָ֔ם אֹהֲבֵ֖ם נְדָבָ֑ה כִּ֛י שָׁ֥ב אַפִּ֖י מִמֶּֽנּוּ׃ \n" +
					"אֶהְיֶ֤ה כַטַּל֙ לְיִשְׂרָאֵ֔ל יִפְרַ֖ח כַּשּׁוֹשַׁנָּ֑ה וְיַ֥ךְ שׇׁרָשָׁ֖יו כַּלְּבָנֽוֹן׃ \n" +
					"יֵֽלְכוּ֙ יֹֽנְקוֹתָ֔יו וִיהִ֥י כַזַּ֖יִת הוֹד֑וֹ וְרֵ֥יחַֽ ל֖וֹ כַּלְּבָנֽוֹן׃ \n" +
					"יָשֻׁ֙בוּ֙ יֹשְׁבֵ֣י בְצִלּ֔וֹ יְחַיּ֥וּ דָגָ֖ן וְיִפְרְח֣וּ כַגָּ֑פֶן זִכְר֖וֹ כְּיֵ֥ין לְבָנֽוֹן׃ \n" +
					"אֶפְרַ֕יִם מַה־לִּ֥י ע֖וֹד לָעֲצַבִּ֑ים אֲנִ֧י עָנִ֣יתִי וַאֲשׁוּרֶ֗נּוּ אֲנִי֙ כִּבְר֣וֹשׁ רַעֲנָ֔ן מִמֶּ֖נִּי פֶּרְיְךָ֥ נִמְצָֽא׃ \n" +
					"מִ֤י חָכָם֙ וְיָ֣בֵֽן אֵ֔לֶּה נָב֖וֹן וְיֵדָעֵ֑ם כִּֽי־יְשָׁרִ֞ים דַּרְכֵ֣י יְהֹוָ֗ה וְצַדִּקִים֙ יֵ֣לְכוּ בָ֔ם וּפֹשְׁעִ֖ים יִכָּ֥שְׁלוּ בָֽם׃ מִי־אֵ֣ל כָּמ֗וֹךָ נֹשֵׂ֤א עָוֺן֙ וְעֹבֵ֣ר עַל־פֶּ֔שַׁע לִשְׁאֵרִ֖ית נַחֲלָת֑וֹ לֹֽא־הֶחֱזִ֤יק לָעַד֙ אַפּ֔וֹ כִּֽי־חָפֵ֥ץ חֶ֖סֶד הֽוּא׃ \n" +
					"יָשׁ֣וּב יְרַחֲמֵ֔נוּ יִכְבֹּ֖שׁ עֲוֺנֹתֵ֑ינוּ וְתַשְׁלִ֛יךְ בִּמְצֻל֥וֹת יָ֖ם כׇּל־חַטֹּאותָֽם׃ \n" +
					"תִּתֵּ֤ן אֱמֶת֙ לְיַֽעֲקֹ֔ב חֶ֖סֶד לְאַבְרָהָ֑ם אֲשֶׁר־נִשְׁבַּ֥עְתָּ לַאֲבֹתֵ֖ינוּ מִ֥ימֵי קֶֽדֶם׃");
				addToSiddurHighlighted("אחר קריאת ההפטרה יאמר \n" +
					"גֹּאֲלֵ֕נוּ יְהֹוָ֥ה צְבָא֖וֹת שְׁמ֑וֹ קְד֖וֹשׁ יִשְׂרָאֵֽל׃ \n" +
					"ואחר כך יברך \n" +
					"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, צוּר כָּל־הָעוֹלָמִים, צַדִּיק בְּכָל־הַדּוֹרוֹת, הָאֵל הַנֶּאֱמָן הָאֹמֵר וְעֹשֶׂה, הַמְדַבֵּר וּמְקַיֵּם, שֶׁכָּל־דְּבָרָיו אֱמֶת וָצֶדֶק. נֶאֱמָן, אַתָּה הוּא יְהֹוָה אֱלֹהֵינוּ, וְנֶאֱמָנִים דְּבָרֶיךָ, וְדָבָר אֶחָד מִדְּבָרֶיךָ אָחוֹר לֹא יָשׁוּב רֵיקָם, כִּי אֵל מֶלֶךְ נֶאֱמָן וְרַחֲמָן אָתָּה. בָּרוּךְ אַתָּה יְהֹוָה, הָאֵל הַנֶּאֱמָן בְּכָל־דְּבָרָיו: \n" +
					"רַחֵם עַל צִיּוֹן כִּי הִיא בֵּית חַיֵּינוּ, וְלַעֲלוּבַת נֶפֶשׁ תּוֹשִׁיעַ בִּמְהֵרָה בְיָמֵינוּ. בָּרוּךְ אַתָּה יְהֹוָה, מְשַׂמֵּחַ צִיּוֹן בְּבָנֶיהָ: \n" +
					"שַׂמְּחֵנוּ יְהֹוָה אֱלֹהֵינוּ, בְּאֵלִיָהוּ הַנָּבִיא עַבְדָּךְ, וּבְמַלְכוּת בֵּית דָּוִד מְשִׁיחָךְ, בִּמְהֵרָה יָבֹא וְיָגֵל לִבֵּנוּ, עַל כִּסְאוֹ לֹא יֵשֶׁב זָר, וְלֹא יִנְחֲלוּ עוֹד אֲחֵרִים אֶת כְּבוֹדוֹ, כִּי בְשֵׁם קָדְשְׁךָ נִשְׁבַּעְתָּ לּוֹ, שֶׁלֹּא יִכְבֶּה נֵרוֹ לְעוֹלָם וָעֶד. בָּרוּךְ אַתָּה יְהֹוָה, מָגֵן דָּוִד: [אָמֵן]");
			}
		}

		addToSiddur(
				"תִּכּ֤וֹן תְּפִלָּתִ֣י קְטֹ֣רֶת לְפָנֶ֑יךָ מַֽשְׂאַ֥ת כַּ֝פַּ֗י מִנְחַת־עָֽרֶב: הַקְשִׁ֤יבָה ׀ לְק֬וֹל שַׁוְעִ֗י מַלְכִּ֥י וֵאלֹהָ֑י כִּֽי־אֵ֝לֶ֗יךָ אֶתְפַּלָּֽל: \n\n" +
						"ואומר החזן חצי קדיש");

		addHalfKaddish(false);

		addAmidahToSiddur(true, false);

		addAvinuMalkeinu(isTachanunSaidByMincha);// If Aseret Ymei Tshuvah

		if (jewishDateInfo.getIsTachanunSaid().equals("Some skip Tachanun by mincha")
				|| jewishDateInfo.getIsTachanunSaid().equals("יש מדלגים תחנון במנחה")
				|| jewishDateInfo.getIsTachanunSaid().equals("Some say Tachanun today")
				|| jewishDateInfo.getIsTachanunSaid().equals("יש אומרים תחנון")) {
			addToSiddur("[" + jewishDateInfo.getIsTachanunSaid() + "]");
		}

		if (isTachanunSaidByMincha) {
			addTachanun();
		} else {
			if (jewishDateInfo.getJewishCalendar().isTishaBav()) {
				addToSiddur(
					"נַחֲמוּ נַחֲמוּ עַמִּי, יֹאמַר אֶשְׁכֹּל כֹּֽפֶר. לְנַחֵם אֶת כָּל־הַנִּמְצָא כָּתוּב בַּסֵּֽפֶר. לָשׂוּם לַֽאֲבֵלֵי צִיּוֹן פְּאֵר תַּֽחַת אֵֽפֶר: \n" +
					"עַל חַלְלֵי בַת־עַמִּי, לִבִּי הוֹמֶה־עָלַי, וְעַל חָרְבַּן אוּלָמִּי, וְעַל שִׁמְמוּת הֵיכָלִי, מָקוֹם הַנִּקְרָא בִּשְׁמִי, וּקְרָאתִיו הֲדוֹם רַגְלַי, שָׂמוּ אוֹתוֹ לְעִיִּים בְּנֵי עֵיפָה וָעֵֽפֶר. לָשׂוּם לַֽאֲבֵלֵי צִיּוֹן פְּאֵר תַּֽחַת אֵֽפֶר: \n" +
					"דַּבְּרוּ. וְאַל יִמְשׁוֹל עַם נָכְרִי בִּצְבִי נַֽחֲלַת שֶֽׁפֶר.לָשׂוּם לַֽאֲבֵלֵי צִיּוֹן פְּאֵר תַּֽחַת אֵֽפֶר: \n" +
					"נַחֵם עַם מֵאֶבְלוֹ, וְכַפֵּר עַל אַשְׁמָתוֹ, וְהָקֵל אֶת־עוֹל סֻבֳּלוֹ, וְהַֽעֲבֵר אֶת כְּלִמָּתוֹ, וּשְׁלַח מַלְאָךְ רַֽחֲמִים, לְרַפֵּא אֶת מְגוּרָתוֹ, וּפְדֵה עַמְּךָ מִשַּֽׁחַת, לֵאמֹר מָצָֽאתִי כֹֽפֶר. לָשׂוּם לַֽאֲבֵלֵי צִיּוֹן פְּאֵר תַּֽחַת אֵֽפֶר: \n" +
					"נַחֲמוּ נַחֲמוּ עַמִּי, יֹאמַר אֶשְׁכֹּל כֹּֽפֶר. לְנַחֵם כָּל הַנִּמְצָא כָּתוּב בַּסֵּפֶר. לָשׂוּם לַֽאֲבֵלֵי צִיּוֹן פְּאֵר תַּֽחַת אֵֽפֶר: \n" +
					"אֶשָּׂא נֵס לַגּוֹיִם, לְשׁוֹכְנִים בְּכָל תֵּבֵל, לְשׁוֹבֵב אֶל הַר צִיּוֹן קְרוּאָה נַֽחֲלַת חֶֽבֶל, לָשׁוּם שֶֽׁמֶן שָׂשׂוֹן בְּרֹאשָׁהּ תַּֽחַת אֵֽבֶל, מֵעֵילָם וּמֵעֵיבָל וּמֵעֵיפָה וָעֵֽפֶר. לָשׂוּם לַֽאֲבֵלֵי צִיּוֹן פְּאֵר תַּֽחַת אֵֽפֶר: \n" +
					"אֲשִׁיבֵם אֶל נְוֵה קָדְשָׁם מִתְעַלְּפִים בַּֽהֲמוֹנָם. יָרֹֽנּוּ בִּמְחוֹלוֹת, כִּי אֲנַחֲמֵם מֵֽאֶבְלָם, וְאֶֽהְפּוֹךְ אֶבְלָם לְשָׂשׂוֹן וְשִׂמַּחְתִּים מִֽיגוֹנָם. וְאָז כָּל שֽׂוֹטְנָם וּמוֹנָם, יַעֲטוּ בּוּז וְחֵֽפֶר. לָשׂוּם לַֽאֲבֵלֵי צִיּוֹן פְּאֵר תַּֽחַת אֵֽפֶר: \n" +
					"יְרוּשָׁלַֽיִם אֶבְנֶה, וְאֶהְיֶה סְבִיבוֹתֶֽיהָ, לְחוֹמַת אֵשׁ וּלְכָבוֹד, בְּבָתֵּי מוֹשְׁבוֹתֶֽיהָ. וְאָז יֹאמְרוּ בָעַמִּים, בִּרְבוֹת טוֹבוֹתֶֽיהָ. נִחַם יְהֹוָה צִיּוֹן נִחַם כָּל חָרְבוֹתֶֽיהָ. וְתָשִׁיב בְּתוֹכָהּ לָעַד נוֹחֲלֵי אִמְרֵי שֶֽׁפֶר: לָשׂוּם לַֽאֲבֵלֵי צִיּוֹן פְּאֵר תַּֽחַת אֵֽפֶר: \n" +
					"נַחֲמ֥וּ נַחֲמ֖וּ עַמִּ֑י יֹאמַ֖ר אֱלֹֽהֵיכֶֽם׃ דַּבְּר֞וּ עַל־לֵ֤ב יְרוּשָׁלַ֙‍ִם֙ וְקִרְא֣וּ אֵלֶ֔יהָ כִּ֤י מָֽלְאָה֙ צְבָאָ֔הּ כִּ֥י נִרְצָ֖ה עֲוֺנָ֑הּ כִּ֤י לָֽקְחָה֙ מִיַּ֣ד יְהֹוָ֔ה כִּפְלַ֖יִם בְּכׇל־חַטֹּאתֶֽיהָ׃ אָנֹכִ֧י אָנֹכִ֛י ה֖וּא מְנַחֶמְכֶ֑ם מִי־אַ֤תְּ וַתִּֽירְאִי֙ מֵאֱנ֣וֹשׁ יָמ֔וּת וּמִבֶּן־אָדָ֖ם חָצִ֥יר יִנָּתֵֽן׃ כִּֽי־נִחַ֨ם יְהֹוָ֜ה צִיּ֗וֹן נִחַם֙ כׇּל־חׇרְבֹתֶ֔יהָ וַיָּ֤שֶׂם מִדְבָּרָהּ֙ כְּעֵ֔דֶן וְעַרְבָתָ֖הּ כְּגַן־יְהֹוָ֑ה שָׂשׂ֤וֹן וְשִׂמְחָה֙ יִמָּ֣צֵא בָ֔הּ תּוֹדָ֖ה וְק֥וֹל זִמְרָֽה: רָנּ֤וּ שָׁמַ֙יִם֙ וְגִ֣ילִי אָ֔רֶץ וּפִצְח֥וּ הָרִ֖ים רִנָּ֑ה כִּֽי־נִחַ֤ם יְהֹוָה֙ עַמּ֔וֹ וַעֲנִיָּ֖יו יְרַחֵֽם: שִׂמְח֧וּ אֶת־יְרוּשָׁלַ֛‍ִם וְגִ֥ילוּ בָ֖הּ כׇּל־אֹהֲבֶ֑יהָ שִׂ֤ישׂוּ אִתָּהּ֙ מָשׂ֔וֹשׂ כׇּל־הַמִּֽתְאַבְּלִ֖ים עָלֶֽיהָ׃ לְמַ֤עַן תִּֽינְקוּ֙ וּשְׂבַעְתֶּ֔ם מִשֹּׁ֖ד תַּנְחֻמֶ֑יהָ לְמַ֧עַן תָּמֹ֛צּוּ וְהִתְעַנַּגְתֶּ֖ם מִזִּ֥יז כְּבוֹדָֽהּ: כְּאִ֕ישׁ אֲשֶׁ֥ר אִמּ֖וֹ תְּנַחֲמֶ֑נּוּ כֵּ֤ן אָֽנֹכִי֙ אֲנַ֣חֶמְכֶ֔ם וּבִירֽוּשָׁלַ֖‍ִם תְּנֻחָֽמוּ: ק֥וֹל צֹפַ֛יִךְ נָ֥שְׂאוּ ק֖וֹל יַחְדָּ֣ו יְרַנֵּ֑נוּ כִּ֣י עַ֤יִן בְּעַ֙יִן֙ יִרְא֔וּ בְּשׁ֥וּב יְהֹוָ֖ה צִיּֽוֹן׃ פִּצְח֤וּ רַנְּנוּ֙ יַחְדָּ֔ו חׇרְב֖וֹת יְרוּשָׁלָ֑‍ִם כִּֽי־נִחַ֤ם יְהֹוָה֙ עַמּ֔וֹ גָּאַ֖ל יְרוּשָׁלָֽ‍ִם: וּפְדוּיֵ֨י יְהֹוָ֜ה יְשֻׁב֗וּן וּבָ֤אוּ צִיּוֹן֙ בְּרִנָּ֔ה וְשִׂמְחַ֥ת עוֹלָ֖ם עַל־רֹאשָׁ֑ם שָׂשׂ֤וֹן וְשִׂמְחָה֙ יַשִּׂ֔יגוּ וְנָ֖סוּ יָג֥וֹן וַאֲנָחָֽה: לֹא־יָב֥וֹא עוֹד֙ שִׁמְשֵׁ֔ךְ וִירֵחֵ֖ךְ לֹ֣א יֵֽאָסֵ֑ף כִּ֣י יְהֹוָ֗ה יִֽהְיֶה־לָּךְ֙ לְא֣וֹר עוֹלָ֔ם וְשָׁלְמ֖וּ יְמֵ֥י אֶבְלֵֽךְ: כִּ֣י לֹ֤א בְחִפָּזוֹן֙ תֵּצֵ֔אוּ וּבִמְנוּסָ֖ה לֹ֣א תֵלֵכ֑וּן כִּֽי־הֹלֵ֤ךְ לִפְנֵיכֶם֙ יְהֹוָ֔ה וּמְאַסִּפְכֶ֖ם אֱלֹהֵ֥י יִשְׂרָאֵֽל׃ וְעַמֵּךְ֙ כֻּלָּ֣ם צַדִּיקִ֔ים לְעוֹלָ֖ם יִ֣ירְשׁוּ אָ֑רֶץ נֵ֧צֶר מַטָּעַ֛י מַעֲשֵׂ֥ה יָדַ֖י לְהִתְפָּאֵֽר: הַקָּטֹן֙ יִֽהְיֶ֣ה לָאֶ֔לֶף וְהַצָּעִ֖יר לְג֣וֹי עָצ֑וּם אֲנִ֥י יְהֹוָ֖ה בְּעִתָּ֥הּ אֲחִישֶֽׁנָּה׃ וְהָיָ֣ה ׀ הַנִּשְׁאָ֣ר בְּצִיּ֗וֹן וְהַנּוֹתָר֙ בִּיר֣וּשָׁלַ֔‍ִם קָד֖וֹשׁ יֵאָ֣מֶר ל֑וֹ כׇּל־הַכָּת֥וּב לַחַיִּ֖ים בִּירוּשָׁלָֽ‍ִם׃ חַזְּק֖וּ יָדַ֣יִם רָפ֑וֹת וּבִרְכַּ֥יִם כֹּשְׁל֖וֹת אַמֵּֽצוּ: אִמְרוּ֙ לְנִמְהֲרֵי־לֵ֔ב חִזְק֖וּ אַל־תִּירָ֑אוּ הִנֵּ֤ה אֱלֹֽהֵיכֶם֙ נָקָ֣ם יָב֔וֹא גְּמ֣וּל אֱלֹהִ֔ים ה֥וּא יָב֖וֹא וְיֹשַׁעֲכֶֽם׃ כִּֽי־בְשִׂמְחָ֣ה תֵצֵ֔אוּ וּבְשָׁל֖וֹם תּוּבָל֑וּן הֶהָרִ֣ים וְהַגְּבָע֗וֹת יִפְצְח֤וּ לִפְנֵיכֶם֙ רִנָּ֔ה וְכׇל־עֲצֵ֥י הַשָּׂדֶ֖ה יִמְחֲאוּ־כָֽף׃ לִקְרֹ֤א שְׁנַת־רָצוֹן֙ לַֽיהֹוָ֔ה וְי֥וֹם נָקָ֖ם לֵאלֹהֵ֑ינוּ לְנַחֵ֖ם כׇּל־אֲבֵלִֽים: לֵאמֹ֤ר לַֽאֲסוּרִים֙ צֵ֔אוּ לַאֲשֶׁ֥ר בַּחֹ֖שֶׁךְ הִגָּל֑וּ עַל־דְּרָכִ֣ים יִרְע֔וּ וּבְכׇל־שְׁפָיִ֖ים מַרְעִיתָֽם׃ לָשׂ֣וּם ׀ לַאֲבֵלֵ֣י צִיּ֗וֹן לָתֵת֩ לָהֶ֨ם פְּאֵ֜ר תַּ֣חַת אֵ֗פֶר שֶׁ֤מֶן שָׂשׂוֹן֙ תַּ֣חַת אֵ֔בֶל מַעֲטֵ֣ה תְהִלָּ֔ה תַּ֖חַת ר֣וּחַ כֵּהָ֑ה וְקֹרָ֤א לָהֶם֙ אֵילֵ֣י הַצֶּ֔דֶק מַטַּ֥ע יְהֹוָ֖ה לְהִתְפָּאֵֽר׃ צִיּ֖וֹן בְּמִשְׁפָּ֣ט תִּפָּדֶ֑ה וְשָׁבֶ֖יהָ בִּצְדָקָֽה׃ וַאֲנִ֤י תְפִלָּֽתִי־לְךָ֨ ׀ יְהֹוָ֡ה עֵ֤ת רָצ֗וֹן אֱלֹהִ֥ים בְּרׇב־חַסְדֶּ֑ךָ עֲ֝נֵ֗נִי בֶּאֱמֶ֥ת יִשְׁעֶֽךָ׃ וְ֭נַפְשִׁי תָּגִ֣יל בַּיהֹוָ֑ה תָּ֝שִׂ֗ישׂ בִּישׁוּעָתֽוֹ׃ וַאֲנִ֤י ׀ בְּחַסְדְּךָ֣ בָטַחְתִּי֮ יָ֤גֵ֥ל לִבִּ֗י בִּֽישׁוּעָ֫תֶ֥ךָ אָשִׁ֥ירָה לַֽיהֹוָ֑ה כִּ֖י גָמַ֣ל עָלָֽי׃ אֲדֹנָ֤י ׀ שְׁמָ֙עָה֙ אֲדֹנָ֣י ׀ סְלָ֔חָה אֲדֹנָ֛י הַֽקְשִׁ֥יבָה וַעֲשֵׂ֖ה אַל־תְּאַחַ֑ר לְמַֽעַנְךָ֣ אֱלֹהַ֔י כִּֽי־שִׁמְךָ֣ נִקְרָ֔א עַל־עִירְךָ֖ וְעַל־עַמֶּֽךָ׃ הֲשִׁיבֵ֨נוּ יְהֹוָ֤ה ׀ אֵלֶ֙יךָ֙ וְֽנָשׁ֔וּבָה חַדֵּ֥שׁ יָמֵ֖ינוּ כְּקֶֽדֶם׃");
			} else {
				addToSiddurHighlighted(
					"יְהִ֤י שֵׁ֣ם יְהֹוָ֣ה מְבֹרָ֑ךְ מֵ֝עַתָּ֗ה וְעַד־עוֹלָֽם׃ מִמִּזְרַח־שֶׁ֥מֶשׁ עַד־מְבוֹא֑וֹ מְ֝הֻלָּ֗ל שֵׁ֣ם יְהֹוָֽה׃ רָ֖ם עַל־כׇּל־גּוֹיִ֥ם ׀ יְהֹוָ֑ה עַ֖ל הַשָּׁמַ֣יִם כְּבוֹדֽוֹ׃ יְהֹוָ֥ה אֲדֹנֵ֑ינוּ מָה־אַדִּ֥יר שִׁ֝מְךָ֗ בְּכׇל־הָאָֽרֶץ׃");
			}
		}

		addKaddishTitkabal(false);

		if (jewishDateInfo.getJewishCalendar().isTishaBav()) {
			addToSiddurHighlighted(
				"שִׁיר הַמַּעֲלוֹת בְּשׁוּב יְהֹוָה אֶת־שִׁיבַת צִיּוֹן הָיִֽינוּ כְּחֹלְ֒מִים: אָז יִמָּלֵא שְׂחוֹק פִּֽינוּ וּלְשׁוֹנֵֽנוּ רִנָּה, אָז יֹאמְ֒רוּ בַגּוֹיִם הִגְדִּיל יְהֹוָה לַעֲשׂוֹת עִם־אֵֽלֶּה: הִגְדִּיל יְהֹוָה לַעֲשׂוֹת עִמָּֽנוּ, הָיִֽינוּ שְׂמֵחִים: שׁוּבָה יְהֹוָה אֶת־שְׁבִיתֵֽנוּ כַּאֲפִיקִים בַּנֶּֽגֶב: הַזֹּרְ֒עִים בְּדִמְעָה, בְּרִנָּה יִקְצֹֽרוּ: הָלוֹךְ יֵלֵךְ וּבָכֹה, נֹשֵׂא מֶֽשֶׁךְ־הַזָּֽרַע, בֹּא־יָבֹא בְרִנָּה, נֹשֵׂא אֲלֻמֹּתָיו:");
		} else if (jewishDateInfo.getJewishCalendar().getDayOfWeek() == 6) {
			addToSiddurHighlighted(
				"יְהֹוָ֣ה מָלָךְ֮ גֵּא֢וּת לָ֫בֵ֥שׁ לָבֵ֣שׁ יְ֭הֹוָה עֹ֣ז הִתְאַזָּ֑ר אַף־תִּכּ֥וֹן תֵּ֝בֵ֗ל בַּל־תִּמּֽוֹט׃ נָכ֣וֹן כִּסְאֲךָ֣ מֵאָ֑ז מֵעוֹלָ֣ם אָֽתָּה׃ נָשְׂא֤וּ נְהָר֨וֹת ׀ יְֽהֹוָ֗ה נָשְׂא֣וּ נְהָר֣וֹת קוֹלָ֑ם יִשְׂא֖וּ נְהָר֣וֹת דׇּכְיָֽם׃ מִקֹּל֨וֹת ׀ מַ֤יִם רַבִּ֗ים אַדִּירִ֣ים מִשְׁבְּרֵי־יָ֑ם אַדִּ֖יר בַּמָּר֣וֹם יְהֹוָֽה׃ עֵֽדֹתֶ֨יךָ ׀ נֶאֶמְנ֬וּ מְאֹ֗ד לְבֵיתְךָ֥ נַאֲוָה־קֹ֑דֶשׁ יְ֝הֹוָ֗ה לְאֹ֣רֶךְ יָמִֽים׃");
		} else {
			addToSiddur(menorah);
		}

		if (jewishDateInfo.getJewishCalendar().isTaanis()
				&& jewishDateInfo.getJewishCalendar().getYomTovIndex() != JewishCalendar.YOM_KIPPUR
				&& !jewishDateInfo.getJewishCalendar().isTishaBav()) {
			if (jewishDateInfo.getJewishCalendar().getYomTovIndex() == JewishCalendar.FAST_OF_ESTHER) {
				addToSiddurHighlighted(
					"לַ֭מְנַצֵּחַ עַל־אַיֶּ֥לֶת הַשַּׁ֗חַר מִזְמ֥וֹר לְדָוִֽד׃ אֵלִ֣י אֵ֭לִי לָמָ֣ה עֲזַבְתָּ֑נִי רָח֥וֹק מִֽ֝ישׁוּעָתִ֗י דִּבְרֵ֥י שַׁאֲגָתִֽי׃ אֱֽלֹהַ֗י אֶקְרָ֣א י֭וֹמָם וְלֹ֣א תַעֲנֶ֑ה וְ֝לַ֗יְלָה וְֽלֹא־דֻֽמִיָּ֥ה לִֽי׃ וְאַתָּ֥ה קָד֑וֹשׁ י֝וֹשֵׁ֗ב תְּהִלּ֥וֹת יִשְׂרָאֵֽל׃ בְּ֭ךָ בָּטְח֣וּ אֲבֹתֵ֑ינוּ בָּ֝טְח֗וּ וַֽתְּפַלְּטֵֽמוֹ׃ אֵלֶ֣יךָ זָעֲק֣וּ וְנִמְלָ֑טוּ בְּךָ֖ בָטְח֣וּ וְלֹא־בֽוֹשׁוּ׃ וְאָנֹכִ֣י תוֹלַ֣עַת וְלֹא־אִ֑ישׁ חֶרְפַּ֥ת אָ֝דָ֗ם וּבְז֥וּי עָֽם׃ כׇּל־רֹ֭אַי יַלְעִ֣גוּ לִ֑י יַפְטִ֥ירוּ בְ֝שָׂפָ֗ה יָנִ֥יעוּ רֹֽאשׁ׃ גֹּ֣ל אֶל־יְהֹוָ֣ה יְפַלְּטֵ֑הוּ יַ֝צִּילֵ֗הוּ כִּ֘י חָ֥פֵֽץ בּֽוֹ׃ כִּֽי־אַתָּ֣ה גֹחִ֣י מִבָּ֑טֶן מַ֝בְטִיחִ֗י עַל־שְׁדֵ֥י אִמִּֽי׃ עָ֭לֶיךָ הׇשְׁלַ֣כְתִּי מֵרָ֑חֶם מִבֶּ֥טֶן אִ֝מִּ֗י אֵ֣לִי אָֽתָּה׃ אַל־תִּרְחַ֣ק מִ֭מֶּנִּי כִּי־צָרָ֣ה קְרוֹבָ֑ה כִּי־אֵ֥ין עוֹזֵֽר׃ סְ֭בָבוּנִי פָּרִ֣ים רַבִּ֑ים אַבִּירֵ֖י בָשָׁ֣ן כִּתְּרֽוּנִי׃ פָּצ֣וּ עָלַ֣י פִּיהֶ֑ם אַ֝רְיֵ֗ה טֹרֵ֥ף וְשֹׁאֵֽג׃ כַּמַּ֥יִם נִשְׁפַּכְתִּי֮ וְהִתְפָּֽרְד֗וּ כׇּֽל־עַצְמ֫וֹתָ֥י הָיָ֣ה לִ֭בִּי כַּדּוֹנָ֑ג נָ֝מֵ֗ס בְּת֣וֹךְ מֵעָֽי׃ יָ֘בֵ֤שׁ כַּחֶ֨רֶשׂ ׀ כֹּחִ֗י וּ֭לְשׁוֹנִי מֻדְבָּ֣ק מַלְקוֹחָ֑י וְֽלַעֲפַר־מָ֥וֶת תִּשְׁפְּתֵֽנִי׃ כִּ֥י סְבָב֗וּנִי כְּלָ֫בִ֥ים עֲדַ֣ת מְ֭רֵעִים הִקִּיפ֑וּנִי כָּ֝אֲרִ֗י יָדַ֥י וְרַגְלָֽי׃ אֲסַפֵּ֥ר כׇּל־עַצְמוֹתָ֑י הֵ֥מָּה יַ֝בִּ֗יטוּ יִרְאוּ־בִֽי׃ יְחַלְּק֣וּ בְגָדַ֣י לָהֶ֑ם וְעַל־לְ֝בוּשִׁ֗י יַפִּ֥ילוּ גוֹרָֽל׃ וְאַתָּ֣ה יְ֭הֹוָה אַל־תִּרְחָ֑ק אֱ֝יָלוּתִ֗י לְעֶזְרָ֥תִי חֽוּשָׁה׃ הַצִּ֣ילָה מֵחֶ֣רֶב נַפְשִׁ֑י מִיַּד־כֶּ֝֗לֶב יְחִידָתִֽי׃ ה֭וֹשִׁיעֵנִי מִפִּ֣י אַרְיֵ֑ה וּמִקַּרְנֵ֖י רֵמִ֣ים עֲנִיתָֽנִי׃ אֲסַפְּרָ֣ה שִׁמְךָ֣ לְאֶחָ֑י בְּת֖וֹךְ קָהָ֣ל אֲהַלְלֶֽךָּ׃ יִרְאֵ֤י יְהֹוָ֨ה ׀ הַֽלְל֗וּהוּ כׇּל־זֶ֣רַע יַעֲקֹ֣ב כַּבְּד֑וּהוּ וְג֥וּרוּ מִ֝מֶּ֗נּוּ כׇּל־זֶ֥רַע יִשְׂרָאֵֽל׃ כִּ֤י לֹֽא־בָזָ֨ה וְלֹ֪א שִׁקַּ֡ץ עֱנ֬וּת עָנִ֗י וְלֹא־הִסְתִּ֣יר פָּנָ֣יו מִמֶּ֑נּוּ וּֽבְשַׁוְּע֖וֹ אֵלָ֣יו שָׁמֵֽעַ׃ מֵ֥אִתְּךָ֗ תְּֽהִלָּ֫תִ֥י בְּקָהָ֥ל רָ֑ב נְדָרַ֥י אֲ֝שַׁלֵּ֗ם נֶ֣גֶד יְרֵאָֽיו׃ יֹאכְל֬וּ עֲנָוִ֨ים ׀ וְיִשְׂבָּ֗עוּ יְהַֽלְל֣וּ יְ֭הֹוָה דֹּ֣רְשָׁ֑יו יְחִ֖י לְבַבְכֶ֣ם לָעַֽד׃ יִזְכְּר֤וּ ׀ וְיָשֻׁ֣בוּ אֶל־יְ֭הֹוָה כׇּל־אַפְסֵי־אָ֑רֶץ וְיִֽשְׁתַּחֲו֥וּ לְ֝פָנֶ֗יךָ כׇּֽל־מִשְׁפְּח֥וֹת גּוֹיִֽם׃ כִּ֣י לַ֭יהֹוָה הַמְּלוּכָ֑ה וּ֝מֹשֵׁ֗ל בַּגּוֹיִֽם׃ אָכְל֬וּ וַיִּֽשְׁתַּחֲו֨וּ ׀ כׇּֽל־דִּשְׁנֵי־אֶ֗רֶץ לְפָנָ֣יו יִ֭כְרְעוּ כׇּל־יוֹרְדֵ֣י עָפָ֑ר וְ֝נַפְשׁ֗וֹ לֹ֣א חִיָּֽה׃ זֶ֥רַע יַֽעַבְדֶ֑נּוּ יְסֻפַּ֖ר לַֽאדֹנָ֣י לַדּֽוֹר׃ יָ֭בֹאוּ וְיַגִּ֣ידוּ צִדְקָת֑וֹ לְעַ֥ם נ֝וֹלָ֗ד כִּ֣י עָשָֽׂה׃");
			} else {
				addToSiddurHighlighted(
					"תְּ֭פִלָּה לְעָנִ֣י כִֽי־יַעֲטֹ֑ף וְלִפְנֵ֥י יְ֝הֹוָ֗ה יִשְׁפֹּ֥ךְ שִׂיחֽוֹ׃ יְ֭הֹוָה שִׁמְעָ֣ה תְפִלָּתִ֑י וְ֝שַׁוְעָתִ֗י אֵלֶ֥יךָ תָבֽוֹא׃ אַל־תַּסְתֵּ֬ר פָּנֶ֨יךָ ׀ מִמֶּנִּי֮ בְּי֢וֹם צַ֫ר לִ֥י הַטֵּֽה־אֵלַ֥י אׇזְנֶ֑ךָ בְּי֥וֹם אֶ֝קְרָ֗א מַהֵ֥ר עֲנֵֽנִי׃ כִּֽי־כָל֣וּ בְעָשָׁ֣ן יָמָ֑י וְ֝עַצְמוֹתַ֗י כְּמוֹקֵ֥ד נִחָֽרוּ׃ הוּכָּה־כָעֵ֣שֶׂב וַיִּבַ֣שׁ לִבִּ֑י כִּֽי־שָׁ֝כַ֗חְתִּי מֵאֲכֹ֥ל לַחְמִֽי׃ מִקּ֥וֹל אַנְחָתִ֑י דָּבְקָ֥ה עַ֝צְמִ֗י לִבְשָׂרִֽי׃ דָּ֭מִיתִי לִקְאַ֣ת מִדְבָּ֑ר הָ֝יִ֗יתִי כְּכ֣וֹס חֳרָבֽוֹת׃ שָׁקַ֥דְתִּי וָאֶהְיֶ֑ה כְּ֝צִפּ֗וֹר בּוֹדֵ֥ד עַל־גָּֽג׃ כׇּל־הַ֭יּוֹם חֵרְפ֣וּנִי אוֹיְבָ֑י מְ֝הוֹלָלַ֗י בִּ֣י נִשְׁבָּֽעוּ׃ כִּי־אֵ֭פֶר כַּלֶּ֣חֶם אָכָ֑לְתִּי וְ֝שִׁקֻּוַ֗י בִּבְכִ֥י מָסָֽכְתִּי׃ מִפְּנֵֽי־זַעַמְךָ֥ וְקִצְפֶּ֑ךָ כִּ֥י נְ֝שָׂאתַ֗נִי וַתַּשְׁלִיכֵֽנִי׃ יָ֭מַי כְּצֵ֣ל נָט֑וּי וַ֝אֲנִ֗י כָּעֵ֥שֶׂב אִיבָֽשׁ׃ וְאַתָּ֣ה יְ֭הֹוָה לְעוֹלָ֣ם תֵּשֵׁ֑ב וְ֝זִכְרְךָ֗ לְדֹ֣ר וָדֹֽר׃ אַתָּ֣ה תָ֭קוּם תְּרַחֵ֣ם צִיּ֑וֹן כִּי־עֵ֥ת לְ֝חֶֽנְנָ֗הּ כִּי־בָ֥א מוֹעֵֽד׃ כִּי־רָצ֣וּ עֲ֭בָדֶיךָ אֶת־אֲבָנֶ֑יהָ וְֽאֶת־עֲפָרָ֥הּ יְחֹנֵֽנוּ׃ וְיִֽירְא֣וּ ג֭וֹיִם אֶת־שֵׁ֣ם יְהֹוָ֑ה וְֽכׇל־מַלְכֵ֥י הָ֝אָ֗רֶץ אֶת־כְּבוֹדֶֽךָ׃ כִּֽי־בָנָ֣ה יְהֹוָ֣ה צִיּ֑וֹן נִ֝רְאָ֗ה בִּכְבוֹדֽוֹ׃ פָּ֭נָה אֶל־תְּפִלַּ֣ת הָעַרְעָ֑ר וְלֹא־בָ֝זָ֗ה אֶת־תְּפִלָּתָֽם׃ תִּכָּ֣תֶב זֹ֭את לְד֣וֹר אַחֲר֑וֹן וְעַ֥ם נִ֝בְרָ֗א יְהַלֶּל־יָֽהּ׃ כִּֽי־הִ֭שְׁקִיף מִמְּר֣וֹם קׇדְשׁ֑וֹ יְ֝הֹוָ֗ה מִשָּׁמַ֤יִם ׀ אֶל־אֶ֬רֶץ הִבִּֽיט׃ לִ֭שְׁמֹעַ אֶנְקַ֣ת אָסִ֑יר לְ֝פַתֵּ֗חַ בְּנֵ֣י תְמוּתָֽה׃ לְסַפֵּ֣ר בְּ֭צִיּוֹן שֵׁ֣ם יְהֹוָ֑ה וּ֝תְהִלָּת֗וֹ בִּיְרוּשָׁלַיִם׃ בְּהִקָּבֵ֣ץ עַמִּ֣ים יַחְדָּ֑ו וּ֝מַמְלָכ֗וֹת לַעֲבֹ֥ד אֶת־יְהֹוָֽה׃ עִנָּ֖ה בַדֶּ֥רֶךְ כֹּחִ֗י קִצַּ֥ר יָמָֽי׃ אֹמַ֗ר אֵלִ֗י אַֽל־תַּ֭עֲלֵנִי בַּחֲצִ֣י יָמָ֑י בְּד֖וֹר דּוֹרִ֣ים שְׁנוֹתֶֽיךָ׃ לְ֭פָנִים הָאָ֣רֶץ יָסַ֑דְתָּ וּֽמַעֲשֵׂ֖ה יָדֶ֣יךָ שָׁמָֽיִם׃ הֵ֤מָּה ׀ יֹאבֵדוּ֮ וְאַתָּ֢ה תַ֫עֲמֹ֥ד וְ֭כֻלָּם כַּבֶּ֣גֶד יִבְל֑וּ כַּלְּב֖וּשׁ תַּחֲלִיפֵ֣ם וְֽיַחֲלֹֽפוּ׃ וְאַתָּה־ה֑וּא וּ֝שְׁנוֹתֶ֗יךָ לֹ֣א יִתָּֽמּוּ׃ בְּנֵֽי־עֲבָדֶ֥יךָ יִשְׁכּ֑וֹנוּ וְ֝זַרְעָ֗ם לְפָנֶ֥יךָ יִכּֽוֹן׃");
			}
		}

		addKaddishYeheShelama();
		addAlenu();
		return siddur;
	}

	private void getNeilahPrayers() {
		// code
	}

	private void addEicha() {
		addCategoryToSiddur("איכה");
		addToSiddur(
			"אֵיכָ֣ה ׀ יָשְׁבָ֣ה בָדָ֗ד הָעִיר֙ רַבָּ֣תִי עָ֔ם הָיְתָ֖ה כְּאַלְמָנָ֑ה רַּבָּ֣תִי בַגּוֹיִ֗ם שָׂרָ֙תִי֙ בַּמְּדִינ֔וֹת הָיְתָ֖ה לָמַֽס׃ \n" +
			"בָּכ֨וֹ תִבְכֶּ֜ה בַּלַּ֗יְלָה וְדִמְעָתָהּ֙ עַ֣ל לֶֽחֱיָ֔הּ אֵֽין־לָ֥הּ מְנַחֵ֖ם מִכָּל־אֹהֲבֶ֑יהָ כָּל־רֵעֶ֙יהָ֙ בָּ֣גְדוּ בָ֔הּ הָ֥יוּ לָ֖הּ לְאֹיְבִֽים׃ \n" +
			"גָּֽלְתָ֨ה יְהוּדָ֤ה מֵעֹ֙נִי֙ וּמֵרֹ֣ב עֲבֹדָ֔ה הִ֚יא יָשְׁבָ֣ה בַגּוֹיִ֔ם לֹ֥א מָצְאָ֖ה מָנ֑וֹחַ כָּל־רֹדְפֶ֥יהָ הִשִּׂיג֖וּהָ בֵּ֥ין הַמְּצָרִֽים׃ \n" +
			"דַּרְכֵ֨י צִיּ֜וֹן אֲבֵל֗וֹת מִבְּלִי֙ בָּאֵ֣י מוֹעֵ֔ד כָּל־שְׁעָרֶ֙יהָ֙ שֽׁוֹמֵמִ֔ין כֹּהֲנֶ֖יהָ נֶאֱנָחִ֑ים בְּתוּלֹתֶ֥יהָ נּוּג֖וֹת וְהִ֥יא מַר־לָֽהּ׃ \n" +
			"הָי֨וּ צָרֶ֤יהָ לְרֹאשׁ֙ אֹיְבֶ֣יהָ שָׁל֔וּ כִּֽי־יְהוָ֥ה הוֹגָ֖הּ עַ֣ל רֹב־פְּשָׁעֶ֑יהָ עוֹלָלֶ֛יהָ הָלְכ֥וּ שְׁבִ֖י לִפְנֵי־צָֽר׃ \n" +
			"וַיֵּצֵ֥א מִבַּת־צִיּ֖וֹן כָּל־הֲדָרָ֑הּ הָי֣וּ שָׂרֶ֗יהָ כְּאַיָּלִים֙ לֹא־מָצְא֣וּ מִרְעֶ֔ה וַיֵּלְכ֥וּ בְלֹא־כֹ֖חַ לִפְנֵ֥י רוֹדֵֽף׃ \n" +
			"זָֽכְרָ֣ה יְרוּשָׁלִַ֗ם יְמֵ֤י עָנְיָהּ֙ וּמְרוּדֶ֔יהָ כֹּ֚ל מַחֲמֻדֶ֔יהָ אֲשֶׁ֥ר הָי֖וּ מִ֣ימֵי קֶ֑דֶם בִּנְפֹ֧ל עַמָּ֣הּ בְּיַד־צָ֗ר וְאֵ֤ין עוֹזֵר֙ לָ֔הּ רָא֣וּהָ צָרִ֔ים שָׂחֲק֖וּ עַ֥ל מִשְׁבַּתֶּֽהָ׃ \n" +
			"חֵ֤טְא חָֽטְאָה֙ יְר֣וּשָׁלִַ֔ם עַל־כֵּ֖ן לְנִידָ֣ה הָיָ֑תָה כָּֽל־מְכַבְּדֶ֤יהָ הִזִּיל֙וּהָ֙ כִּי־רָא֣וּ עֶרְוָתָ֔הּ גַּם־הִ֥יא נֶאֶנְחָ֖ה וַתָּ֥שָׁב אָחֽוֹר׃ \n" +
			"טֻמְאָתָ֣הּ בְּשׁוּלֶ֗יהָ לֹ֤א זָֽכְרָה֙ אַחֲרִיתָ֔הּ וַתֵּ֣רֶד פְּלָאִ֔ים אֵ֥ין מְנַחֵ֖ם לָ֑הּ רְאֵ֤ה יְהוָה֙ אֶת־עָנְיִ֔י כִּ֥י הִגְדִּ֖יל אוֹיֵֽב׃ \n" +
			"יָדוֹ֙ פָּ֣רַשׂ צָ֔ר עַ֖ל כָּל־מַחֲמַדֶּ֑יהָ כִּֽי־רָאֲתָ֤ה גוֹיִם֙ בָּ֣אוּ מִקְדָּשָׁ֔הּ אֲשֶׁ֣ר צִוִּ֔יתָה לֹא־יָבֹ֥אוּ בַקָּהָ֖ל לָֽךְ׃ \n" +
			"כָּל־עַמָּ֤הּ נֶאֱנָחִים֙ מְבַקְּשִׁ֣ים לֶ֔חֶם נָתְנ֧וּ מַחֲמַדֵּיהֶ֛ם בְּאֹ֖כֶל לְהָשִׁ֣יב נָ֑פֶשׁ רְאֵ֤ה יְהוָה֙ וְֽהַבִּ֔יטָה כִּ֥י הָיִ֖יתִי זוֹלֵלָֽה׃ \n" +
			"ל֣וֹא אֲלֵיכֶם֮ כָּל־עֹ֣בְרֵי דֶרֶךְ֒ הַבִּ֣יטוּ וּרְא֗וּ אִם־יֵ֤שׁ מַכְאוֹב֙ כְּמַכְאֹבִ֔י אֲשֶׁ֥ר עוֹלַ֖ל לִ֑י אֲשֶׁר֙ הוֹגָ֣ה יְהוָ֔ה בְּי֖וֹם חֲר֥וֹן אַפּֽוֹ׃ \n" +
			"מִמָּר֛וֹם שָֽׁלַח־אֵ֥שׁ בְּעַצְמֹתַ֖י וַיִּרְדֶּ֑נָּה פָּרַ֨שׂ רֶ֤שֶׁת לְרַגְלַי֙ הֱשִׁיבַ֣נִי אָח֔וֹר נְתָנַ֙נִי֙ שֹֽׁמֵמָ֔ה כָּל־הַיּ֖וֹם דָּוָֽה׃ \n" +
			"נִשְׂקַד֩ עֹ֨ל פְּשָׁעַ֜י בְּיָד֗וֹ יִשְׂתָּֽרְג֛וּ עָל֥וּ עַל־צַוָּארִ֖י הִכְשִׁ֣יל כֹּחִ֑י נְתָנַ֣נִי אֲדֹנָ֔י בִּידֵ֖י לֹא־אוּכַ֥ל קֽוּם׃ \n" +
			"סִלָּ֨ה כָל־אַבִּירַ֤י ׀ אֲדֹנָי֙ בְּקִרְבִּ֔י קָרָ֥א עָלַ֛י מוֹעֵ֖ד לִשְׁבֹּ֣ר בַּחוּרָ֑י גַּ֚ת דָּרַ֣ךְ אֲדֹנָ֔י לִבְתוּלַ֖ת בַּת־יְהוּדָֽה׃ \n" +
			"עַל־אֵ֣לֶּה ׀ אֲנִ֣י בוֹכִיָּ֗ה עֵינִ֤י ׀ עֵינִי֙ יֹ֣רְדָה מַּ֔יִם כִּֽי־רָחַ֥ק מִמֶּ֛נִּי מְנַחֵ֖ם מֵשִׁ֣יב נַפְשִׁ֑י הָי֤וּ בָנַי֙ שֽׁוֹמֵמִ֔ים כִּ֥י גָבַ֖ר אוֹיֵֽב׃ \n" +
			"פֵּֽרְשָׂ֨ה צִיּ֜וֹן בְּיָדֶ֗יהָ אֵ֤ין מְנַחֵם֙ לָ֔הּ צִוָּ֧ה יְהוָ֛ה לְיַעֲקֹ֖ב סְבִיבָ֣יו צָרָ֑יו הָיְתָ֧ה יְרוּשָׁלִַ֛ם לְנִדָּ֖ה בֵּינֵיהֶֽם׃ \n" +
			"צַדִּ֥יק ה֛וּא יְהוָ֖ה כִּ֣י פִ֣יהוּ מָרִ֑יתִי שִׁמְעוּ־נָ֣א כָל־הָֽעַמִּ֗ים וּרְאוּ֙ מַכְאֹבִ֔י בְּתוּלֹתַ֥י וּבַחוּרַ֖י הָלְכ֥וּ בַשֶּֽׁבִי׃ \n" +
			"קָרָ֤אתִי לַֽמְאַהֲבַי֙ הֵ֣מָּה רִמּ֔וּנִי כֹּהֲנַ֥י וּזְקֵנַ֖י בָּעִ֣יר גָּוָ֑עוּ כִּֽי־בִקְשׁ֥וּ אֹ֙כֶל֙ לָ֔מוֹ וְיָשִׁ֖יבוּ אֶת־נַפְשָֽׁם׃ \n" +
			"רְאֵ֨ה יְהוָ֤ה כִּֽי־צַר־לִי֙ מֵעַ֣י חֳמַרְמָ֔רוּ נֶהְפַּ֤ךְ לִבִּי֙ בְּקִרְבִּ֔י כִּ֥י מָר֖וֹ מָרִ֑יתִי מִח֥וּץ שִׁכְּלָה־חֶ֖רֶב בַּבַּ֥יִת כַּמָּֽוֶת׃ \n" +
			"שָׁמְע֞וּ כִּ֧י נֶאֱנָחָ֣ה אָ֗נִי אֵ֤ין מְנַחֵם֙ לִ֔י כָּל־אֹ֨יְבַ֜י שָׁמְע֤וּ רָֽעָתִי֙ שָׂ֔שׂוּ כִּ֥י אַתָּ֖ה עָשִׂ֑יתָ הֵבֵ֥אתָ יוֹם־קָרָ֖אתָ וְיִֽהְי֥וּ כָמֽוֹנִי׃ \n" +
			"תָּבֹ֨א כָל־רָעָתָ֤ם לְפָנֶ֙יךָ֙ וְעוֹלֵ֣ל לָ֔מוֹ כַּאֲשֶׁ֥ר עוֹלַ֛לְתָּ לִ֖י עַ֣ל כָּל־פְּשָׁעָ֑י כִּֽי־רַבּ֥וֹת אַנְחֹתַ֖י וְלִבִּ֥י דַוָּֽי׃ \n\n" +
			"אֵיכָה֩ יָעִ֨יב בְּאַפּ֤וֹ ׀ אֲדֹנָי֙ אֶת־בַּת־צִיּ֔וֹן הִשְׁלִ֤יךְ מִשָּׁמַ֙יִם֙ אֶ֔רֶץ תִּפְאֶ֖רֶת יִשְׂרָאֵ֑ל וְלֹא־זָכַ֥ר הֲדֹם־רַגְלָ֖יו בְּי֥וֹם אַפּֽוֹ׃ \n" +
			"בִּלַּ֨ע אֲדֹנָ֜י וְלֹ֣א חָמַ֗ל אֵ֚ת כָּל־נְא֣וֹת יַעֲקֹ֔ב הָרַ֧ס בְּעֶבְרָת֛וֹ מִבְצְרֵ֥י בַת־יְהוּדָ֖ה הִגִּ֣יעַ לָאָ֑רֶץ חִלֵּ֥ל מַמְלָכָ֖ה וְשָׂרֶֽיהָ׃ \n" +
			"גָּדַ֣ע בָּֽחֳרִי אַ֗ף כֹּ֚ל קֶ֣רֶן יִשְׂרָאֵ֔ל הֵשִׁ֥יב אָח֛וֹר יְמִינ֖וֹ מִפְּנֵ֣י אוֹיֵ֑ב וַיִּבְעַ֤ר בְּיַעֲקֹב֙ כְּאֵ֣שׁ לֶֽהָבָ֔ה אָכְלָ֖ה סָבִֽיב׃ \n" +
			"דָּרַ֨ךְ קַשְׁתּ֜וֹ כְּאוֹיֵ֗ב נִצָּ֤ב יְמִינוֹ֙ כְּצָ֔ר וַֽיַּהֲרֹ֔ג כֹּ֖ל מַחֲמַדֵּי־עָ֑יִן בְּאֹ֙הֶל֙ בַּת־צִיּ֔וֹן שָׁפַ֥ךְ כָּאֵ֖שׁ חֲמָתֽוֹ׃ \n" +
			"הָיָ֨ה אֲדֹנָ֤י ׀ כְּאוֹיֵב֙ בִּלַּ֣ע יִשְׂרָאֵ֔ל בִּלַּע֙ כָּל־אַרְמְנוֹתֶ֔יהָ שִׁחֵ֖ת מִבְצָרָ֑יו וַיֶּ֙רֶב֙ בְּבַת־יְהוּדָ֔ה תַּאֲנִיָּ֖ה וַאֲנִיָּֽה׃ \n" +
			"וַיַּחְמֹ֤ס כַּגַּן֙ שֻׂכּ֔וֹ שִׁחֵ֖ת מוֹעֲד֑וֹ שִׁכַּ֨ח יְהוָ֤ה ׀ בְּצִיּוֹן֙ מוֹעֵ֣ד וְשַׁבָּ֔ת וַיִּנְאַ֥ץ בְּזַֽעַם־אַפּ֖וֹ מֶ֥לֶךְ וְכֹהֵֽן׃ \n" +
			"זָנַ֨ח אֲדֹנָ֤י ׀ מִזְבְּחוֹ֙ נִאֵ֣ר מִקְדָּשׁ֔וֹ הִסְגִּיר֙ בְּיַד־אוֹיֵ֔ב חוֹמֹ֖ת אַרְמְנוֹתֶ֑יהָ ק֛וֹל נָתְנ֥וּ בְּבֵית־יְהוָ֖ה כְּי֥וֹם מוֹעֵֽד׃ \n" +
			"חָשַׁ֨ב יְהוָ֤ה ׀ לְהַשְׁחִית֙ חוֹמַ֣ת בַּת־צִיּ֔וֹן נָ֣טָה קָ֔ו לֹא־הֵשִׁ֥יב יָד֖וֹ מִבַּלֵּ֑עַ וַיַּֽאֲבֶל־חֵ֥ל וְחוֹמָ֖ה יַחְדָּ֥ו אֻמְלָֽלוּ׃ \n" +
			"טָבְע֤וּ בָאָ֙רֶץ֙ שְׁעָרֶ֔יהָ אִבַּ֥ד וְשִׁבַּ֖ר בְּרִיחֶ֑יהָ מַלְכָּ֨הּ וְשָׂרֶ֤יהָ בַגּוֹיִם֙ אֵ֣ין תּוֹרָ֔ה גַּם־נְבִיאֶ֕יהָ לֹא־מָצְא֥וּ חָז֖וֹן מֵיְהוָֽה׃ \n" +
			"יֵשְׁב֨וּ לָאָ֤רֶץ יִדְּמוּ֙ זִקְנֵ֣י בַת־צִיּ֔וֹן הֶֽעֱל֤וּ עָפָר֙ עַל־רֹאשָׁ֔ם חָגְר֖וּ שַׂקִּ֑ים הוֹרִ֤ידוּ לָאָ֙רֶץ֙ רֹאשָׁ֔ן בְּתוּלֹ֖ת יְרוּשָׁלִָֽם׃ \n" +
			"כָּל֨וּ בַדְּמָע֤וֹת עֵינַי֙ חֳמַרְמְר֣וּ מֵעַ֔י נִשְׁפַּ֤ךְ לָאָ֙רֶץ֙ כְּבֵדִ֔י עַל־שֶׁ֖בֶר בַּת־עַמִּ֑י בֵּֽעָטֵ֤ף עוֹלֵל֙ וְיוֹנֵ֔ק בִּרְחֹב֖וֹת קִרְיָֽה׃ \n" +
			"לְאִמֹּתָם֙ יֹֽאמְר֔וּ אַיֵּ֖ה דָּגָ֣ן וָיָ֑יִן בְּהִֽתְעַטְּפָ֤ם כֶּֽחָלָל֙ בִּרְחֹב֣וֹת עִ֔יר בְּהִשְׁתַּפֵּ֣ךְ נַפְשָׁ֔ם אֶל־חֵ֖יק אִמֹּתָֽם׃ \n" +
			"מָֽה־אֲעִידֵ֞ךְ מָ֣ה אֲדַמֶּה־לָּ֗ךְ הַבַּת֙ יְר֣וּשָׁלִַ֔ם מָ֤ה אַשְׁוֶה־לָּךְ֙ וַאֲנַֽחֲמֵ֔ךְ בְּתוּלַ֖ת בַּת־צִיּ֑וֹן כִּֽי־גָד֥וֹל כַּיָּ֛ם שִׁבְרֵ֖ךְ מִ֥י יִרְפָּא־לָֽךְ׃ \n" +
			"נְבִיאַ֗יִךְ חָ֤זוּ לָךְ֙ שָׁ֣וְא וְתָפֵ֔ל וְלֹֽא־גִלּ֥וּ עַל־עֲוֺנֵ֖ךְ לְהָשִׁ֣יב שְׁבוּתֵ֑ךְ וַיֶּ֣חֱזוּ לָ֔ךְ מַשְׂא֥וֹת שָׁ֖וְא וּמַדּוּחִֽים׃ \n" +
			"סָֽפְק֨וּ עָלַ֤יִךְ כַּפַּ֙יִם֙ כָּל־עֹ֣בְרֵי דֶ֔רֶךְ שָֽׁרְקוּ֙ וַיָּנִ֣עוּ רֹאשָׁ֔ם עַל־בַּ֖ת יְרוּשָׁלִָ֑ם הֲזֹ֣את הָעִ֗יר שֶׁיֹּֽאמְרוּ֙ כְּלִ֣ילַת יֹ֔פִי מָשׂ֖וֹשׂ לְכָל־הָאָֽרֶץ׃ \n" +
			"פָּצ֨וּ עָלַ֤יִךְ פִּיהֶם֙ כָּל־א֣וֹיְבַ֔יִךְ שָֽׁרְקוּ֙ וַיַּֽחַרְקוּ־שֵׁ֔ן אָמְר֖וּ בִּלָּ֑עְנוּ אַ֣ךְ זֶ֥ה הַיּ֛וֹם שֶׁקִּוִּינֻ֖הוּ מָצָ֥אנוּ רָאִֽינוּ׃ \n" +
			"עָשָׂ֨ה יְהוָ֜ה אֲשֶׁ֣ר זָמָ֗ם בִּצַּ֤ע אֶמְרָתוֹ֙ אֲשֶׁ֣ר צִוָּ֣ה מִֽימֵי־קֶ֔דֶם הָרַ֖ס וְלֹ֣א חָמָ֑ל וַיְשַׂמַּ֤ח עָלַ֙יִךְ֙ אוֹיֵ֔ב הֵרִ֖ים קֶ֥רֶן צָרָֽיִךְ׃ \n" +
			"צָעַ֥ק לִבָּ֖ם אֶל־אֲדֹנָ֑י חוֹמַ֣ת בַּת־צִ֠יּוֹן הוֹרִ֨ידִי כַנַּ֤חַל דִּמְעָה֙ יוֹמָ֣ם וָלַ֔יְלָה אַֽל־תִּתְּנִ֤י פוּגַת֙ לָ֔ךְ אַל־תִּדֹּ֖ם בַּת־עֵינֵֽךְ׃ \n" +
			"ק֣וּמִי ׀ רֹ֣נִּי בַלַּ֗יְלָה לְרֹאשׁ֙ אַשְׁמֻר֔וֹת שִׁפְכִ֤י כַמַּ֙יִם֙ לִבֵּ֔ךְ נֹ֖כַח פְּנֵ֣י אֲדֹנָ֑י שְׂאִ֧י אֵלָ֣יו כַּפַּ֗יִךְ עַל־נֶ֙פֶשׁ֙ עֽוֹלָלַ֔יִךְ הָעֲטוּפִ֥ים בְּרָעָ֖ב בְּרֹ֥אשׁ כָּל־חוּצֽוֹת׃ \n" +
			"רְאֵ֤ה יְהוָה֙ וְֽהַבִּ֔יטָה לְמִ֖י עוֹלַ֣לְתָּ כֹּ֑ה אִם־תֹּאכַ֨לְנָה נָשִׁ֤ים פִּרְיָם֙ עֹלֲלֵ֣י טִפֻּחִ֔ים אִם־יֵהָרֵ֛ג בְּמִקְדַּ֥שׁ אֲדֹנָ֖י כֹּהֵ֥ן וְנָבִֽיא׃ \n" +
			"שָׁכְב֨וּ לָאָ֤רֶץ חוּצוֹת֙ נַ֣עַר וְזָקֵ֔ן בְּתוּלֹתַ֥י וּבַחוּרַ֖י נָפְל֣וּ בֶחָ֑רֶב הָרַ֙גְתָּ֙ בְּי֣וֹם אַפֶּ֔ךָ טָבַ֖חְתָּ לֹ֥א חָמָֽלְתָּ׃ \n" +
			"תִּקְרָא֩ כְי֨וֹם מוֹעֵ֤ד מְגוּרַי֙ מִסָּבִ֔יב וְלֹ֥א הָיָ֛ה בְּי֥וֹם אַף־יְהוָ֖ה פָּלִ֣יט וְשָׂרִ֑יד אֲשֶׁר־טִפַּ֥חְתִּי וְרִבִּ֖יתִי אֹיְבִ֥י כִלָּֽם׃ \n\n" +
			"אֲנִ֤י הַגֶּ֙בֶר֙ רָאָ֣ה עֳנִ֔י בְּשֵׁ֖בֶט עֶבְרָתֽוֹ׃ \n" +
			"אוֹתִ֥י נָהַ֛ג וַיֹּלַ֖ךְ חֹ֥שֶׁךְ וְלֹא־אֽוֹר׃ \n" +
			"אַ֣ךְ בִּ֥י יָשֻׁ֛ב יַהֲפֹ֥ךְ יָד֖וֹ כָּל־הַיּֽוֹם׃ \n" +
			"בִּלָּ֤ה בְשָׂרִי֙ וְעוֹרִ֔י שִׁבַּ֖ר עַצְמוֹתָֽי׃ \n" +
			"בָּנָ֥ה עָלַ֛י וַיַּקַּ֖ף רֹ֥אשׁ וּתְלָאָֽה׃ \n" +
			"בְּמַחֲשַׁכִּ֥ים הוֹשִׁיבַ֖נִי כְּמֵתֵ֥י עוֹלָֽם׃ \n" +
			"גָּדַ֧ר בַּעֲדִ֛י וְלֹ֥א אֵצֵ֖א הִכְבִּ֥יד נְחָשְׁתִּֽי׃ \n" +
			"גַּ֣ם כִּ֤י אֶזְעַק֙ וַאֲשַׁוֵּ֔עַ שָׂתַ֖ם תְּפִלָּתִֽי׃ \n" +
			"גָּדַ֤ר דְּרָכַי֙ בְּגָזִ֔ית נְתִיבֹתַ֖י עִוָּֽה׃ \n" +
			"דֹּ֣ב אֹרֵ֥ב הוּא֙ לִ֔י אֲרִ֖י בְּמִסְתָּרִֽים׃ \n" +
			"דְּרָכַ֥י סוֹרֵ֛ר וַֽיְפַשְּׁחֵ֖נִי שָׂמַ֥נִי שֹׁמֵֽם׃ \n" +
			"דָּרַ֤ךְ קַשְׁתוֹ֙ וַיַּצִּיבֵ֔נִי כַּמַּטָּרָ֖א לַחֵֽץ׃ \n" +
			"הֵבִיא֙ בְּכִלְיוֹתָ֔י בְּנֵ֖י אַשְׁפָּתֽוֹ׃ \n" +
			"הָיִ֤יתִי שְּׂחֹק֙ לְכָל־עַמִּ֔י נְגִינָתָ֖ם כָּל־הַיּֽוֹם׃ \n" +
			"הִשְׂבִּיעַ֥נִי בַמְּרוֹרִ֖ים הִרְוַ֥נִי לַעֲנָֽה׃ \n" +
			"וַיַּגְרֵ֤ס בֶּֽחָצָץ֙ שִׁנָּ֔י הִכְפִּישַׁ֖נִי בָּאֵֽפֶר׃ \n" +
			"וַתִּזְנַ֧ח מִשָּׁל֛וֹם נַפְשִׁ֖י נָשִׁ֥יתִי טוֹבָֽה׃ \n" +
			"וָאֹמַר֙ אָבַ֣ד נִצְחִ֔י וְתוֹחַלְתִּ֖י מֵיְהוָֽה׃ \n" +
			"זְכָר־עָנְיִ֥י וּמְרוּדִ֖י לַעֲנָ֥ה וָרֹֽאשׁ׃ \n" +
			"זָכ֣וֹר תִּזְכּ֔וֹר וְתָשׁ֥וֹחַ עָלַ֖י נַפְשִֽׁי׃ \n" +
			"זֹ֛את אָשִׁ֥יב אֶל־לִבִּ֖י עַל־כֵּ֥ן אוֹחִֽיל׃ \n" +
			"חַֽסְדֵ֤י יְהוָה֙ כִּ֣י לֹא־תָ֔מְנוּ כִּ֥י לֹא־כָל֖וּ רַחֲמָֽיו׃ \n" +
			"חֲדָשִׁים֙ לַבְּקָרִ֔ים רַבָּ֖ה אֱמוּנָתֶֽךָ׃ \n" +
			"חֶלְקִ֤י יְהוָה֙ אָמְרָ֣ה נַפְשִׁ֔י עַל־כֵּ֖ן אוֹחִ֥יל לֽוֹ׃ \n" +
			"ט֤וֹב יְהוָה֙ לְקוָֹ֔ו לְנֶ֖פֶשׁ תִּדְרְשֶֽׁנּוּ׃ \n" +
			"ט֤וֹב וְיָחִיל֙ וְדוּמָ֔ם לִתְשׁוּעַ֖ת יְהוָֽה׃ \n" +
			"ט֣וֹב לַגֶּ֔בֶר כִּֽי־יִשָּׂ֥א עֹ֖ל בִּנְעוּרָֽיו׃ \n" +
			"יֵשֵׁ֤ב בָּדָד֙ וְיִדֹּ֔ם כִּ֥י נָטַ֖ל עָלָֽיו׃ \n" +
			"יִתֵּ֤ן בֶּֽעָפָר֙ פִּ֔יהוּ אוּלַ֖י יֵ֥שׁ תִּקְוָֽה׃ \n" +
			"יִתֵּ֧ן לְמַכֵּ֛הוּ לֶ֖חִי יִשְׂבַּ֥ע בְּחֶרְפָּֽה׃ \n" +
			"כִּ֣י לֹ֥א יִזְנַ֛ח לְעוֹלָ֖ם אֲדֹנָֽי׃ \n" +
			"כִּ֣י אִם־הוֹגָ֔ה וְרִחַ֖ם כְּרֹ֥ב חֲסָדָֽיו׃ \n" +
			"כִּ֣י לֹ֤א עִנָּה֙ מִלִּבּ֔וֹ וַיַּגֶּ֖ה בְנֵי־אִֽישׁ׃ \n" +
			"לְדַכֵּא֙ תַּ֣חַת רַגְלָ֔יו כֹּ֖ל אֲסִ֥ירֵי אָֽרֶץ׃ \n" +
			"לְהַטּוֹת֙ מִשְׁפַּט־גָּ֔בֶר נֶ֖גֶד פְּנֵ֥י עֶלְיֽוֹן׃ \n" +
			"לְעַוֵּ֤ת אָדָם֙ בְּרִיב֔וֹ אֲדֹנָ֖י לֹ֥א רָאָֽה׃ \n" +
			"מִ֣י זֶ֤ה אָמַר֙ וַתֶּ֔הִי אֲדֹנָ֖י לֹ֥א צִוָּֽה׃ \n" +
			"מִפִּ֤י עֶלְיוֹן֙ לֹ֣א תֵצֵ֔א הָרָע֖וֹת וְהַטּֽוֹב׃ \n" +
			"מַה־יִּתְאוֹנֵן֙ אָדָ֣ם חָ֔י גֶּ֖בֶר עַל־חֲטָאָֽיו׃ \n" +
			"נַחְפְּשָׂ֤ה דְרָכֵ֙ינוּ֙ וְֽנַחְקֹ֔רָה וְנָשׁ֖וּבָה עַד־יְהוָֽה׃ \n" +
			"נִשָּׂ֤א לְבָבֵ֙נוּ֙ אֶל־כַּפָּ֔יִם אֶל־אֵ֖ל בַּשָּׁמָֽיִם׃ \n" +
			"נַ֤חְנוּ פָשַׁ֙עְנוּ֙ וּמָרִ֔ינוּ אַתָּ֖ה לֹ֥א סָלָֽחְתָּ׃ \n" +
			"סַכֹּ֤תָה בָאַף֙ וַֽתִּרְדְּפֵ֔נוּ הָרַ֖גְתָּ לֹ֥א חָמָֽלְתָּ׃ \n" +
			"סַכּ֤וֹתָה בֶֽעָנָן֙ לָ֔ךְ מֵעֲב֖וֹר תְּפִלָּֽה׃ \n" +
			"סְחִ֧י וּמָא֛וֹס תְּשִׂימֵ֖נוּ בְּקֶ֥רֶב הָעַמִּֽים׃ \n" +
			"פָּצ֥וּ עָלֵ֛ינוּ פִּיהֶ֖ם כָּל־אֹיְבֵֽינוּ׃ \n" +
			"פַּ֧חַד וָפַ֛חַת הָ֥יָה לָ֖נוּ הַשֵּׁ֥את וְהַשָּֽׁבֶר׃ \n" +
			"פַּלְגֵי־מַ֙יִם֙ תֵּרַ֣ד עֵינִ֔י עַל־שֶׁ֖בֶר בַּת־עַמִּֽי׃ \n" +
			"עֵינִ֧י נִגְּרָ֛ה וְלֹ֥א תִדְמֶ֖ה מֵאֵ֥ין הֲפֻגֽוֹת׃ \n" +
			"עַד־יַשְׁקִ֣יף וְיֵ֔רֶא יְהוָ֖ה מִשָּׁמָֽיִם׃ \n" +
			"עֵינִי֙ עֽוֹלְלָ֣ה לְנַפְשִׁ֔י מִכֹּ֖ל בְּנ֥וֹת עִירִֽי׃ \n" +
			"צ֥וֹד צָד֛וּנִי כַּצִּפּ֖וֹר אֹיְבַ֥י חִנָּֽם׃ \n" +
			"צָֽמְת֤וּ בַבּוֹר֙ חַיָּ֔י וַיַּדּוּ־אֶ֖בֶן בִּֽי׃ \n" +
			"צָֽפוּ־מַ֥יִם עַל־רֹאשִׁ֖י אָמַ֥רְתִּי נִגְזָֽרְתִּי׃ \n" +
			"קָרָ֤אתִי שִׁמְךָ֙ יְהוָ֔ה מִבּ֖וֹר תַּחְתִּיּֽוֹת׃ \n" +
			"קוֹלִ֖י שָׁמָ֑עְתָּ אַל־תַּעְלֵ֧ם אָזְנְךָ֛ לְרַוְחָתִ֖י לְשַׁוְעָתִֽי׃ \n" +
			"קָרַ֙בְתָּ֙ בְּי֣וֹם אֶקְרָאֶ֔ךָּ אָמַ֖רְתָּ אַל־תִּירָֽא׃ \n" +
			"רַ֧בְתָּ אֲדֹנָ֛י רִיבֵ֥י נַפְשִׁ֖י גָּאַ֥לְתָּ חַיָּֽי׃ \n" +
			"רָאִ֤יתָה יְהוָה֙ עַוָּ֣תָתִ֔י שָׁפְטָ֖ה מִשְׁפָּטִֽי׃ \n" +
			"רָאִ֙יתָה֙ כָּל־נִקְמָתָ֔ם כָּל־מַחְשְׁבֹתָ֖ם לִֽי׃ \n" +
			"שָׁמַ֤עְתָּ חֶרְפָּתָם֙ יְהוָ֔ה כָּל־מַחְשְׁבֹתָ֖ם עָלָֽי׃ \n" +
			"שִׂפְתֵ֤י קָמַי֙ וְהֶגְיוֹנָ֔ם עָלַ֖י כָּל־הַיּֽוֹם׃ \n" +
			"שִׁבְתָּ֤ם וְקִֽימָתָם֙ הַבִּ֔יטָה אֲנִ֖י מַנְגִּינָתָֽם׃ \n" +
			"תָּשִׁ֨יב לָהֶ֥ם גְּמ֛וּל יְהוָ֖ה כְּמַעֲשֵׂ֥ה יְדֵיהֶֽם׃ \n" +
			"תִּתֵּ֤ן לָהֶם֙ מְגִנַּת־לֵ֔ב תַּאֲלָֽתְךָ֖ לָהֶֽם׃ \n" +
			"תִּרְדֹּ֤ף בְּאַף֙ וְתַשְׁמִידֵ֔ם מִתַּ֖חַת שְׁמֵ֥י יְהוָֽה׃ \n\n" +
			"אֵיכָה֙ יוּעַ֣ם זָהָ֔ב יִשְׁנֶ֖א הַכֶּ֣תֶם הַטּ֑וֹב תִּשְׁתַּפֵּ֙כְנָה֙ אַבְנֵי־קֹ֔דֶשׁ בְּרֹ֖אשׁ כָּל־חוּצֽוֹת׃ \n" +
			"בְּנֵ֤י צִיּוֹן֙ הַיְקָרִ֔ים הַמְסֻלָּאִ֖ים בַּפָּ֑ז אֵיכָ֤ה נֶחְשְׁבוּ֙ לְנִבְלֵי־חֶ֔רֶשׂ מַעֲשֵׂ֖ה יְדֵ֥י יוֹצֵֽר׃ \n" +
			"גַּם־תַּנִּים֙ חָ֣לְצוּ שַׁ֔ד הֵינִ֖יקוּ גּוּרֵיהֶ֑ן בַּת־עַמִּ֣י לְאַכְזָ֔ר כַּיְעֵנִ֖ים בַּמִּדְבָּֽר׃ \n" +
			"דָּבַ֨ק לְשׁ֥וֹן יוֹנֵ֛ק אֶל־חִכּ֖וֹ בַּצָּמָ֑א עֽוֹלָלִים֙ שָׁ֣אֲלוּ לֶ֔חֶם פֹּרֵ֖שׂ אֵ֥ין לָהֶֽם׃ \n" +
			"הָאֹֽכְלִים֙ לְמַ֣עֲדַנִּ֔ים נָשַׁ֖מּוּ בַּחוּצ֑וֹת הָאֱמֻנִים֙ עֲלֵ֣י תוֹלָ֔ע חִבְּק֖וּ אַשְׁפַּתּֽוֹת׃ \n" +
			"וַיִּגְדַּל֙ עֲוֺ֣ן בַּת־עַמִּ֔י מֵֽחַטַּ֖את סְדֹ֑ם הַֽהֲפוּכָ֣ה כְמוֹ־רָ֔גַע וְלֹא־חָ֥לוּ בָ֖הּ יָדָֽיִם׃ \n" +
			"זַכּ֤וּ נְזִירֶ֙יהָ֙ מִשֶּׁ֔לֶג צַח֖וּ מֵחָלָ֑ב אָ֤דְמוּ עֶ֙צֶם֙ מִפְּנִינִ֔ים סַפִּ֖יר גִּזְרָתָֽם׃ \n" +
			"חָשַׁ֤ךְ מִשְּׁחוֹר֙ תָּֽאֳרָ֔ם לֹ֥א נִכְּר֖וּ בַּחוּצ֑וֹת צָפַ֤ד עוֹרָם֙ עַל־עַצְמָ֔ם יָבֵ֖שׁ הָיָ֥ה כָעֵֽץ׃ \n" +
			"טוֹבִ֤ים הָיוּ֙ חַלְלֵי־חֶ֔רֶב מֵֽחַלְלֵ֖י רָעָ֑ב שֶׁ֣הֵ֤ם יָז֙וּבוּ֙ מְדֻקָּרִ֔ים מִתְּנוּבֹ֖ת שָׂדָֽי׃ \n" +
			"יְדֵ֗י נָשִׁים֙ רַחֲמָ֣נִיּ֔וֹת בִּשְּׁל֖וּ יַלְדֵיהֶ֑ן הָי֤וּ לְבָרוֹת֙ לָ֔מוֹ בְּשֶׁ֖בֶר בַּת־עַמִּֽי׃ \n" +
			"כִּלָּ֤ה יְהוָה֙ אֶת־חֲמָת֔וֹ שָׁפַ֖ךְ חֲר֣וֹן אַפּ֑וֹ וַיַּצֶּת־אֵ֣שׁ בְּצִיּ֔וֹן וַתֹּ֖אכַל יְסוֹדֹתֶֽיהָ׃ \n" +
			"לֹ֤א הֶאֱמִ֙ינוּ֙ מַלְכֵי־אֶ֔רֶץ כֹּ֖ל יֹשְׁבֵ֣י תֵבֵ֑ל כִּ֤י יָבֹא֙ צַ֣ר וְאוֹיֵ֔ב בְּשַׁעֲרֵ֖י יְרוּשָׁלִָֽם׃ \n" +
			"מֵֽחַטֹּ֣את נְבִיאֶ֔יהָ עֲוֺנ֖וֹת כֹּהֲנֶ֑יהָ הַשֹּׁפְכִ֥ים בְּקִרְבָּ֖הּ דַּ֥ם צַדִּיקִֽים׃ \n" +
			"נָע֤וּ עִוְרִים֙ בַּֽחוּצ֔וֹת נְגֹֽאֲל֖וּ בַּדָּ֑ם בְּלֹ֣א יֽוּכְל֔וּ יִגְּע֖וּ בִּלְבֻשֵׁיהֶֽם׃ \n" +
			"ס֣וּרוּ טָמֵ֞א קָ֣רְאוּ לָ֗מוֹ ס֤וּרוּ ס֙וּרוּ֙ אַל־תִּגָּ֔עוּ כִּ֥י נָצ֖וּ גַּם־נָ֑עוּ אָֽמְרוּ֙ בַּגּוֹיִ֔ם לֹ֥א יוֹסִ֖יפוּ לָגֽוּר׃ \n" +
			"פְּנֵ֤י יְהוָה֙ חִלְּקָ֔ם לֹ֥א יוֹסִ֖יף לְהַבִּיטָ֑ם פְּנֵ֤י כֹהֲנִים֙ לֹ֣א נָשָׂ֔אוּ וּזְקֵנִ֖ים לֹ֥א חָנָֽנוּ׃ \n" +
			"עוֹדֵ֙ינוּ֙ תִּכְלֶ֣ינָה עֵינֵ֔ינוּ אֶל־עֶזְרָתֵ֖נוּ הָ֑בֶל בְּצִפִּיָּתֵ֣נוּ צִפִּ֔ינוּ אֶל־גּ֖וֹי לֹ֥א יוֹשִֽׁעַ׃ \n" +
			"צָד֣וּ צְעָדֵ֔ינוּ מִלֶּ֖כֶת בִּרְחֹבֹתֵ֑ינוּ קָרַ֥ב קִצֵּ֛ינוּ מָלְא֥וּ יָמֵ֖ינוּ כִּי־בָ֥א קִצֵּֽינוּ׃ \n" +
			"קַלִּ֤ים הָיוּ֙ רֹדְפֵ֔ינוּ מִנִּשְׁרֵ֖י שָׁמָ֑יִם עַל־הֶהָרִ֣ים דְּלָקֻ֔נוּ בַּמִּדְבָּ֖ר אָ֥רְבוּ לָֽנוּ׃ \n" +
			"ר֤וּחַ אַפֵּ֙ינוּ֙ מְשִׁ֣יחַ יְהוָ֔ה נִלְכַּ֖ד בִּשְׁחִיתוֹתָ֑ם אֲשֶׁ֣ר אָמַ֔רְנוּ בְּצִלּ֖וֹ נִֽחְיֶ֥ה בַגּוֹיִֽם׃ \n" +
			"שִׂ֤ישִׂי וְשִׂמְחִי֙ בַּת־אֱד֔וֹם יוֹשֶׁ֖בֶת בְּאֶ֣רֶץ ע֑וּץ גַּם־עָלַ֙יִךְ֙ תַּעֲבָר־כּ֔וֹס תִּשְׁכְּרִ֖י וְתִתְעָרִֽי׃ \n" +
			"תַּם־עֲוֺנֵךְ֙ בַּת־צִיּ֔וֹן לֹ֥א יוֹסִ֖יף לְהַגְלוֹתֵ֑ךְ פָּקַ֤ד עֲוֺנֵךְ֙ בַּת־אֱד֔וֹם גִּלָּ֖ה עַל־חַטֹּאתָֽיִךְ׃ \n\n" +
			"זְכֹ֤ר יְהוָה֙ מֶֽה־הָ֣יָה לָ֔נוּ הַבִּ֖יטָה וּרְאֵ֥ה אֶת־חֶרְפָּתֵֽנוּ׃ \n" +
			"נַחֲלָתֵ֙נוּ֙ נֶֽהֶפְכָ֣ה לְזָרִ֔ים בָּתֵּ֖ינוּ לְנָכְרִֽים׃ \n" +
			"יְתוֹמִ֤ים הָיִ֙ינוּ֙ וְאֵ֣ין אָ֔ב אִמֹּתֵ֖ינוּ כְּאַלְמָנֽוֹת׃ \n" +
			"מֵימֵ֙ינוּ֙ בְּכֶ֣סֶף שָׁתִ֔ינוּ עֵצֵ֖ינוּ בִּמְחִ֥יר יָבֹֽאוּ׃ \n" +
			"עַ֤ל צַוָּארֵ֙נוּ֙ נִרְדָּ֔פְנוּ יָגַ֖עְנוּ וְלֹ֥א הֽוּנַ֖ח לָֽנוּ׃ \n" +
			"מִצְרַ֙יִם֙ נָתַ֣נּוּ יָ֔ד אַשּׁ֖וּר לִשְׂבֹּ֥עַֽ לָֽחֶם׃ \n" +
			"אֲבֹתֵ֤ינוּ חָֽטְאוּ֙ וְאֵינָ֔ם וַאֲנַ֖חְנוּ עֲוֺנֹתֵיהֶ֥ם סָבָֽלְנוּ׃ \n" +
			"עֲבָדִים֙ מָ֣שְׁלוּ בָ֔נוּ פֹּרֵ֖ק אֵ֥ין מִיָּדָֽם׃ \n" +
			"בְּנַפְשֵׁ֙נוּ֙ נָבִ֣יא לַחְמֵ֔נוּ מִפְּנֵ֖י חֶ֥רֶב הַמִּדְבָּֽר׃ \n" +
			"עוֹרֵ֙נוּ֙ כְּתַנּ֣וּר נִכְמָ֔רוּ מִפְּנֵ֖י זַלְעֲפ֥וֹת רָעָֽב׃ \n" +
			"נָשִׁים֙ בְּצִיּ֣וֹן עִנּ֔וּ בְּתֻלֹ֖ת בְּעָרֵ֥י יְהוּדָֽה׃ \n" +
			"שָׂרִים֙ בְּיָדָ֣ם נִתְל֔וּ פְּנֵ֥י זְקֵנִ֖ים לֹ֥א נֶהְדָּֽרוּ׃ \n" +
			"בַּחוּרִים֙ טְח֣וֹן נָשָׂ֔אוּ וּנְעָרִ֖ים בָּעֵ֥ץ כָּשָֽׁלוּ׃ \n" +
			"זְקֵנִים֙ מִשַּׁ֣עַר שָׁבָ֔תוּ בַּחוּרִ֖ים מִנְּגִינָתָֽם׃ \n" +
			"שָׁבַת֙ מְשׂ֣וֹשׂ לִבֵּ֔נוּ נֶהְפַּ֥ךְ לְאֵ֖בֶל מְחֹלֵֽנוּ׃ \n" +
			"נָֽפְלָה֙ עֲטֶ֣רֶת רֹאשֵׁ֔נוּ אֽוֹי־נָ֥א לָ֖נוּ כִּ֥י חָטָֽאנוּ׃ \n" +
			"עַל־זֶ֗ה הָיָ֤ה דָוֶה֙ לִבֵּ֔נוּ עַל־אֵ֖לֶּה חָשְׁכ֥וּ עֵינֵֽינוּ׃ \n" +
			"עַ֤ל הַר־צִיּוֹן֙ שֶׁשָּׁמֵ֔ם שׁוּעָלִ֖ים הִלְּכוּ־בֽוֹ׃ \n" +
			"אַתָּ֤ה יְהוָה֙ לְעוֹלָ֣ם תֵּשֵׁ֔ב כִּסְאֲךָ֖ לְדֹ֥ר וָדֽוֹר׃ \n" +
			"לָ֤מָּה לָנֶ֙צַח֙ תִּשְׁכָּחֵ֔נוּ תַּֽעַזְבֵ֖נוּ לְאֹ֥רֶךְ יָמִֽים׃ \n" +
			"הֲשִׁיבֵ֨נוּ יְהוָ֤ה ׀ אֵלֶ֙יךָ֙ וְֽנָשׁ֔וּבָה חַדֵּ֥שׁ יָמֵ֖ינוּ כְּקֶֽדֶם׃ \n" +
			"כִּ֚י אִם־מָאֹ֣ס מְאַסְתָּ֔נוּ קָצַ֥פְתָּ עָלֵ֖ינוּ עַד־מְאֹֽד׃ \n" +
			"[הֲשִׁיבֵ֨נוּ יְהוָ֤ה ׀ אֵלֶ֙יךָ֙ וְֽנָשׁ֔וּבָה חַדֵּ֥שׁ יָמֵ֖ינוּ כְּקֶֽדֶם׃]");
	}

	/**
	 * NOTE: Night prayer. The Date should be set to the next day.
	 */
	public ArrayList<HighlightString> getArvitPrayers() {
		siddur = new ArrayList<>();

		if (jewishDateInfo.getJewishCalendar().isAssurBemelacha()) {
			addToSiddur("Shabbat and Yom Tov are currently not supported/שבת ויום טוב כרגע אינם נתמכים");
			addToSiddurHighlighted("Open Sefaria Siddur/פתח את סידור ספריה");
			return siddur;
		}

		String fireFromHeaven = "אוֹי כִּי יָרַד אֵשׁ מִן הַשָּׁמַיִם. לִירוּשָׁלַיִם עֵינִי עֵינִי יוֹרְדָה מַּיִם: (לִירוּשָׁלַיִם עֵינִי עֵינִי יוֹרְדָה מַּיִם) \n\n" +
				"טִירַת קֹדֶש אֵיךְ נְשַׁמָּה. יוֹשֵׁב בַּשָּׁמַיִם עַד מָה. בַּת מֶלֶךְ אָמָה. הַקְּדֵשָׁה הִיא בָעֵינַיִם: לִירוּשָׁלַיִם. עֵינִי עֵינִי יוֹרְדָה מַּיִם: (לִירוּשָׁלַיִם עֵינִי עֵינִי יוֹרְדָה מַּיִם) \n\n" +
				"יֶרַח אָב בּוֹ־שִֽׁמְשִׁי קָדַר. אַהֲרֹן הַכֹּהֵן בּוֹ נֶעְדָּר. וְגַם עִיר הֶהָדָר. בּוֹ חָֽרְבָה פַּעֲמָיִם: לִירוּשָׁלַיִם. עֵינִי עֵינִי יוֹרְדָה מַּיִם: (לִירוּשָׁלַיִם עֵינִי עֵינִי יוֹרְדָה מַּיִם) \n\n" +
				"מָרָה הַלַּיְלָה הַזֶּה אָרִים. וַיְהִי לִבְכִי לֵיל שִׁמּוּרִים. וְאוֹתִי הֶחֱרִים. אֵל מוֹצִיאָם מִמִּצְרַיִם: לִירוּשָׁלַיִם. עֵינִי עֵינִי יוֹרְדָה מַּיִם: (לִירוּשָׁלַיִם עֵינִי עֵינִי יוֹרְדָה מַּיִם) \n\n" +
				"(יִבָּקַע אוֹרִי יָהּ כַּשַּׁחַר. עַל רְשָׁעִים צוּר אַפּוֹ יִחַר. וּבְעַמּוֹ יִבְחַר. הַבּוֹחֵר בִּירוּשָׁלַיִם: (וּבְעַמּוֹ יִבְחַר. הַבּוֹחֵר בִּירוּשָׁלַיִם))";

		if (jewishDateInfo.getJewishCalendar().isRoshChodesh()) {
			addToSiddur(
				"בָּרְכִ֥י נַפְשִׁ֗י אֶת־יְהֹ֫וָ֥ה יְהֹוָ֣ה אֱ֭לֹהַי גָּדַ֣לְתָּ מְּאֹ֑ד ה֖וֹד וְהָדָ֣ר לָבָֽשְׁתָּ׃ עֹֽטֶה־א֭וֹר כַּשַּׂלְמָ֑ה נוֹטֶ֥ה שָׁ֝מַ֗יִם כַּיְרִיעָֽה׃ הַ֥מְקָרֶ֥ה בַמַּ֗יִם עֲֽלִיּ֫וֹתָ֥יו הַשָּׂם־עָבִ֥ים רְכוּב֑וֹ הַֽ֝מְהַלֵּ֗ךְ עַל־כַּנְפֵי־רֽוּחַ׃ עֹשֶׂ֣ה מַלְאָכָ֣יו רוּח֑וֹת מְ֝שָׁרְתָ֗יו אֵ֣שׁ לֹהֵֽט׃ יָֽסַד־אֶ֭רֶץ עַל־מְכוֹנֶ֑יהָ בַּל־תִּ֝מּ֗וֹט עוֹלָ֥ם וָעֶֽד׃ תְּ֭הוֹם כַּלְּב֣וּשׁ כִּסִּית֑וֹ עַל־הָ֝רִ֗ים יַ֖עַמְדוּ מָֽיִם׃ מִן־גַּעֲרָ֣תְךָ֣ יְנוּס֑וּן מִן־ק֥וֹל רַֽ֝עַמְךָ֗ יֵחָפֵזֽוּן׃ יַעֲל֣וּ הָ֭רִים יֵרְד֣וּ בְקָע֑וֹת אֶל־מְ֝ק֗וֹם זֶ֤ה ׀ יָסַ֬דְתָּ לָהֶֽם׃ גְּֽבוּל־שַׂ֭מְתָּ בַּל־יַעֲבֹר֑וּן בַּל־יְ֝שֻׁב֗וּן לְכַסּ֥וֹת הָאָֽרֶץ׃ הַֽמְשַׁלֵּ֣חַ מַ֭עְיָנִים בַּנְּחָלִ֑ים בֵּ֥ין הָ֝רִ֗ים יְהַלֵּכֽוּן׃ יַ֭שְׁקוּ כׇּל־חַיְת֣וֹ שָׂדָ֑י יִשְׁבְּר֖וּ פְרָאִ֣ים צְמָאָֽם׃ עֲ֭לֵיהֶם עוֹף־הַשָּׁמַ֣יִם יִשְׁכּ֑וֹן מִבֵּ֥ין עֳ֝פָאיִ֗ם יִתְּנוּ־קֽוֹל׃ מַשְׁקֶ֣ה הָ֭רִים מֵעֲלִיּוֹתָ֑יו מִפְּרִ֥י מַ֝עֲשֶׂ֗יךָ תִּשְׂבַּ֥ע הָאָֽרֶץ׃ מַצְמִ֤יחַ חָצִ֨יר ׀ לַבְּהֵמָ֗ה וְ֭עֵשֶׂב לַעֲבֹדַ֣ת הָאָדָ֑ם לְה֥וֹצִיא לֶ֗֝חֶם מִן־הָאָֽרֶץ׃ וְיַ֤יִן ׀ יְשַׂמַּ֬ח לְֽבַב־אֱנ֗וֹשׁ לְהַצְהִ֣יל פָּנִ֣ים מִשָּׁ֑מֶן וְ֝לֶ֗חֶם לְֽבַב־אֱנ֥וֹשׁ יִסְעָֽד׃ יִ֭שְׂבְּעוּ עֲצֵ֣י יְהֹוָ֑ה אַֽרְזֵ֥י לְ֝בָנ֗וֹן אֲשֶׁ֣ר נָטָֽע׃ אֲשֶׁר־שָׁ֭ם צִפֳּרִ֣ים יְקַנֵּ֑נוּ חֲ֝סִידָ֗ה בְּרוֹשִׁ֥ים בֵּיתָֽהּ׃ הָרִ֣ים הַ֭גְּבֹהִים לַיְּעֵלִ֑ים סְ֝לָעִ֗ים מַחְסֶ֥ה לַֽשְׁפַנִּֽים׃ עָשָׂ֣ה יָ֭רֵחַ לְמוֹעֲדִ֑ים שֶׁ֝֗מֶשׁ יָדַ֥ע מְבוֹאֽוֹ׃ תָּֽשֶׁת־חֹ֭שֶׁךְ וִ֣יהִי לָ֑יְלָה בּוֹ־תִ֝רְמֹ֗שׂ כׇּל־חַיְתוֹ־יָֽעַר׃ הַ֭כְּפִירִים שֹׁאֲגִ֣ים לַטָּ֑רֶף וּלְבַקֵּ֖שׁ מֵאֵ֣ל אׇכְלָֽם׃ תִּזְרַ֣ח הַ֭שֶּׁמֶשׁ יֵאָסֵפ֑וּן וְאֶל־מְ֝עוֹנֹתָ֗ם יִרְבָּצֽוּן׃ יֵצֵ֣א אָדָ֣ם לְפׇעֳל֑וֹ וְֽלַעֲבֹ֖דָת֣וֹ עֲדֵי־עָֽרֶב׃ מָה־רַבּ֬וּ מַעֲשֶׂ֨יךָ ׀ יְֽהֹוָ֗ה כֻּ֭לָּם בְּחׇכְמָ֣ה עָשִׂ֑יתָ מָלְאָ֥ה הָ֝אָ֗רֶץ קִנְיָנֶֽךָ׃ זֶ֤ה ׀ הַיָּ֥ם גָּדוֹל֮ וּרְחַ֢ב יָ֫דָ֥יִם שָֽׁם־רֶ֭מֶשׂ וְאֵ֣ין מִסְפָּ֑ר חַיּ֥וֹת קְ֝טַנּ֗וֹת עִם־גְּדֹלֽוֹת׃ שָׁ֭ם אֳנִיּ֣וֹת יְהַלֵּכ֑וּן לִ֝וְיָתָ֗ן זֶֽה־יָצַ֥רְתָּ לְשַֽׂחֶק־בּֽוֹ׃ כֻּ֭לָּם אֵלֶ֣יךָ יְשַׂבֵּר֑וּן לָתֵ֖ת אׇכְלָ֣ם בְּעִתּֽוֹ׃ תִּתֵּ֣ן לָ֭הֶם יִלְקֹט֑וּן תִּפְתַּ֥ח יָ֝דְךָ֗ יִשְׂבְּע֥וּן טֽוֹב׃ תַּסְתִּ֥יר פָּנֶיךָ֮ יִֽבָּהֵ֫ל֥וּן תֹּסֵ֣ף ר֭וּחָם יִגְוָע֑וּן וְֽאֶל־עֲפָרָ֥ם יְשׁוּבֽוּן׃ תְּשַׁלַּ֣ח ר֭וּחֲךָ יִבָּרֵא֑וּן וּ֝תְחַדֵּ֗שׁ פְּנֵ֣י אֲדָמָֽה׃ יְהִ֤י כְב֣וֹד יְהֹוָ֣ה לְעוֹלָ֑ם יִשְׂמַ֖ח יְהֹוָ֣ה בְּמַעֲשָֽׂיו׃ הַמַּבִּ֣יט לָ֭אָרֶץ וַתִּרְעָ֑ד יִגַּ֖ע בֶּהָרִ֣ים וְֽיֶעֱשָֽׁנוּ׃ אָשִׁ֣ירָה לַיהֹוָ֣ה בְּחַיָּ֑י אֲזַמְּרָ֖ה לֵאלֹהַ֣י בְּעוֹדִֽי׃ יֶעֱרַ֣ב עָלָ֣יו שִׂיחִ֑י אָ֝נֹכִ֗י אֶשְׂמַ֥ח בַּיהֹוָֽה׃ יִתַּ֤מּוּ חַטָּאִ֨ים ׀ מִן־הָאָ֡רֶץ וּרְשָׁעִ֤ים ׀ ע֤וֹד אֵינָ֗ם בָּרְכִ֣י נַ֭פְשִׁי אֶת־יְהֹוָ֗ה הַֽלְלוּיָֽהּ׃");
		} else if (jewishDateInfo.getJewishCalendar().isPurim()) {
			addToSiddur(
				"לַ֭מְנַצֵּחַ עַל־אַיֶּ֥לֶת הַשַּׁ֗חַר מִזְמ֥וֹר לְדָוִֽד׃ אֵלִ֣י אֵ֭לִי לָמָ֣ה עֲזַבְתָּ֑נִי רָח֥וֹק מִֽ֝ישׁוּעָתִ֗י דִּבְרֵ֥י שַׁאֲגָתִֽי׃ אֱֽלֹהַ֗י אֶקְרָ֣א י֭וֹמָם וְלֹ֣א תַעֲנֶ֑ה וְ֝לַ֗יְלָה וְֽלֹא־דֻֽמִיָּ֥ה לִֽי׃ וְאַתָּ֥ה קָד֑וֹשׁ י֝וֹשֵׁ֗ב תְּהִלּ֥וֹת יִשְׂרָאֵֽל׃ בְּ֭ךָ בָּטְח֣וּ אֲבֹתֵ֑ינוּ בָּ֝טְח֗וּ וַֽתְּפַלְּטֵֽמוֹ׃ אֵלֶ֣יךָ זָעֲק֣וּ וְנִמְלָ֑טוּ בְּךָ֖ בָטְח֣וּ וְלֹא־בֽוֹשׁוּ׃ וְאָנֹכִ֣י תוֹלַ֣עַת וְלֹא־אִ֑ישׁ חֶרְפַּ֥ת אָ֝דָ֗ם וּבְז֥וּי עָֽם׃ כׇּל־רֹ֭אַי יַלְעִ֣גוּ לִ֑י יַפְטִ֥ירוּ בְ֝שָׂפָ֗ה יָנִ֥יעוּ רֹֽאשׁ׃ גֹּ֣ל אֶל־יְהֹוָ֣ה יְפַלְּטֵ֑הוּ יַ֝צִּילֵ֗הוּ כִּ֘י חָ֥פֵֽץ בּֽוֹ׃ כִּֽי־אַתָּ֣ה גֹחִ֣י מִבָּ֑טֶן מַ֝בְטִיחִ֗י עַל־שְׁדֵ֥י אִמִּֽי׃ עָ֭לֶיךָ הׇשְׁלַ֣כְתִּי מֵרָ֑חֶם מִבֶּ֥טֶן אִ֝מִּ֗י אֵ֣לִי אָֽתָּה׃ אַל־תִּרְחַ֣ק מִ֭מֶּנִּי כִּי־צָרָ֣ה קְרוֹבָ֑ה כִּי־אֵ֥ין עוֹזֵֽר׃ סְ֭בָבוּנִי פָּרִ֣ים רַבִּ֑ים אַבִּירֵ֖י בָשָׁ֣ן כִּתְּרֽוּנִי׃ פָּצ֣וּ עָלַ֣י פִּיהֶ֑ם אַ֝רְיֵ֗ה טֹרֵ֥ף וְשֹׁאֵֽג׃ כַּמַּ֥יִם נִשְׁפַּכְתִּי֮ וְהִתְפָּֽרְד֗וּ כׇּֽל־עַצְמ֫וֹתָ֥י הָיָ֣ה לִ֭בִּי כַּדּוֹנָ֑ג נָ֝מֵ֗ס בְּת֣וֹךְ מֵעָֽי׃ יָ֘בֵ֤שׁ כַּחֶ֨רֶשׂ ׀ כֹּחִ֗י וּ֭לְשׁוֹנִי מֻדְבָּ֣ק מַלְקוֹחָ֑י וְֽלַעֲפַר־מָ֥וֶת תִּשְׁפְּתֵֽנִי׃ כִּ֥י סְבָב֗וּנִי כְּלָ֫בִ֥ים עֲדַ֣ת מְ֭רֵעִים הִקִּיפ֑וּנִי כָּ֝אֲרִ֗י יָדַ֥י וְרַגְלָֽי׃ אֲסַפֵּ֥ר כׇּל־עַצְמוֹתָ֑י הֵ֥מָּה יַ֝בִּ֗יטוּ יִרְאוּ־בִֽי׃ יְחַלְּק֣וּ בְגָדַ֣י לָהֶ֑ם וְעַל־לְ֝בוּשִׁ֗י יַפִּ֥ילוּ גוֹרָֽל׃ וְאַתָּ֣ה יְ֭הֹוָה אַל־תִּרְחָ֑ק אֱ֝יָלוּתִ֗י לְעֶזְרָ֥תִי חֽוּשָׁה׃ הַצִּ֣ילָה מֵחֶ֣רֶב נַפְשִׁ֑י מִיַּד־כֶּ֝֗לֶב יְחִידָתִֽי׃ ה֭וֹשִׁיעֵנִי מִפִּ֣י אַרְיֵ֑ה וּמִקַּרְנֵ֖י רֵמִ֣ים עֲנִיתָֽנִי׃ אֲסַפְּרָ֣ה שִׁמְךָ֣ לְאֶחָ֑י בְּת֖וֹךְ קָהָ֣ל אֲהַלְלֶֽךָּ׃ יִרְאֵ֤י יְהֹוָ֨ה ׀ הַֽלְל֗וּהוּ כׇּל־זֶ֣רַע יַעֲקֹ֣ב כַּבְּד֑וּהוּ וְג֥וּרוּ מִ֝מֶּ֗נּוּ כׇּל־זֶ֥רַע יִשְׂרָאֵֽל׃ כִּ֤י לֹֽא־בָזָ֨ה וְלֹ֪א שִׁקַּ֡ץ עֱנ֬וּת עָנִ֗י וְלֹא־הִסְתִּ֣יר פָּנָ֣יו מִמֶּ֑נּוּ וּֽבְשַׁוְּע֖וֹ אֵלָ֣יו שָׁמֵֽעַ׃ מֵ֥אִתְּךָ֗ תְּֽהִלָּ֫תִ֥י בְּקָהָ֥ל רָ֑ב נְדָרַ֥י אֲ֝שַׁלֵּ֗ם נֶ֣גֶד יְרֵאָֽיו׃ יֹאכְל֬וּ עֲנָוִ֨ים ׀ וְיִשְׂבָּ֗עוּ יְהַֽלְל֣וּ יְ֭הֹוָה דֹּ֣רְשָׁ֑יו יְחִ֖י לְבַבְכֶ֣ם לָעַֽד׃ יִזְכְּר֤וּ ׀ וְיָשֻׁ֣בוּ אֶל־יְ֭הֹוָה כׇּל־אַפְסֵי־אָ֑רֶץ וְיִֽשְׁתַּחֲו֥וּ לְ֝פָנֶ֗יךָ כׇּֽל־מִשְׁפְּח֥וֹת גּוֹיִֽם׃ כִּ֣י לַ֭יהֹוָה הַמְּלוּכָ֑ה וּ֝מֹשֵׁ֗ל בַּגּוֹיִֽם׃ אָכְל֬וּ וַיִּֽשְׁתַּחֲו֨וּ ׀ כׇּֽל־דִּשְׁנֵי־אֶ֗רֶץ לְפָנָ֣יו יִ֭כְרְעוּ כׇּל־יוֹרְדֵ֣י עָפָ֑ר וְ֝נַפְשׁ֗וֹ לֹ֣א חִיָּֽה׃ זֶ֥רַע יַֽעַבְדֶ֑נּוּ יְסֻפַּ֖ר לַֽאדֹנָ֣י לַדּֽוֹר׃ יָ֭בֹאוּ וְיַגִּ֣ידוּ צִדְקָת֑וֹ לְעַ֥ם נ֝וֹלָ֗ד כִּ֣י עָשָֽׂה׃");
		} else if (jewishDateInfo.getJewishCalendar().isTishaBav()) {
			addToSiddur(
				"עַ֥ל נַהֲר֨וֹת ׀ בָּבֶ֗ל שָׁ֣ם יָ֭שַׁבְנוּ גַּם־בָּכִ֑ינוּ בְּ֝זָכְרֵ֗נוּ אֶת־צִיּֽוֹן׃ עַֽל־עֲרָבִ֥ים בְּתוֹכָ֑הּ תָּ֝לִ֗ינוּ כִּנֹּרוֹתֵֽינוּ׃ כִּ֤י שָׁ֨ם שְֽׁאֵל֪וּנוּ שׁוֹבֵ֡ינוּ דִּבְרֵי־שִׁ֭יר וְתוֹלָלֵ֣ינוּ שִׂמְחָ֑ה שִׁ֥ירוּ לָ֝֗נוּ מִשִּׁ֥יר צִיּֽוֹן׃ אֵ֗יךְ נָשִׁ֥יר אֶת־שִׁיר־יְהֹוָ֑ה עַ֝֗ל אַדְמַ֥ת נֵכָֽר׃ אִֽם־אֶשְׁכָּחֵ֥ךְ יְֽרוּשָׁלִָ֗ם תִּשְׁכַּ֥ח יְמִינִֽי׃ תִּדְבַּ֥ק־לְשׁוֹנִ֨י ׀ לְחִכִּי֮ אִם־לֹ֪א אֶ֫זְכְּרֵ֥כִי אִם־לֹ֣א אַ֭עֲלֶה אֶת־יְרוּשָׁלִַ֑ם עַ֝֗ל רֹ֣אשׁ שִׂמְחָתִֽי׃ זְכֹ֤ר יְהֹוָ֨ה ׀ לִבְנֵ֬י אֱד֗וֹם אֵת֮ י֤וֹם יְֽרוּשָׁ֫לִָ֥ם הָ֭אֹ֣מְרִים עָ֤רוּ ׀ עָ֑רוּ עַ֝֗ד הַיְס֥וֹד בָּֽהּ׃ בַּת־בָּבֶ֗ל הַשְּׁד֫וּדָ֥ה אַשְׁרֵ֥י שֶׁיְשַׁלֶּם־לָ֑ךְ אֶת־גְּ֝מוּלֵ֗ךְ שֶׁגָּמַ֥לְתְּ לָֽנוּ׃ אַשְׁרֵ֤י ׀ שֶׁיֹּאחֵ֓ז וְנִפֵּ֬ץ אֶֽת־עֹ֝לָלַ֗יִךְ אֶל־הַסָּֽלַע׃");

			if (jewishDateInfo.getJewishCalendar().getDayOfWeek() != 1) { // 1 is motzei shabbat because we set the date
																			// a day forward
				addToSiddurHighlighted(
					"(יש שאומרים הקינה זו פה, ויש אומרים אותה אחר 'על זה היה דוה לבנו'/'Some will say this paragraph here, some will instead say this after 'Al zeh haya daveh leebeinu)\n"
								+ fireFromHeaven);
			}

			addToSiddur(
				"הַאֲזִ֥ינוּ הַשָּׁמַ֖יִם וַאֲדַבֵּ֑רָה וְתִשְׁמַ֥ע הָאָ֖רֶץ אִמְרֵי־פִֽי׃ יַעֲרֹ֤ף כַּמָּטָר֙ לִקְחִ֔י תִּזַּ֥ל כַּטַּ֖ל אִמְרָתִ֑י כִּשְׂעִירִ֣ם עֲלֵי־דֶ֔שֶׁא וְכִרְבִיבִ֖ים עֲלֵי־עֵֽשֶׂב׃ כִּ֛י שֵׁ֥ם יְהֹוָ֖ה אֶקְרָ֑א הָב֥וּ גֹ֖דֶל לֵאלֹהֵֽינוּ׃ הַצּוּר֙ תָּמִ֣ים פָּעֳל֔וֹ כִּ֥י כָל־דְּרָכָ֖יו מִשְׁפָּ֑ט אֵ֤ל אֱמוּנָה֙ וְאֵ֣ין עָ֔וֶל צַדִּ֥יק וְיָשָׁ֖ר הֽוּא׃ שִׁחֵ֥ת ל֛וֹ לֹ֖א בָּנָ֣יו מוּמָ֑ם דּ֥וֹר עִקֵּ֖שׁ וּפְתַלְתֹּֽל׃ הַלְיהֹוָה֙ תִּגְמְלוּ־זֹ֔את עַ֥ם נָבָ֖ל וְלֹ֣א חָכָ֑ם הֲלוֹא־הוּא֙ אָבִ֣יךָ קָּנֶ֔ךָ ה֥וּא עָֽשְׂךָ֖ וַֽיְכֹנְנֶֽךָ׃ זְכֹר֙ יְמ֣וֹת עוֹלָ֔ם בִּ֖ינוּ שְׁנ֣וֹת דּוֹר־וָד֑וֹר שְׁאַ֤ל אָבִ֙יךָ֙ וְיַגֵּ֔דְךָ זְקֵנֶ֖יךָ וְיֹ֥אמְרוּ לָֽךְ׃ בְּהַנְחֵ֤ל עֶלְיוֹן֙ גּוֹיִ֔ם בְּהַפְרִיד֖וֹ בְּנֵ֣י אָדָ֑ם יַצֵּב֙ גְּבֻלֹ֣ת עַמִּ֔ים לְמִסְפַּ֖ר בְּנֵ֥י יִשְׂרָאֵֽל׃ כִּ֛י חֵ֥לֶק יְהֹוָ֖ה עַמּ֑וֹ יַעֲקֹ֖ב חֶ֥בֶל נַחֲלָתֽוֹ׃ יִמְצָאֵ֙הוּ֙ בְּאֶ֣רֶץ מִדְבָּ֔ר וּבְתֹ֖הוּ יְלֵ֣ל יְשִׁמֹ֑ן יְסֹֽבְבֶ֙נְהוּ֙ יְב֣וֹנְנֵ֔הוּ יִצְּרֶ֖נְהוּ כְּאִישׁ֥וֹן עֵינֽוֹ׃ כְּנֶ֙שֶׁר֙ יָעִ֣יר קִנּ֔וֹ עַל־גּוֹזָלָ֖יו יְרַחֵ֑ף יִפְרֹ֤שׂ כְּנָפָיו֙ יִקָּחֵ֔הוּ יִשָּׂאֵ֖הוּ עַל־אֶבְרָתֽוֹ׃ יְהֹוָ֖ה בָּדָ֣ד יַנְחֶ֑נּוּ וְאֵ֥ין עִמּ֖וֹ אֵ֥ל נֵכָֽר׃ יַרְכִּבֵ֙הוּ֙ עַל־בָּ֣מֳתֵי אָ֔רֶץ וַיֹּאכַ֖ל תְּנוּבֹ֣ת שָׂדָ֑י וַיֵּנִקֵ֤הֽוּ דְבַשׁ֙ מִסֶּ֔לַע וְשֶׁ֖מֶן מֵחַלְמִ֥ישׁ צֽוּר׃ חֶמְאַ֨ת בָּקָ֜ר וַחֲלֵ֣ב צֹ֗אן עִם־חֵ֨לֶב כָּרִ֜ים וְאֵילִ֤ים בְּנֵֽי־בָשָׁן֙ וְעַתּוּדִ֔ים עִם־חֵ֖לֶב כִּלְי֣וֹת חִטָּ֑ה וְדַם־עֵנָ֖ב תִּשְׁתֶּה־חָֽמֶר׃ וַיִּשְׁמַ֤ן יְשֻׁרוּן֙ וַיִּבְעָ֔ט שָׁמַ֖נְתָּ עָבִ֣יתָ כָּשִׂ֑יתָ וַיִּטֹּשׁ֙ אֱל֣וֹהַ עָשָׂ֔הוּ וַיְנַבֵּ֖ל צ֥וּר יְשֻׁעָתֽוֹ׃ יַקְנִאֻ֖הוּ בְּזָרִ֑ים בְּתוֹעֵבֹ֖ת יַכְעִיסֻֽהוּ׃ יִזְבְּח֗וּ לַשֵּׁדִים֙ לֹ֣א אֱלֹ֔הַ אֱלֹהִ֖ים לֹ֣א יְדָע֑וּם חֲדָשִׁים֙ מִקָּרֹ֣ב בָּ֔אוּ לֹ֥א שְׂעָר֖וּם אֲבֹתֵיכֶֽם׃ צ֥וּר יְלָדְךָ֖ תֶּ֑שִׁי וַתִּשְׁכַּ֖ח אֵ֥ל מְחֹלְלֶֽךָ׃ וַיַּ֥רְא יְהֹוָ֖ה וַיִּנְאָ֑ץ מִכַּ֥עַס בָּנָ֖יו וּבְנֹתָֽיו׃ וַיֹּ֗אמֶר אַסְתִּ֤ירָה פָנַי֙ מֵהֶ֔ם אֶרְאֶ֖ה מָ֣ה אַחֲרִיתָ֑ם כִּ֣י ד֤וֹר תַּהְפֻּכֹת֙ הֵ֔מָּה בָּנִ֖ים לֹא־אֵמֻ֥ן בָּֽם׃ הֵ֚ם קִנְא֣וּנִי בְלֹא־אֵ֔ל כִּעֲס֖וּנִי בְּהַבְלֵיהֶ֑ם וַאֲנִי֙ אַקְנִיאֵ֣ם בְּלֹא־עָ֔ם בְּג֥וֹי נָבָ֖ל אַכְעִיסֵֽם׃ כִּי־אֵשׁ֙ קָדְחָ֣ה בְאַפִּ֔י וַתִּיקַ֖ד עַד־שְׁא֣וֹל תַּחְתִּ֑ית וַתֹּ֤אכַל אֶ֙רֶץ֙ וִֽיבֻלָ֔הּ וַתְּלַהֵ֖ט מוֹסְדֵ֥י הָרִֽים׃ אַסְפֶּ֥ה עָלֵ֖ימוֹ רָע֑וֹת חִצַּ֖י אֲכַלֶּה־בָּֽם׃ מְזֵ֥י רָעָ֛ב וּלְחֻ֥מֵי רֶ֖שֶׁף וְקֶ֣טֶב מְרִירִ֑י וְשֶׁן־בְּהֵמוֹת֙ אֲשַׁלַּח־בָּ֔ם עִם־חֲמַ֖ת זֹחֲלֵ֥י עָפָֽר׃ מִחוּץ֙ תְּשַׁכֶּל־חֶ֔רֶב וּמֵחֲדָרִ֖ים אֵימָ֑ה גַּם־בָּחוּר֙ גַּם־בְּתוּלָ֔ה יוֹנֵ֖ק עִם־אִ֥ישׁ שֵׂיבָֽה׃ אָמַ֖רְתִּי אַפְאֵיהֶ֑ם אַשְׁבִּ֥יתָה מֵאֱנ֖וֹשׁ זִכְרָֽם׃ לוּלֵ֗י כַּ֤עַס אוֹיֵב֙ אָג֔וּר פֶּֽן־יְנַכְּר֖וּ צָרֵ֑ימוֹ פֶּן־יֹֽאמְרוּ֙ יָדֵ֣ינוּ רָ֔מָה וְלֹ֥א יְהֹוָ֖ה פָּעַ֥ל כָּל־זֹֽאת׃ כִּי־ג֛וֹי אֹבַ֥ד עֵצ֖וֹת הֵ֑מָּה וְאֵ֥ין בָּהֶ֖ם תְּבוּנָֽה׃ ל֥וּ חָכְמ֖וּ יַשְׂכִּ֣ילוּ זֹ֑את יָבִ֖ינוּ לְאַחֲרִיתָֽם׃ אֵיכָ֞ה יִרְדֹּ֤ף אֶחָד֙ אֶ֔לֶף וּשְׁנַ֖יִם יָנִ֣יסוּ רְבָבָ֑ה אִם־לֹא֙ כִּי־צוּרָ֣ם מְכָרָ֔ם וַֽיהֹוָ֖ה הִסְגִּירָֽם׃ כִּ֛י לֹ֥א כְצוּרֵ֖נוּ צוּרָ֑ם וְאֹיְבֵ֖ינוּ פְּלִילִֽים׃ כִּֽי־מִגֶּ֤פֶן סְדֹם֙ גַּפְנָ֔ם וּמִשַּׁדְמֹ֖ת עֲמֹרָ֑ה עֲנָבֵ֙מוֹ֙ עִנְּבֵי־ר֔וֹשׁ אַשְׁכְּלֹ֥ת מְרֹרֹ֖ת לָֽמוֹ׃ חֲמַ֥ת תַּנִּינִ֖ם יֵינָ֑ם וְרֹ֥אשׁ פְּתָנִ֖ים אַכְזָֽר׃ הֲלֹא־ה֖וּא כָּמֻ֣ס עִמָּדִ֑י חָתֻ֖ם בְּאוֹצְרֹתָֽי׃ לִ֤י נָקָם֙ וְשִׁלֵּ֔ם לְעֵ֖ת תָּמ֣וּט רַגְלָ֑ם כִּ֤י קָרוֹב֙ י֣וֹם אֵידָ֔ם וְחָ֖שׁ עֲתִדֹ֥ת לָֽמוֹ׃ כִּֽי־יָדִ֤ין יְהֹוָה֙ עַמּ֔וֹ וְעַל־עֲבָדָ֖יו יִתְנֶחָ֑ם כִּ֤י יִרְאֶה֙ כִּי־אָ֣זְלַת יָ֔ד וְאֶ֖פֶס עָצ֥וּר וְעָזֽוּב׃ וְאָמַ֖ר אֵ֣י אֱלֹהֵ֑ימוֹ צ֖וּר חָסָ֥יוּ בֽוֹ׃ אֲשֶׁ֨ר חֵ֤לֶב זְבָחֵ֙ימוֹ֙ יֹאכֵ֔לוּ יִשְׁתּ֖וּ יֵ֣ין נְסִיכָ֑ם יָק֙וּמוּ֙ וְיַעְזְרֻכֶ֔ם יְהִ֥י עֲלֵיכֶ֖ם סִתְרָֽה׃ רְא֣וּ׀ עַתָּ֗ה כִּ֣י אֲנִ֤י אֲנִי֙ ה֔וּא וְאֵ֥ין אֱלֹהִ֖ים עִמָּדִ֑י אֲנִ֧י אָמִ֣ית וַאֲחַיֶּ֗ה מָחַ֙צְתִּי֙ וַאֲנִ֣י אֶרְפָּ֔א וְאֵ֥ין מִיָּדִ֖י מַצִּֽיל׃ כִּֽי־אֶשָּׂ֥א אֶל־שָׁמַ֖יִם יָדִ֑י וְאָמַ֕רְתִּי חַ֥י אָנֹכִ֖י לְעֹלָֽם׃ אִם־שַׁנּוֹתִי֙ בְּרַ֣ק חַרְבִּ֔י וְתֹאחֵ֥ז בְּמִשְׁפָּ֖ט יָדִ֑י אָשִׁ֤יב נָקָם֙ לְצָרָ֔י וְלִמְשַׂנְאַ֖י אֲשַׁלֵּֽם׃ אַשְׁכִּ֤יר חִצַּי֙ מִדָּ֔ם וְחַרְבִּ֖י תֹּאכַ֣ל בָּשָׂ֑ר מִדַּ֤ם חָלָל֙ וְשִׁבְיָ֔ה מֵרֹ֖אשׁ פַּרְע֥וֹת אוֹיֵֽב׃ הַרְנִ֤ינוּ גוֹיִם֙ עַמּ֔וֹ כִּ֥י דַם־עֲבָדָ֖יו יִקּ֑וֹם וְנָקָם֙ יָשִׁ֣יב לְצָרָ֔יו וְכִפֶּ֥ר אַדְמָת֖וֹ עַמּֽוֹ׃");
			addToSiddurHighlighted(
					"בַּצַּ֣ר לְךָ֔ וּמְצָא֕וּךָ כֹּ֖ל הַדְּבָרִ֣ים הָאֵ֑לֶּה בְּאַחֲרִית֙ הַיָּמִ֔ים וְשַׁבְתָּ֙ עַד־יְהֹוָ֣ה אֱלֹהֶ֔יךָ וְשָׁמַעְתָּ֖ בְּקֹלֽוֹ׃");
		} else if (jewishDateInfo.getJewishCalendar().getDayOfWeek() == 1) {// Motzei Shabbat
			addToSiddur("יש אומרים (Some say) \n" +
					"לְדָוִ֨ד ׀ בָּ֘ר֤וּךְ יְהֹוָ֨ה ׀ צוּרִ֗י הַֽמְלַמֵּ֣ד יָדַ֣י לַקְרָ֑ב אֶ֝צְבְּעוֹתַ֗י לַמִּלְחָמָֽה׃ \n" +
					"חַסְדִּ֥י וּמְצוּדָתִי֮ מִשְׂגַּבִּ֢י וּֽמְפַלְטִ֫י־לִ֥י מָ֭גִנִּי וּב֣וֹ חָסִ֑יתִי הָרוֹדֵ֖ד עַמִּ֣י תַחְתָּֽי׃ \n" +
					"יְֽהֹוָ֗ה מָֽה־אָ֭דָם וַתֵּדָעֵ֑הוּ בֶּן־אֱ֝נ֗וֹשׁ וַתְּחַשְּׁבֵֽהוּ׃ \n" +
					"אָ֭דָם לַהֶ֣בֶל דָּמָ֑ה יָ֝מָ֗יו כְּצֵ֣ל עוֹבֵֽר׃ \n" +
					"יְ֭הֹוָה הַט־שָׁמֶ֣יךָ וְתֵרֵ֑ד גַּ֖ע בֶּהָרִ֣ים וְֽיֶעֱשָֽׁנוּ׃ \n" +
					"בְּר֣וֹק בָּ֭רָק וּתְפִיצֵ֑ם שְׁלַ֥ח חִ֝צֶּ֗יךָ וּתְהֻמֵּֽם׃ \n" +
					"שְׁלַ֥ח יָדֶ֗יךָ מִ֫מָּר֥וֹם פְּצֵ֣נִי וְ֭הַצִּילֵנִי מִמַּ֣יִם רַבִּ֑ים מִ֝יַּ֗ד בְּנֵ֣י נֵכָֽר׃ \n" +
					"אֲשֶׁ֣ר פִּ֭יהֶם דִּבֶּר־שָׁ֑וְא וִ֝ימִינָ֗ם יְמִ֣ין שָֽׁקֶר׃ \n" +
					"אֱֽלֹהִ֗ים שִׁ֣יר חָ֭דָשׁ אָשִׁ֣ירָה לָּ֑ךְ בְּנֵ֥בֶל עָ֝שׂ֗וֹר אֲזַמְּרָה־לָּֽךְ׃ \n" +
					"הַנּוֹתֵ֥ן תְּשׁוּעָ֗ה לַמְּלָ֫כִ֥ים הַ֭פּוֹצֶה אֶת־דָּוִ֥ד עַבְדּ֗וֹ מֵחֶ֥רֶב רָעָֽה׃ \n" +
					"פְּצֵ֥נִי וְהַצִּילֵנִי֮ מִיַּ֢ד בְּֽנֵי־נֵ֫כָ֥ר אֲשֶׁ֣ר פִּ֭יהֶם דִּבֶּר־שָׁ֑וְא וִ֝ימִינָ֗ם יְמִ֣ין שָֽׁקֶר׃ \n" +
					"אֲשֶׁ֤ר בָּנֵ֨ינוּ ׀ כִּנְטִעִים֮ מְגֻדָּלִ֢ים בִּֽנְעוּרֵ֫יהֶ֥ם בְּנוֹתֵ֥ינוּ כְזָוִיֹּ֑ת מְ֝חֻטָּב֗וֹת תַּבְנִ֥ית הֵיכָֽל׃ \n" +
					"מְזָוֵ֣ינוּ מְלֵאִים֮ מְפִיקִ֥ים מִזַּ֗ן אֶ֫ל־זַ֥ן צֹאונֵ֣נוּ מַ֭אֲלִיפוֹת מְרֻבָּב֗וֹת בְּחוּצוֹתֵֽינוּ׃ \n" +
					"אַלּוּפֵ֗ינוּ מְֽסֻבָּ֫לִ֥ים אֵֽין־פֶּ֭רֶץ וְאֵ֣ין יוֹצֵ֑את וְאֵ֥ין צְ֝וָחָ֗ה בִּרְחֹבֹתֵֽינוּ׃ \n" +
					"אַשְׁרֵ֣י הָ֭עָם שֶׁכָּ֣כָה לּ֑וֹ אַֽשְׁרֵ֥י הָ֝עָ֗ם שֱׁיְהֹוָ֥ה אֱלֹהָֽיו׃\n\n" + menorah);
		}

		addCategoryToSiddur("ק\"ש וברכותיה");

		addToSiddur(
			"יְהֹוָ֣ה צְבָא֣וֹת עִמָּ֑נוּ מִשְׂגָּֽב־לָ֨נוּ אֱלֹהֵ֖י יַֽעֲקֹ֣ב סֶֽלָה׃ יְהֹוָ֥ה צְבָא֑וֹת אַֽשְׁרֵ֥י אָ֝דָ֗ם בֹּטֵ֥חַ בָּֽךְ׃ יְהֹוָ֥ה הוֹשִׁ֑יעָה הַ֝מֶּ֗לֶךְ יַעֲנֵ֥נוּ בְיוֹם־קׇרְאֵֽנוּ: \n\n" +
			"ואומר החזן חצי קדיש:");

		addHalfKaddish(false);

		addToSiddur(
			"וְה֤וּא רַח֨וּם ׀ יְכַפֵּ֥ר עָוֺן֮ וְֽלֹא־יַֽ֫שְׁחִ֥ית וְ֭הִרְבָּה לְהָשִׁ֣יב אַפּ֑וֹ וְלֹא־יָ֝עִ֗יר כׇּל־חֲמָתֽוֹ׃ יְהֹוָ֥ה הוֹשִׁ֑יעָה הַ֝מֶּ֗לֶךְ יַעֲנֵ֥נוּ בְיוֹם־קׇרְאֵֽנוּ:");
		addBarchu(true);

		addToSiddur(
			"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָֽעוֹלָם, אֲשֶׁר בִּדְבָרוֹ מַֽעֲרִיב עֲרָבִים בְּחָכְמָה, פּוֹתֵֽחַ שְׁעָרִים בִּתְבוּנָה, מְשַׁנֶּה עִתִּים, וּמַֽחֲלִיף אֶת־הַזְּמַנִּים, וּמְסַדֵּר אֶת־הַכּֽוֹכָבִים בְּמִשְׁמְרוֹתֵיהֶם בָּרָקִֽיעַ, כִּרְצוֹנוֹ. בּוֹרֵא יוֹמָם וָלָֽיְלָה, גּוֹלֵל אוֹר מִפְּנֵי חֹֽשֶׁךְ וְחֹֽשֶׁךְ מִפְּנֵי אוֹר. הַמַּֽעֲבִיר יוֹם וּמֵבִיא לָֽיְלָה, וּמַבְדִּיל בֵּין יוֹם וּבֵין לָֽיְלָה, יְהֹוָה צְבָאוֹת שְׁמוֹ: בָּרוּךְ אַתָּה יְהֹוָה, הַמַּֽעֲרִיב עֲרָבִים: \n\n" +
			"אַהֲבַת עוֹלָם בֵּית יִשְׂרָאֵל עַמְּךָ אָהָבְתָּ, תּוֹרָה וּמִצְוֹת חֻקִּים וּמִשְׁפָּטִים אוֹתָֽנוּ לִמַּֽדְתָּ, עַל־כֵּן יְהֹוָה אֱלֹהֵֽינוּ, בְּשָׁכְבֵֽנוּ וּבְקוּמֵֽנוּ נָשִֽׂיחַ בְּחֻקֶּֽיךָ, וְנִשְׂמַח וְנַֽעֲלוֹז בְּדִבְרֵי תַלְמוּד תּֽוֹרָתֶֽךָ וּמִצְוֹתֶֽיךָ וְחֻקּוֹתֶֽיךָ לְעוֹלָם וָעֶד, כִּי־הֵם חַיֵּֽינוּ וְאֹֽרֶךְ יָמֵֽינוּ, וּבָהֶם נֶהְגֶּה יוֹמָם וָלָֽיְלָה, וְאַֽהֲבָֽתְךָ לֹא תָסוּר מִמֶּֽנּוּ לְעֽוֹלָמִים: בָּרוּךְ אַתָּה יְהֹוָה, אוֹהֵב אֶת־עַמּוֹ יִשְׂרָאֵל:");

		addToSiddur(
			"שְׁמַ֖ע יִשְׂרָאֵ֑ל יְהֹוָ֥ה אֱלֹהֵ֖ינוּ יְהֹוָ֥ה ׀ אֶחָֽד \n\n" +
			"בלחש/say quietly: בָּרוּךְ, שֵּׁם כְּבוֹד מַלְכוּתוֹ, לְעוֹלָם וָעֶד: \n\n" +
			shema +
			"וחוזר החזן: יְהֹוָה אֱלֹהֵיכֶם אֱמֶת: \n\n" +
			"וֶֽאֱמוּנָה כָּל־זֹאת וְקַיָּם עָלֵֽינוּ, כִּי הוּא יְהֹוָה אֱלֹהֵֽינוּ וְאֵין זוּלָתוֹ, וַֽאֲנַֽחְנוּ יִשְׂרָאֵל עַמּוֹ. הַפּוֹדֵֽנוּ מִיַּד מְלָכִים, הַגֹּֽאֲלֵֽנוּ מַלְכֵּֽנוּ מִכַּף כָּל־עָֽרִיצִים, הָאֵל הַנִּפְרָע לָֽנוּ מִצָּרֵֽינוּ, הַֽמְשַׁלֵּם גְּמוּל לְכָל־אֽוֹיְבֵי נַפְשֵֽׁנוּ. הַשָּׂם נַפְשֵֽׁנוּ בַּֽחַיִּים, וְלֹא נָתַן לַמּוֹט רַגְלֵֽנוּ, הַמַּדְרִיכֵֽנוּ עַל בָּמוֹת אֽוֹיְבֵֽינוּ, וַיָּֽרֶם קַרְנֵֽנוּ עַל־כָּל־שֽׂוֹנְאֵֽינוּ. הָאֵל הָעֹשֶׂה לָֽנוּ נִסִים וּנְקָמָה בְּפַרְעֹה, בְּאוֹתוֹת וּבְמֽוֹפְתִים בְּאַדְמַת בְּנֵי חָם. הַמַּכֶּה בְעֶבְרָתוֹ כָּל־בְּכוֹרֵי מִצְרָֽיִם, וַיּוֹצִיא אֶת־עַמּוֹ יִשְׂרָאֵל מִתּוֹכָם לְחֵרוּת עוֹלָם. הַמַּֽעֲבִיר בָּנָיו בֵּין גִּזְרֵי יַם־סוּף, וְאֶת־רוֹדְפֵיהֶם וְאֶת־שׂוֹנְאֵיהֶם בִּתְהוֹמוֹת טִבַּע. רָאוּ בָנִים אֶת־גְּבוּרָתוֹ, שִׁבְּחוּ וְהוֹדוּ לִשְׁמוֹ, וּמַלְכוּתוֹ בְרָצוֹן קִבְּלוּ עֲלֵיהֶם. מֹשֶׁה וּבְנֵי יִשְׂרָאֵל לְךָ עָנוּ שִׁירָה בְּשִׂמְחָה רַבָּה, וְאָֽמְרוּ כֻלָּם. מִֽי־כָמֹ֤כָה בָּֽאֵלִם֙ יְהֹוָ֔ה מִ֥י כָּמֹ֖כָה נֶאְדָּ֣ר בַּקֹּ֑דֶשׁ נוֹרָ֥א תְהִלֹּ֖ת עֹ֥שֵׂה פֶֽלֶא׃ מַלְכֽוּתְךָ יְהֹוָה אֱלֹהֵֽינוּ רָאוּ בָנֶֽיךָ עַל הַיָּם, יַֽחַד כֻּלָּם הוֹדוּ וְהִמְלִֽיכוּ וְאָמְרוּ. יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד׃ וְנֶֽאֱמַר. כִּֽי־פָדָ֥ה יְהֹוָ֖ה אֶֽת־יַעֲקֹ֑ב וּגְאָל֕וֹ מִיַּ֖ד חָזָ֥ק מִמֶּֽנּוּ׃ בָּרוּךְ אַתָּה יְהֹוָה, גָּאַל יִשְׂרָאֵל: \n\n" +
			"הַשְׁכִּיבֵֽנוּ אָבִֽינוּ לְשָׁלוֹם, וְהַֽעֲמִידֵֽנוּ מַלְכֵּֽנוּ לְחַיִּים טוֹבִים וּלְשָׁלוֹם. וּפְרוֹשׂ עָלֵֽינוּ סֻכַּת שְׁלוֹמֶֽךָ, וְתַקְּנֵֽנוּ מַלְכֵּֽנוּ בְּעֵצָה טוֹבָה מִלְּפָנֶֽיךָ, וְהוֹשִׁיעֵֽנוּ מְהֵרָה לְמַֽעַן שְׁמֶֽךָ. וְהָגֵן בַּֽעֲדֵֽנוּ, וְהָסֵר מֵעָלֵֽינוּ מַכַּת אוֹיֵב, דֶּֽבֶר, חֶֽרֶב, חֽוֹלִי, צָרָה, רָעָה, רָעָב, וְיָגוֹן, וּמַשְׁחִית, וּמַגֵּפָה. שְׁבוֹר וְהָסֵר הַשָּׂטָן מִלְּפָנֵֽינוּ וּמֵאַֽחֲרֵֽינוּ, וּבְצֵל כְּנָפֶֽיךָ תַּסְתִּירֵֽנוּ, וּשְׁמוֹר צֵאתֵֽנוּ וּבוֹאֵֽנוּ לְחַיִּים טוֹבִים וּלְשָׁלוֹם מֵעַתָּה וְעַד עוֹלָם. כִּי אֵל שֽׁוֹמְרֵֽנוּ וּמַצִּילֵֽנוּ אָֽתָּה מִכָּל־דָּבָר רָע וּמִפַּֽחַד לָֽיְלָה. בָּרוּךְ אַתָּה יְהֹוָה, שׁוֹמֵר אֶת־עַמּוֹ יִשְׂרָאֵל לָעַד אָמֵן: \n\n" +
			"ואומר החזן חצי קדיש:");

		addHalfKaddish(false);

		addAmidahToSiddur(false, true);

		addToSiddur("יְהִ֤י שֵׁ֣ם יְהֹוָ֣ה מְבֹרָ֑ךְ מֵ֝עַתָּ֗ה וְעַד־עוֹלָֽם׃ מִמִּזְרַח־שֶׁ֥מֶשׁ עַד־מְבוֹא֑וֹ מְ֝הֻלָּ֗ל שֵׁ֣ם יְהֹוָֽה׃ רָ֖ם עַל־כׇּל־גּוֹיִ֥ם ׀ יְהֹוָ֑ה עַ֖ל הַשָּׁמַ֣יִם כְּבוֹדֽוֹ׃ יְהֹוָ֥ה אֲדֹנֵ֑ינוּ מָה־אַדִּ֥יר שִׁ֝מְךָ֗ בְּכׇל־הָאָֽרֶץ׃");

		boolean purim = jewishDateInfo.getJewishCalendar().isPurim() ||
			(jewishDateInfo.getJewishCalendar().getIsMukafChoma()
			&& jewishDateInfo.getJewishCalendar().getDayOfWeek() == 6
			&& jewishDateInfo.getJewishCalendar().getJewishDayOfMonth() == 14 &&
				(jewishDateInfo.getJewishCalendar().getJewishMonth() == JewishDate.ADAR || jewishDateInfo.getJewishCalendar().getJewishMonth() == JewishDate.ADAR_II));
		boolean halfKaddish = !jewishDateInfo.getJewishCalendar().isTishaBav() && (
			jewishDateInfo.getJewishCalendar().getDayOfWeek() == 1 ||
			purim);

		if (halfKaddish) {
			addHalfKaddish(false);
			if (jewishDateInfo.getJewishCalendar().getDayOfWeek() == 1) {// checking for Motzaeh Shabbat, so it should be Sunday
				addToSiddur(
					"יש אומרים (Some say): [הֲרֵינִי מֵכִין עַצְמִי לְקַבֵּל אוֹר תּוֹסֶפֶת קְדֻשַּׁת שַׁבָּת לִימֵי הַחֹל, וְאֶתְקַדֵּשׁ בּעֶזְרַת הַשֵּׁם יִתְבָּרַךְ בִּימֵי הַחֹל מִקְּדֻשַּׁת הַשַּׁבָּת, כְּמוֹ שֶׁצִּוָּנוּ יְהֹוָה אֱלֹהֵינוּ בְּתוֹרָתוֹ הַקְּדוֹשָׁה: וְהִתְקַדִּשְׁתֶּם וִהְיִיתֶם קְדֹשִׁים, וִיהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהַי וֵאלֹהֵי אֲבוֹתַי, שֶׁיַּעֲלֶה לְפָנֶיךָ כְּאִלּוּ כִּוַּנְתִּי בְּכֹל הַכַּוָּנוֹת הָרְאוּיוֹת לְכַוֵּן בָּזֶה:] \n\n" +
					"שׁוּבָ֣ה יְ֭הֹוָה עַד־מָתָ֑י וְ֝הִנָּחֵ֗ם עַל־עֲבָדֶֽיךָ׃ שַׂבְּעֵ֣נוּ בַבֹּ֣קֶר חַסְדֶּ֑ךָ וּֽנְרַנְּנָ֥ה וְ֝נִשְׂמְחָ֗ה בְּכׇל־יָמֵֽינוּ׃ שַׂ֭מְּחֵנוּ כִּימ֣וֹת עִנִּיתָ֑נוּ שְׁ֝נ֗וֹת רָאִ֥ינוּ רָעָֽה׃ יֵרָאֶ֣ה אֶל־עֲבָדֶ֣יךָ פׇעֳלֶ֑ךָ וַ֝הֲדָרְךָ֗ עַל־בְּנֵיהֶֽם׃ וִיהִ֤י ׀ נֹ֤עַם אֲדֹנָ֥י אֱלֹהֵ֗ינוּ עָ֫לֵ֥ינוּ וּמַעֲשֵׂ֣ה יָ֭דֵינוּ כּוֹנְנָ֥ה עָלֵ֑ינוּ וּֽמַעֲשֵׂ֥ה יָ֝דֵ֗ינוּ כּוֹנְנֵֽהוּ׃ \n\n" +
					"(טוב לעמוד פה/It is appropriate to stand here)\n\n" +
					"יֹ֭שֵׁב בְּסֵ֣תֶר עֶלְי֑וֹן בְּצֵ֥ל שַׁ֝דַּ֗י יִתְלוֹנָֽן׃ אֹמַ֗ר לַ֭יהֹוָה מַחְסִ֣י וּמְצוּדָתִ֑י אֱ֝לֹהַ֗י אֶבְטַח־בּֽוֹ׃ כִּ֤י ה֣וּא יַ֭צִּילְךָ מִפַּ֥ח יָק֗וּשׁ מִדֶּ֥בֶר הַוּֽוֹת׃ בְּאֶבְרָת֨וֹ ׀  יָ֣סֶךְ לָ֭ךְ וְתַחַת־כְּנָפָ֣יו תֶּחְסֶ֑ה צִנָּ֖ה וְסֹחֵרָ֣ה אֲמִתּֽוֹ׃ לֹֽא־תִ֭ירָא מִפַּ֣חַד לָ֑יְלָה מֵ֝חֵ֗ץ יָע֥וּף יוֹמָֽם׃ מִ֭דֶּבֶר בָּאֹ֣פֶל יַהֲלֹ֑ךְ מִ֝קֶּ֗טֶב יָשׁ֥וּד צׇהֳרָֽיִם׃ יִפֹּ֤ל מִצִּדְּךָ֨ ׀ אֶ֗לֶף וּרְבָבָ֥ה מִימִינֶ֑ךָ אֵ֝לֶ֗יךָ לֹ֣א יִגָּֽשׁ׃ רַ֭ק בְּעֵינֶ֣יךָ תַבִּ֑יט וְשִׁלֻּמַ֖ת רְשָׁעִ֣ים תִּרְאֶֽה׃ כִּֽי־אַתָּ֣ה יְהֹוָ֣ה מַחְסִ֑י עֶ֝לְי֗וֹן שַׂ֣מְתָּ מְעוֹנֶֽךָ׃ לֹא־תְאֻנֶּ֣ה אֵלֶ֣יךָ רָעָ֑ה וְ֝נֶ֗גַע לֹא־יִקְרַ֥ב בְּאׇהֳלֶֽךָ׃ כִּ֣י מַ֭לְאָכָיו יְצַוֶּה־לָּ֑ךְ לִ֝שְׁמׇרְךָ֗ בְּכׇל־דְּרָכֶֽיךָ׃ עַל־כַּפַּ֥יִם יִשָּׂא֑וּנְךָ פֶּן־תִּגֹּ֖ף בָּאֶ֣בֶן רַגְלֶֽךָ׃ עַל־שַׁ֣חַל וָפֶ֣תֶן תִּדְרֹ֑ךְ תִּרְמֹ֖ס כְּפִ֣יר וְתַנִּֽין׃ כִּ֤י בִ֣י חָ֭שַׁק וַאֲפַלְּטֵ֑הוּ אֲ֝שַׂגְּבֵ֗הוּ כִּֽי־יָדַ֥ע שְׁמִֽי׃ יִקְרָאֵ֨נִי ׀ וְֽאֶעֱנֵ֗הוּ עִמּֽוֹ־אָנֹכִ֥י בְצָרָ֑ה אֲ֝חַלְּצֵ֗הוּ וַאֲכַבְּדֵֽהוּ׃ אֹ֣רֶךְ יָ֭מִים אַשְׂבִּיעֵ֑הוּ וְ֝אַרְאֵ֗הוּ בִּישׁוּעָתִֽי׃");
			}
		} else {
			addKaddishTitkabal(false);
		}

		if (purim) {
			addCategoryToSiddur("קריאת המגילה");
			if (jewishDateInfo.getJewishCalendar().getIsSafekMukafChoma()) {
				addToSiddurHighlighted(
					"ב-14 באדר, בעיר שהיא ספק מוקפת חומה, קוראים את המגילה עם הברכות, ולא אומרים את הברכות ב-15/On the 14th of Adar, in a safek mufak choma, we read the megilah with the berachot, and we do not say the berachot on the 15th. (הליכות עולם רל)");
			}
			if (jewishDateInfo.getJewishCalendar().getDayOfWeek() == 1) {
				addToSiddurHighlighted("אנחנו מברכים על האש לפני קריאת המגילה/We say the beracha on fire before the Megilah is read" + "\n" + "(חזון עובדיה פורים קו)" + "\n\n" +
						"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָֽעוֹלָם, בּוֹרֵא מְאוֹרֵי הָאֵשׁ:");
			}
			addToSiddurHighlighted(
				"לפני קריאת המגילה החזן מברך מעומד, וגם הקהל יעמדו בשעת הברכה: (Before the Megilah is read, everyone should stand for the bracha) \n\n" +
				"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָֽׁנוּ בְּמִצְוֹתָיו, וְצִוָּֽנוּ עַל מִקְרָא מְגִלָּה:\n\n" +
				"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, שֶׁעָשָׂה נִסִּים לַאֲבוֹתֵֽינוּ בַּיָּמִים הָהֵם בַּזְּמַן הַזֶּה:\n\n" +
				"בליל פורים שמברך ברכת \"שהחיינו\", יכון בברכת שהחיינו לפטור סעודת פורים ומשלוח מנות ומתנות לאביונים (Have in mind that Shehechiyanu also goes on the meal, mishloach manot, and matanot laevyonim) \n\n" +
				"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, שֶׁהֶחֱיָֽנוּ וְקִיְּמָֽנוּ וְהִגִּיעָֽנוּ לַזְּמַן הַזֶּה: \n\n" +
				"קוראים את המגילה (Megilah is read) \n\n" +
				"אחר קריאת המגילה גוללה ואחר כך מברך: (Megilah is finished) \n\n" +
				"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, הַאֵל הָרָב אֶת־רִיבֵֽנוּ, וְהַדָּן אֶת־דִּינֵֽנוּ, וְהַנּוֹקֵם אֶת־נִקְמָתֵֽנוּ, וְהַנִּפְרָע לָנוּ מִצָּרֵֽינוּ, וְהַמְשַׁלֵּם גְּמּוּל לְכָל־אֽוֹיְבֵֽי נַפְשֵֽׁנוּ. בָּרוּךְ אַתָּה יְהֹוָה, הַנִּפְרָע לְעַמּוֹ יִשְׂרָאֵל מִכָּל־צָרֵיהֶם הָאֵל הַמּוֹשִׁיעַ:\n\n" +
				"אָרוּר הָמָן, בָּרוּךְ מָרְדְּכַי.\n" +
				"אֲרוּרָה זֶרֶשׁ, בְּרוּכָה אֶסְתֵּר.\n" +
				"אֲרוּרִים כָּל־הָרְשָׁעִים, בְּרוּכִים כָּל־יִשְׂרָאֵל. וְגַם חַרְבוֹנָה זָכוּר לטוֹב: שלש פעמים (Three times) ");
		} else if (jewishDateInfo.getJewishCalendar().isTishaBav()) {
			if (jewishDateInfo.getJewishCalendar().getDayOfWeek() == 1) {
				addToSiddurHighlighted(
					"אם חל תשעה באב במוצאי שבת, אין אומרים הבדלה אבל מברכים על האש (If Tisha B'av falls out on Sunday, our Havdala will be delayed to post-fast. Nevertheless, one should still bless on the fire)\n\n" +
					"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָֽעוֹלָם, בּוֹרֵא מְאוֹרֵי הָאֵשׁ:");
			}
			addToSiddur(
				"הקהל יושב על הקרקע ומתחילים בקינות (Everyone sits on the floor and starts) \n" +
				"לְמִי אֶבְכֶּה וְכַף אַכֶּה וּבִבְכִי אֲמָרֵר וַהֲמוֹן מֵעַי אֲשַׁנֵּן: הֲלְמִקְדָּשׁ וְאָרוֹן אוֹ כְרוּבִים אֲשֶׁר עוֹרְבִים וְקִפּוֹד שָׁם יְקַנֵּן: וְעַל דּוּכָן אֲשֶׁר הוּכַן לְלֵוִי לְנַצֵּחַ בְּשִׁיר לָאֵל וְרַנֵּן: אֱהִי מַשְׁמִים עֲלֵי אוּרִים וְתֻמִּים אֲשֶׁר שָׁם כֹּהֲנֵי מִשְׁמָר יְכוֹנֵן: וְעַל הֶרֶג חֲכָמִים בֵּית אֱלֹהִים וּבָא קוֹסֵם קְסָמִים גַּם מְעוֹנֵן: וְאֵיכָה חָשְׁכָה אוֹר הַהֲלָכָה וְהַתַּלְמוּד כְּמוֹ גַלְמוּד מִי יְבוֹנֵן: וְסוֹד תּוֹרָה הֲיֵשׁ מוֹצִיא לְאוֹרָה וּמִי הוּא זֶה עֲלֵי הַדּוֹר יְגוֹנֵן: חֲלָלִים נָפְלוּ עוֹלְלִים וְיוֹנְקִים וְאֵין מֵקִים וְאֵין חוֹמֵל וְחוֹנֵן: לְזֹאת כָּל יוֹם וְכָל לַיִל אֲיֵילִיל בְּרוֹב חֶבֶל כְּמוֹ אָבֵל וְאוֹנֵן: וּמַר אֶסְפּוֹד וְאָח אֶקְרָא לְקִפּוֹד וּמִדְּמָעַי עֲפַר צִיּוֹן אֲחוֹנֵן: וְאֶחְדַּל מִשְּׁמוֹעַ קוֹל מְרַנֵּן וְאֵיכָה יָשְׁבָה בָדָד אֲקוֹנֵן:");

			addToSiddur(lineBreak);

			addEicha();

			addToSiddur(lineBreak);

			addToSiddur(
				"אָז בַּחֲטָאֵינוּ חָרַב מִקְדָּשׁ. וּבַעֲוֹנוֹתֵינוּ נִשְׂרַף הֵיכָל: בְּעִיר שֶׁחֻבְּרָה לָּהּ קָשְׁרוּ מִסְפֵּד. וּצְבָא הַשָּׁמַיִם נָשְׂאוּ קִינָה: גַּם בָּכוּ בַמָּרוֹם שִׁבְטֵי יַעֲקֹב. וְאַף מַזָּלוֹת יִזְּלוּ דִּמְעָה: דִּגְלֵי יְשֻׁרוּן חָפוּ רֹאשָׁם. כִּימָה וּכְסִיל קָדְרוּ פְנֵיהֶם: הֶעְתִּירוּ אָבוֹת וְאֵל כְּלֹא שׁוֹמֵעַ. צָעֲקוּ בָנִים וְלֹא עָנָם אָב: וְקוֹל הַתּוֹרָה צוֹעֵק בְּמָרָה. וְרוֹעֶה נֶאֱמָן לֹא הִטָּה אֹזֶן: זֶרַע קֹדֶשׁ חָגְרוּ שַׂקִּים. וּצְבָא הַשָּׁמַיִם שַׂק הוּשַׁת כְּסוּתָם: חָשַׁךְ הַשֶּׁמֶשׁ וְיָרֵחַ קָדַר. וְכוֹכָבִים אָסְפוּ נָגְהָם:");
			addToSiddur(
				"יש אומרים (Some say) \n" +
				"טָלֶה רִאשׁוֹן צוֹעֵק בְּמַר נֶפֶשׁ. עַל כִּי כְבָשָׂיו לָטֶּבַח הוּבָלוּ: יְלָלָה הִשְׁמִיעַ שׁוֹר בַּמְּרוֹמִים. עַל כִּי בְּכוֹר שׁוֹר שָׁחוּ קַרְנָיו: כּוֹכָב תְּאוֹמִים חָלָה מִכַּעַס. כִּי דַּם אַחִים נִשְׁפַּךְ כַּמַּיִם: לָאָרֶץ בִּקֵּשׁ לִנְפּוֹל סַרְטָן. כִּי הִתְעַלַּפְנוּ צְחֵה צָמָא: מָרוֹם נִרְעַשׁ מִקּוֹל אַרְיֵה. כִּי שַׁאֲגָתֵנוּ עָלְתָה לַמָּרוֹם: נֶהֶרְגוּ בְּתוּלוֹת גַּם בַּחוּרִים. עַל כֵּן בְּתוּלָה קָדְרוּ פָנֶיהָ: סִבֵּב מֹאזְנַיִם וּבִקֵּשׁ תְּחִנָּה. כִּי נִכְרַע לָנוּ כַּף מָוֶת מֵחַיִּים: עַקְרָב לָבַשׁ פַּחַד וּרְעָדָה. כִּי בְּעַקְרַבִּים יִסְּרוּנוּ צָרֵינוּ: פְּנֵי הַקֶּשֶׁת נֶהֶפְכוּ לְאָחוֹר. כִּי צוּר דָּרַךְ קַשְׁתּוֹ כְּאוֹיֵב: צָרַח דְּלִי כִּי צָפוּ מַיִם עַל רֹאשֵׁנוּ. וּמִדְּלִי מָלֵא חִכֵּנוּ יָבֵשׁ: קוֹל גְּדִי נִשְׁמַע בִּילָלָה. כִּי אָפֵס קָרְבַּן כִּי גְדִי נִגְדַּע וּשְׂעִיר חַטָּאת: רָגַז וּפָחַד מַזָּל דָּגִים. כִּי כַדָּגִים נֶאֱחַזְנוּ בִּמְצוּדָה רָעָה: שַׁדַּי שׁוּר עֶלְבּוֹנֵנוּ. תָּשׁוּב תְּרַחֲמֵנוּ. תִּכְבּוֹשׁ עֲוֹנוֹתֵינוּ: תִּבְנֶה בֵּית מִקְדָּשֵׁנוּ. יִרְאוּ עֵינֵינוּ וְיִשְׂמַח לִבֵּנוּ:");
			addToSiddur("יש אומרים (Some say) \n" +
				"זְכוֹר יְהֹוָה מֶה הָיָה לָנוּ אוֹי. הַבִּיטָה וּרְאֵה אֶת חֶרְפָּתֵנוּ. אוֹי מֶה הָיָה לָנוּ: \n" +
				"אֲקוֹנֵן בְּכָל שָׁנָה וְדִמְעָתִי אַתְמִיד אוֹי. \n" +
				"בָּאתִי בְמַעֲמַקֵּי מַיִם וּמַכְאוֹבִי נֶגְדִּי תָמִיד. אוֹי מֶה הָיָה לָנוּ: \n" +
				"גָּלָה כְבוֹדִי וּמְאוֹרִי הוּעָם. אוֹי. \n" +
				"אַף דֻּחַפְתִּי מִזְּבוּלִי וְהִנְנִי חֶרְפַּת אָדָם וּבְזוּי עָם. אוֹי מֶה הָיָה לָנוּ: \n" +
				"הֲלָמוּנִי כוּתִיִּים וְחֵרְפוּ וְשָּׁאֲגוּ לְמוּלִי. אוֹי. \n" +
				"וְכָל רוֹאַי יַלְעִיגוּ לִי. אוֹי מֶה הָיָה לָנוּ: \n" +
				"זֶרַע מְרֵעִים הִקִּיפוּנִי כִּזְאֵבִים. אוֹי. \n" +
				"חָרְבוּ מִקְדָּשִׁי וּסְבָבֻנִי פָּרִים רַבִּים. אוֹי מֶה הָיָה לָנוּ: \n" +
				"טִאֲטוּ הַמִּקְדָּשׁ הַמָּעוֹז וְגוֹרַשְׁתִּי מִמְּנוּחִי. אוֹי. \n" +
				"יָבֵשׁ כַּחֶרֶשׂ כֹּחִי. אוֹי מֶה הָיָה לָנוּ: \n" +
				"כְּלּוּנִי זָרִים וְנָגְעָה נַפְשִׁי עַד מָוֶת. אוֹי. \n" +
				"כִּי דִכִּיתָנוּ בִּמְקוֹם תַּנִּים וַתְּכַס עָלֵינוּ בְּצַלְמָוֶת. אוֹי מֶה הָיָה לָנוּ: \n" +
				"לִנְבָלָה שָׂמוּנִי וְדָרְכוּ כְגִתּוֹת בְּתוּלוֹתַי. אוֹי. \n" +
				"לָאָרֶץ נִשְׁפַךְ כְּבֵדִי וְהִתְפָּרְדוּ כָּל עַצְמוֹתַי. אוֹי מֶה הָיָה לָנוּ: \n" +
				"מֵהַר אֶל גִּבְעָה הִתְעַלְּלוּ בָּם שׂוֹטְנַי. אוֹי. \n" +
				"נָאֲקוּ וְצָעֲקוּ אַיֵּה חֲסָדֶיךָ הָרִאשֹׁנִים אֲדֹנָי. אוֹי מֶה הָיָה לָנוּ:");

			addToSiddur(
				"בְּלֵיל זֶה יִבְכָּיוּן וְיֵלִילוּ בָנַי. לֵיל חָרַב בֵּיתִי וְנִשְׂרְפוּ אַרְמוֹנַי. וְכָל בֵּית יִשְׂרָאֵל יֶהְגּוּ בִּיגוֹנַי. (יִבְכּוּ הַשְּׂרֵפָה אֲשֶׁר שָׂרַף יְהֹוָה): \n" +
				"בְּלֵיל זֶה אֵרְעוּ לִי חֲמִשָּׁה דְבָרִים קָשִׁים. נִגְזַר עַל אָבוֹת וְהָיוּ נֶעֱנָשִׁים. לְבִלְתִּי יִכָּנְסוּ לְתוֹךְ אֶרֶץ קְדוֹשִׁים. וְנֶחֱרַב הַבַּיִת וְגַם חָרְשׁוּ חוֹרְשִׁים. רִאשׁוֹן גַּם שֵׁנִי יְשָׁנִים עִם חֲדָשִׁים. וְגַם נִלְכְּדָה בִּיתֵר וְהָיְתָה לְפַח מוֹקְשִׁים. בְּלֵיל זֶה כִּי הָיְתָה סִבָּה מֵאֵת יְהֹוָה. (יִבְכּוּ הַשְּׂרֵפָה אֲשֶׁר שָׂרַף יְהֹוָה): \n" +
				"בְּלֵיל זֶה תְּיֵלִיל מַר עֲנִיָּה נִבְדֶּלֶת. וּמִבֵּית אָבִיהָ כְּהַיּוֹם נֶחְדֶּלֶת. וְעוֹרֶכֶת בָּכוֹת וְקִינִים מְיַלֶּלֶת. כִּי נִשְׂרַף בֵּיתָהּ בְּלַבַּת אוֹכֶלֶת. וְיָצְאָה גַחֶלֶת וְאֵשׁ מֵאֵת יְהֹוָה. (יִבְכּוּ הַשְּׂרֵפָה אֲשֶׁר שָׂרַף יְהֹוָה): \n" +
				"בְּלֵיל זֶה הֶגְלָנִי וְאֶת בֵּיתִי הֶחֱרִיב. בְּתִשְׁעָה לַחֹדֶשׁ בְּשַׁעַת הַמַּעֲרִיב. אֲנִי עַל מִשְׁמַרְתִּי מִשְׁמֶרֶת יְהוֹיָרִיב. וְנִכְנַס הָאוֹיֵב וְאֶת זְבָחָיו הִקְרִיב. וּבָא אֶל מִקְדָּשִׁי וְלֹא צִוָּה יְהֹוָה. (יִבְכּוּ הַשְּׂרֵפָה אֲשֶׁר שָׂרַף יְהֹוָה):");

			addToSiddur(
				"מִדֵּי שָׁנָה קִינָה. בְּלֵיל זֶה מְזֻמָּנָה. כִּי קִרְיָה נֶאֱמָנָה. בּוֹ הָיְתָה כְּאַלְמָנָה: \n" +
				"בּוֹ אֶבְכֶּה וְאָהִימָה. וּבוֹ פָנַי אַרְעִימָה. נְהִי נִהְיָה אָרִימָה. מִיָּמִים יָמִימָה: (מִדֵּי שָׁנָה קִינָה. בְּלֵיל זֶה מְזֻמָּנָה. כִּי קִרְיָה נֶאֱמָנָה. בּוֹ הָיְתָה כְּאַלְמָנָה:) \n" +
				"בְּלֵיל זֶה מִכָּל לֵילוֹת. קִינָה בְּכָל מַקְהֵלוֹת. וּבוֹ שָׁתוּ כּוֹס תַּרְעֵלוֹת. דַּרְכֵי צִיּוֹן אֲבֵלוֹת: (מִדֵּי שָׁנָה קִינָה. בְּלֵיל זֶה מְזֻמָּנָה. כִּי קִרְיָה נֶאֱמָנָה. בּוֹ הָיְתָה כְּאַלְמָנָה:) \n" +
				"לֵיל צוּר פָּקַד קִצְפּוֹ. וְשָׁלַח בִּי אֵשׁ רִשְׁפּוֹ. וְהוּשַׁת שִׁבְרִי לִסְפּוֹא. יֶחְשְׁכוּ כּוֹכְבֵי נִשְׁפּוֹ: (מִדֵּי שָׁנָה קִינָה. בְּלֵיל זֶה מְזֻמָּנָה. כִּי קִרְיָה נֶאֱמָנָה. בּוֹ הָיְתָה כְּאַלְמָנָה:) \n" +
				"אֲנִי הַגֶּבֶר אוּמָל. לִרְאוֹת יָגוֹן וְעָמָל. בְּלֵיל זֶה רִשְׁעִי גָמַל. בִּלַּע יְהֹוָה וְלֹא חָמַל: (מִדֵּי שָׁנָה קִינָה. בְּלֵיל זֶה מְזֻמָּנָה. כִּי קִרְיָה נֶאֱמָנָה. בּוֹ הָיְתָה כְּאַלְמָנָה:) \n" +
				"לֵיל בּוֹ אִירַע נוֹפֶל. לְמִגְדַּל בּוֹחֶן וָעוֹפֶל. וְשׁוּעַי יָשְׁבוּ בַשֶּׁפֶל. יִקָּחֵהוּ אוֹפֶל: (מִדֵּי שָׁנָה קִינָה. בְּלֵיל זֶה מְזֻמָּנָה. כִּי קִרְיָה נֶאֱמָנָה. בּוֹ הָיְתָה כְּאַלְמָנָה:)");

			addToSiddur("עַל זֶה הָיָה דָּוֶה לִבֵּנוּ. וְעַל אֵלֶּה חָשְׁכוּ עֵינֵינוּ: \n" +
				"עַל שִׁמְמוּת עִיר קָדְשֵׁנוּ. בְּלֵיל זֶה יְגוֹנֵנוּ. נֶהֶפְכוּ נְהִי רְנָנֵינוּ: (וְעַל אֵלֶּה חָשְׁכוּ עֵינֵינוּ): \n" +
				"עַל קִרְיָה נִפְלְאָתָה. אֲשֶׁר הוּשָׁתָה בָתָה. לְתוֹרָה וּמִצְוָתָהּ. הֶאֱטַמְנוּ אָזְנֵינוּ: (וְעַל אֵלֶּה חָשְׁכוּ עֵינֵינוּ): \n" +
				"נִפְרַע הֵיכָלֵנוּ. נִשָּׂא בְּמַר קוֹלֵנוּ. יוֹם הִרְבּוּ חֲלָלֵינוּ. אוֹי מַה בָּא עָלֵינוּ: (וְעַל אֵלֶּה חָשְׁכוּ עֵינֵינוּ): \n" +
				"וְסַף מִזְבֵּחַ וְאָרוֹן. כִּי גָבַר הֶחָרוֹן. וְקוֹל הֵרִים זָר בְּגָרוֹן. בְּבֵית אֲדוֹנֵנוּ: (וְעַל אֵלֶּה חָשְׁכוּ עֵינֵינוּ): \n" +
				"וְסַף כּוֹחֵנוּ וְכָשַׁל. בְּלַחַץ מוֹנֶה כָּשַׁל. כִּי הָיִינוּ לְמָשָׁל. וְלַעַג לִשְׁכֵנֵינוּ: (וְעַל אֵלֶּה חָשְׁכוּ עֵינֵינוּ): \n" +
				"נִשְׁכַּחְנוּ כְּמֵת מִלֵּב. מוֹנֶה גוֹזֵז וְחוֹלֵב. וְנִצְרַח בְּתִגְרַת אוֹיֵב. לָאֵל וְאֵין עוֹנֵנוּ: (וְעַל אֵלֶּה חָשְׁכוּ עֵינֵינוּ): \n" +
				"פִּתְאוֹם בָּא אֵידֵנוּ. וַיִּרְפּוּ יָדֵינוּ. וְגָבְרָה יַד מוֹנֵינוּ. בָּחֳרִי אַף קוֹנֵנוּ: (וְעַל אֵלֶּה חָשְׁכוּ עֵינֵינוּ):");

			// Not the minhag to say עַל (לֵיל) יוֹם חָרְבַּן

			if (jewishDateInfo.getJewishCalendar().getDayOfWeek() == 1) {
				addToSiddur(fireFromHeaven);
			}

			addToSiddur("זְכוֹר יְהֹוָה לִיהוּדָה וְאֶפְרַיִם. אֲשֶׁר שֻׁפַּךְ דָּמָם כַּמַּיִם. " +
					"סְבִיבוֹת סְבִיבוֹת יְרוּשָׁלַיִם): \n" +
					"זְכוֹר יְהֹוָה לִמְשִׁיחַ הַנִּקְרָא. אֲשֶׁר עָשׂוּ אֶת גּוּפוֹ כַּכְּבָרָה. וְלֹא נוֹתַר חֵץ אֲשֶׁר בּוֹ לֹא יָרָה. לָכֵן עָלָיו אֶבְכֶּה בְּנֶפֶשׁ מָרָה. לְשֶׁבֶר זֶה רָפוּ כָל יָדַיִם. (סְבִיבוֹת סְבִיבוֹת יְרוּשָׁלַיִם): \n" +
					"זְכֹר יְהֹוָה לִשְׁמוֹנִים אֶלֶף אֲצִילִים. אֲשֶׁר בָּרְחוּ וְהָלְכוּ לַיִּשְׁמְעֵאלִים. וְעֵת רָאוּם תָּקְעוּ שָׁם אֹהָלִים. עִם מַאֲכָל וּנְפוּחִים הַנְּבָלִים. וּבַצָּמָא הִשְׁקוּם מִבְּלִי מַיִם. (סְבִיבוֹת סְבִיבוֹת יְרוּשָׁלַיִם): \n" +
					"זְכוֹר יְהֹוָה לְאָבוֹת וּפְרָחִים. אֲשֶׁר הָרַג רָשָׁע שַׂר טַבָּחִים. בְּדַם כֹּהֵן הַמַּקְרִיב הַזְּבָחִים. וְגַם צָדָם כְּצִפּוֹרִים אֶל פַּחִים. לְשֶׁבֶר זֶה תִּצַּלְנָה אָזְנַיִם. (סְבִיבוֹת סְבִיבוֹת יְרוּשָׁלַיִם): \n" +
					"זְכוֹר יְהֹוָה לְאַלְמָנָה הַצְּנוּעָה. אֲשֶׁר הָרְגוּ אֶת בָּנֶיהָ שִׁבְעָה. בְּנֵי עַוְלָה מַלְכוּת אֱדוֹם הָרְשָׁעָה. וְהִיא עַצְמָהּ נָפְלָה וְגַם שָׁקְעָה. וְעַל אֵלֶּה יֶהֱמוּ כָל מֵעַיִם. (סְבִיבוֹת סְבִיבוֹת יְרוּשָׁלַיִם): \n" +
					"זְכוֹר יְהֹוָה לַעֲשָׂרָה הַיְּשִׁישִׁים. אֲשֶׁר נָפְלוּ בִּידֵי אֲדוֹנִים קָשִׁים. לַחֶרֶב וּלְלַהֶבֶת אִשִּׁים. וְהִפְשִׁיטוּם כְּאֵילִים וּתְיָשִׁים. עַל קְדֻשַּׁת שֵׁם שׁוֹכֵן שָׁמַיִם. (סְבִיבוֹת סְבִיבוֹת יְרוּשָׁלַיִם):");

			addToSiddur("אֲלֵיכֶם עֵדָה קְדוֹשָׁה. אֶשְׁאַל מִכֶּם שְׁאֵלוֹת. " +
					"מַה נִּשְׁתַּנָּה הַלַּיְלָה. הַזֶּה מִכָּל הַלֵּילוֹת: \n" +
					"מַדּוּעַ בְּלֵיל פֶּסַח. אוֹכְלִים מַצּוֹת וּמְרוֹרִים. עַתָּה הַלַּיְלָה הַזֶּה. שָׂבַעְנוּ בּוּז וּמְרוֹרִים. עַל הֶרֶג הַכְּשֵׁרִים. וְעַל זֶרַע יְשָׁרִים. עַל כֵּן בִּבְכִי תַּמְרוּרִים. אֶשָּׂא קוֹלִי כְחוֹלוֹת. " +
					"(מַה נִּשְׁתַּנָּה הַלַּיְלָה. הַזֶּה מִכָּל הַלֵּילוֹת): \n" +
					"מַדּוּעַ בְּלֵיל פֶּסַח. שֻׁלְחָן עָרוּךְ בְּשִּׂמְחָה. עַתָּה בַּעֲוֹנוֹתֵינוּ. בְּלֵיל זֶה קוֹל אֲנָחָה. אֲהָהּ כִּי לֹא מָצָאנוּ. לְכַף רַגְלֵנוּ מְנוּחָה. אוֹי כִּי בָאָה צָרָה. עַל כֵּן אֶשְׁכַּח מְחוֹלוֹת. (מַה נִּשְׁתַּנָּה הַלַּיְלָה. הַזֶּה מִכָּל הַלֵּילוֹת): \n" +
					"מַדּוּעַ בְּלֵיל פֶּסַח. שׁוֹתִים כּוֹסוֹת בִּבְרָכָה. עַתָּה אֲנַחְנוּ בְּלֵיל זֶה. נִקְרָא מְגִלַּת אֵיכָה. אֵיכָה בְּגָלוּת יָשַׁבְתִּי. וּבָאתִי אֶרֶץ מְבוּכָה. לָכֵן אֲנִי עַל כָּכָה. אֲעוֹרֵר קוֹל יְלָלוֹת. (מַה נִּשְׁתַּנָּה הַלַּיְלָה. הַזֶּה מִכָּל הַלֵּילוֹת): \n" +
					"מַדּוּעַ בְּלֵיל פֶּסַח. קוֹרִין תָּמִיד הַגָּדָה. עַתָּה נֹאמַר בְּלֵיל זֶה. בְּכִי תַּמְרוּר וּקְפָדָה. אוֹיָה כִּי גַּרְתִּי מֶשֶׁךְ. וּבָא עֵת פְּקוּדָּה. אוֹי עַל קִרְיָה חֲמוּדָה. וְעַל בָּתֵּי תְפִלּוֹת. (מַה נִּשְׁתַּנָּה הַלַּיְלָה. הַזֶּה מִכָּל הַלֵּילוֹת): \n" +
					"מַדּוּעַ בְּלֵיל פֶּסַח. נִגְמוֹר תָּמִיד הַהַלֵּל. עַתָּה אֲנַחְנוּ בְּלֵיל זֶה. נְהִי מִסְפֵּד וִילֵיל. כִּי בַּעֲוֹנוֹתֵינוּ עַתָּה. לֹא נוּכַל לְהִתְפַּלֵּל. כִּי בֵּית מִקְדָּשׁ מִתְחַלֵּל. וְגַם חָרְבוּ הֵיכָלוֹת. (מַה נִּשְׁתַּנָּה הַלַּיְלָה. הַזֶּה מִכָּל הַלֵּילוֹת): \n" +
					"מַדּוּעַ בְּלֵיל פֶּסַח. אוֹמְרִים שְׁפוֹךְ בְּזִמְרָה. עַתָּה בְּלֵיל זֶה שָׁתִינוּ. לַעַן רֹאשׁ וּמָרָה. אוֹי כִּי שִׂמְחָה נֶעְדָּרָה. דַּרְכֵי צִיּוֹן אֲבֵלוֹת. " +
					"(מַה נִּשְׁתַּנָּה הַלַּיְלָה. הַזֶּה מִכָּל הַלֵּילוֹת):");

			if (jewishDateInfo.getJewishCalendar().getDayOfWeek() == 1) {
				addToSiddur(
					"אוֹי כִּי קִינָה רַבַּת. מִפִּי בֶן וּמִפִּי בַת. וִיהִי נֹעַם נִשְׁבַּת. בְּמוֹצָאֵי הַשַׁבָּת: \n" +
					"וּבְשַׁעַת הַבְדָּלָה. הַרְעָשָׁה וְקוֹל יְלָלָה. אֵיךְ חַתָּה וְאֻמְלָלָה. צִיּוֹן הַהֻלָּלָה. אֵיךְ בְּפֶתַע נִבְהָלָה. וְשֻׁלַּח בַּמִּקְדָּשׁ לַבָּת.  (וִיהִי נֹעַם נִשְׁבַּת. בְּמוֹצָאֵי הַשַׁבָּת): \n" +
					"אֵיךְ נֶהְפַּךְ לְאוֹי כָּל שִׁיר. וּלְאֵבֶל כָּל מָחוֹל. וּמִסְפֵּד מַר חוֹל תָּחוֹל. וְאֵין מַבְדִּיל בֵּין קֹדֶשׁ לְחוֹל. בְּיוֹם זָחַלְתִּי זָחוֹל. זָרִים נָחֲלוּ נָחוֹל. מִקְדָּשִׁי נַחֲלַת חִבַּת. " +
					"(וִיהִי נֹעַם נִשְׁבַּת. בְּמוֹצָאֵי הַשַׁבָּת): \n" +
					"וְחָלִילָה לַעֲגוּמִים. אֲבֵלִים הַשּׁוֹמְמִים. בְּלֵיל זֶה פְּקוֹד אֲשָׁמִים. לְהָרִיחַ עֲצֵי בְשָׂמִים. עֵת קְטֹרֶת הַסַּמִּים. בּוֹסְסוּ יְהִירֵי לְאוּמִּים. וּבְיוֹם זֶה מִיָּמִים. לִבְכִי עֲדֵי עַד סִבַּת. (וִיהִי נֹעַם נִשְׁבַּת. בְּמוֹצָאֵי הַשַׁבָּת): \n" +
					"חָלַף וִיהִי נוֹעַם. כָּל פֶּה יֵילִיל בְּרַעַם. אֵיכָה יָשְׁבָה בְזַעַם. הָעִיר רַבָּתִי עָם. יוֹם סָרוּ מִמִּרְעָם. יְדִידִים נְצוּרִים כְּבָבַת. (וִיהִי נֹעַם נִשְׁבַּת. בְּמוֹצָאֵי הַשַׁבָּת):");

				addToSiddur(
					"אֲנִי הַגֶּבֶר אֲקוֹנֵן. בְּלֵיל זֶה בְּמַר וְאֶתְאוֹנֵן. וְתַחַת וִיהִי נוֹעַם. אֵיכָה זָהָב יוּעַם: שַׁבָּת זֶה לֵיל תִּשְׁעָה בְּאָב. בְּצֵאתוֹ אֲיֵלִיל וְאֶדְאַב. וְאֶמְצֶה כוֹס תַּרְעֵלָה. תַּחַת כּוֹס הַהַבְדָּלָה: לַדּוֹרוֹת קָבַעְתִּי. נְהִי בְּלֵיל זֶה וְקוֹנַנְתִּי. וְאֶבְכֶּה וְאַשֵׁב מַשְׁמִים. וְלֹא אָרִיחַ עֲצֵי בְשָׂמִים: מַר לִי מַר בַּעֲוֹנָי. וְגָבְרוּ עָלַי מְעַנָּי. בִּשְׂרוֹף עִיר הַקֹּדֶשׁ. בּוֹרֵא מְאוֹרֵי הָאֵשׁ: הָהּ בְּמוֹצָאֵי שַׁבָּת. אַף גִּיל לְבָבִי שָׁבַת. וְהִרְבָּה יְגוֹנַי כַּחוֹל. הַמַּבְדִּיל בֵּין קֹדֶשׁ לְחוֹל: רְאֵה כִּי אֵין מְנַחֵם. וְאַכְזָר שָׁב מֵרַחֵם. וּמֵעֵת תִּשְׁעָה בְּאָב. יְתוֹמִים הָיִינוּ וְאֵין אָב: מִיּוֹם נָתְנוּ קוֹלָם. אָבוֹת בְּלֵיל זֶה חָטְאוּ בְּמַעֲלָם. קָבַעְתִּי לִי בִּכְיָה. תַּאֲנִיָּה וַאֲנִיָּה: אָבוֹת חָטְאוּ וְאֵינָם. וְאֵיךְ אֶסְבּוֹל אֲנִי עֲוֹנָם. הֲאִם שׁוֹכֵן עֲרָבוֹת. יוּמְתוּ בָּנִים עַל אָבוֹת: (קוּם בְּרַחֲמֶיךָ אֱלֹהֵינוּ. וְרַחֵם עָלֵינוּ. וַהֲפֹך אֶבְלֵנוּ לְשָׂשׂוֹן. בְּכָל לֵב יִשְׁעֲךָ אָדוֹן: נַחֵם אֲבֵלֵי צִיּוֹן. מְיַחֲלִים יֶשַׁע וּפִדְיוֹן. בְּשׁוּב שְׁבוּת בְּנֵי יִשְׂרָאֵל וּבָא לְצִיּוֹן גּוֹאֵל: בְּשׁוּב שְׁבוּת בְּנֵי יִשְׂרָאֵל וּבָא לְצִיּוֹן גּוֹאֵל:)");
			}

			addToSiddur(lineBreak);

			addToSiddur(
				"אַחֵינוּ בֵּית יִשְׂרָאֵל. שְׁמָעוּ, כִּי בַּעֲוֹנוֹתֵינוּ. אֲנַחְנוּ מוֹנִים לְחֻרְבַּן בֵּית מִקְדָּשֵׁנוּ. וְלִשְׂרֵיפַת הֵיכָלֵנוּ. וּלְגָלוּת שְׁכִינַת עֻזֵּנוּ. וְלִנְפִלַת עֲטֶרֶת רֹאשֵׁנוּ. וּלְפִזּוּר עַם הַקֹּדֶשׁ מִירוּשָׁלַיִם עִיר הַקֹּדֶשׁ.\n\n" +
				"ואומר את מנין השנים לחרבן בית המקדש והמספר הוא ס״ח שנים פחות ממניינם של העמים (Here we say the number of years from the destruction of the temple. It is 68 years minus the secular year)");
			addToSiddurHighlighted("הַיּוֹם "
				+ Utils.NumberToHebrew.numberToHebrew(jewishDateInfo.getJewishCalendar().getGregorianYear() - 68)
				+ " שָנָה לְחֻרְבַּן בֵּית מִקְדָשֵׁנוּ");// current year - 68 years
			addToSiddur(
				"אוֹי לָנוּ עַל גָּלוּת הַשְּׁכִינָה. אוֹי לָנוּ עַל חָרְבַּן בֵּית הַמִּקְדָּשׁ. אוֹי לָנוּ עַל שְׂרֵיפַת הַתּוֹרָה. אוֹי לָנוּ עַל הַרִיגַת הַצַּדִּיקִים. אוֹי לָנוּ עַל צַעֲרוֹ שֶׁל מָשִׁיחַ");
			addToSiddur(lineBreak);
		}

		if (halfKaddish || jewishDateInfo.getJewishCalendar().isTishaBav()) {
			addToSiddur(
				"וְאַתָּ֥ה קָד֑וֹשׁ י֝וֹשֵׁ֗ב תְּהִלּ֥וֹת יִשְׂרָאֵֽל׃ וְקָרָ֨א זֶ֤ה אֶל־זֶה֙ וְאָמַ֔ר קָד֧וֹשׁ ׀ קָד֛וֹשׁ קָד֖וֹשׁ יְהֹוָ֣ה צְבָא֑וֹת מְלֹ֥א כָל־הָאָ֖רֶץ כְּבוֹדֽוֹ׃ וּמְקַבְּלִין דֵּין מִן דֵּין וְאָֽמְרִין: קַדִּישׁ בִּשְׁמֵי מְרוֹמָא עִלָּאָה בֵּית שְׁכִינְתֵּהּ, קַדִּישׁ עַל אַרְעָא עוֹבַד גְּבוּרְתֵּהּ, קַדִּישׁ לְעָלַם וּלְעָֽלְמֵי עָֽלְמַיָּא. יְהֹוָה צְבָאוֹת מַלְיָא כָל־אַרְעָא זִיו יְקָרֵהּ: וַתִּשָּׂאֵ֣נִי ר֔וּחַ וָאֶשְׁמַ֣ע אַחֲרַ֔י ק֖וֹל רַ֣עַשׁ גָּד֑וֹל בָּר֥וּךְ כְּבוֹד־יְהֹוָ֖ה מִמְּקוֹמֽוֹ׃ וּנְטָלַֽתְנִי רוּחָא, וּשְׁמָעִית בַּתְרַי קַל זִֽיעַ שַׂגִּיא דִּמְשַׁבְּחִין וְאָֽמְרִין: בְּרִיךְ יְקָרָא דַֽיהֹוָה מֵֽאֲתַר בֵּית שְׁכִינְתֵּהּ: יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד: יְהֹוָה מַלְכוּתֵיהּ קָאִים לְעָלַם וּלְעָֽלְמֵי עָֽלְמַיָּא: יְהֹוָ֗ה אֱ֠לֹהֵי אַבְרָהָ֞ם יִצְחָ֤ק וְיִשְׂרָאֵל֙ אֲבֹתֵ֔ינוּ שֳׁמְרָה־זֹּ֣את לְעוֹלָ֔ם לְיֵ֥צֶר מַחְשְׁב֖וֹת לְבַ֣ב עַמֶּ֑ךָ וְהָכֵ֥ן לְבָבָ֖ם אֵלֶֽיךָ׃ וְה֤וּא רַח֨וּם ׀ יְכַפֵּ֥ר עָוֺן֮ וְֽלֹא־יַ֫שְׁחִ֥ית וְ֭הִרְבָּה לְהָשִׁ֣יב אַפּ֑וֹ וְלֹֽא־יָ֝עִיר כָּל־חֲמָתֽוֹ׃ כִּֽי־אַתָּ֣ה אֲ֭דֹנָי ט֣וֹב וְסַלָּ֑ח וְרַב־חֶ֝֗סֶד לְכָל־קֹרְאֶֽיךָ צִדְקָתְךָ֣ צֶ֣דֶק לְעוֹלָ֑ם וְֽתוֹרָתְךָ֥ אֱמֶֽת׃ תִּתֵּ֤ן אֱמֶת֙ לְיַֽעֲקֹ֔ב חֶ֖סֶד לְאַבְרָהָ֑ם אֲשֶׁר־נִשְׁבַּ֥עְתָּ לַאֲבֹתֵ֖ינוּ מִ֥ימֵי קֶֽדֶם׃ בָּ֤ר֣וּךְ אֲדֹנָי֮ י֤וֹם ׀ י֥וֹם יַֽעֲמָס־לָ֗נוּ הָ֘אֵ֤ל יְֽשׁוּעָתֵ֬נוּ סֶֽלָה׃ יְהֹוָ֣ה צְבָא֣וֹת עִמָּ֑נוּ מִשְׂגָּֽב־לָ֝נוּ אֱלֹהֵ֖י יַעֲקֹ֣ב סֶֽלָה: יְהֹוָ֥ה צְבָא֑וֹת אַֽשְׁרֵ֥י אָ֝דָ֗ם בֹּטֵ֥חַ בָּֽךְ׃ יְהֹוָ֥ה הוֹשִׁ֑יעָה הַ֝מֶּ֗לֶךְ יַעֲנֵ֥נוּ בְיוֹם־קָרְאֵֽנוּ׃\n\nבָּרוּךְ אֱלֹהֵֽינוּ שֶׁבְּרָאָֽנוּ לִכְבוֹדוֹ, וְהִבְדִּילָֽנוּ מִן הַתּוֹעִים, וְנָֽתַן לָֽנוּ תּוֹרַת אֱמֶת, וְחַיֵּי עוֹלָם נָטַע בְּתוֹכֵֽנוּ. הוּא יִפְתַּח לִבֵּֽנוּ בְּתֽוֹרָתוֹ, וְיָשִׂים בְּלִבֵּֽנוּ אַֽהֲבָתוֹ וְיִרְאָתוֹ לַֽעֲשׂוֹת רְצוֹנוֹ, וּלְעָבְדוֹ בְּלֵבָב שָׁלֵם. לֹא נִיגַע לָרִיק, וְלֹא נֵלֵד לַבֶּֽהָלָה. יְהִי רָצוֹן מִלְּפָנֶֽיךָ, יְהֹוָה אֱלֹהֵֽינוּ וֵֽאלֹהֵי אֲבוֹתֵֽינוּ, שֶׁנִּשְׁמוֹר חֻקֶּֽיךָ וּמִצְוֹתֶֽיךָ בָּעוֹלָם הַזֶּה, וְנִזְכֶּה, וְנִחְיֶה, וְנִירַשׁ טוֹבָה וּבְרָכָה לְחַיֵּי הָעוֹלָם הַבָּא: לְמַ֤עַן ׀ יְזַמֶּרְךָ֣ כָ֭בוֹד וְלֹ֣א יִדֹּ֑ם (יפסיק מעט/break) יְהֹוָ֥ה אֱ֝לֹהַ֗י לְעוֹלָ֥ם אוֹדֶֽךָּ׃ יְהֹוָ֥ה חָפֵ֖ץ לְמַ֣עַן צִדְק֑וֹ יַגְדִּ֥יל תּוֹרָ֖ה וְיַאְדִּֽיר: וְיִבְטְח֣וּ בְ֭ךָ יוֹדְעֵ֣י שְׁמֶ֑ךָ כִּ֤י לֹֽא־עָזַ֖בְתָּ דֹרְשֶׁ֣יךָ יְהֹוָֽה: יְהֹוָ֥ה אֲדֹנֵ֑ינוּ מָֽה־אַדִּ֥יר שִׁ֝מְךָ֗ בְּכָל־הָאָֽרֶץ׃ חִ֭זְקוּ וְיַאֲמֵ֣ץ לְבַבְכֶ֑ם כָּל־הַ֝מְיַחֲלִ֗ים לַיהֹוָֽה:");
			if (jewishDateInfo.getJewishCalendar().isTishaBav()) {
				addCategoryToSiddur("קדיש מיוחד");
				addToSiddur(
					"יִתְגַּדַּל וְיִתְקַדַּשׁ שְׁמֵהּ רַבָּא. [אמן] דְּהוּא עָתִיד לְחַדְתָּא עָלְמָא, וּלְאַחְיָּאָה מֵתַיָּא, וּלְשַׁכְלְלָא הֵיכָלָא. וּלְמִפְרַק חַיָּיָא. וּלְמִבְנֵה קַרְתָּא דִירוּשְׁלֵם. וּלְמֱעְקַר פּוּלְחָנָא נוּכְרׇאׇה מֵאַרְעָא. וּלְאָתְבָא פֻלְחָנָא יַקִּירָא דִשְׁמַיָא לְהַדְרֵהּ וְזִיוֵיהּ וִיקָרֵיהּ. וְיַצְמַח פֻּרְקָנֵהּ, וִיקָרֵב מְשִׁיחֵהּ. [אמן] בְּחַיֵּיכוֹן וּבְיוֹמֵיכוֹן וּבְחַיֵּי דְכָל בֵּית יִשְׂרָאֵל, בַּעֲגָלָא וּבִזְמַן קָרִיב וְאִמְרוּ אָמֵן. [אמן] יְהֵא שְׁמֵהּ רַבָּא מְבָרַךְ לְעָלַם לְעָלְמֵי עָלְמַיָּא יִתְבָּרַךְ וְיִשְׁתַּבַּח וְיִתְפָּאַר וְיִתְרוֹמַם וְיִתְנַשֵּׂא וְיִתְהַדָּר וְיִתְעַלֶּה וְיִתְהַלָּל, שְׁמֵיהּ דְּקֻדְשָׁא בְּרִיךְ הוּא. [אמן] לְעֵלָּא מִן־כָּל־בִּרְכָתָא, שִׁירָתָא, תִּשְׁבְּחָתָא וְנֶחֱמָתָא, דַּאֲמִירָן בְּעָלְמָא, וְאִמְרוּ אָמֵן: [אמן] \n" +
					"תִּתְכְּלֵי חַרְבָּא וְכַפְנָא וּמוֹתָנָא. וּמַרְעִין בִּישִׁין. יַעְדֵּא מִנָּנָא וּמִנְּכוֹן וּמֵעַל עַמֵּיהּ יִשְׂרָאֵל. וְאִמְרוּ אָמֵן: [אמן] \n" +
					"יְהֵא שְׁלָמָא רַבָּא מִן שְׁמַיָּא. חַיִּים וְשָׂבָע וִישׁוּעָה וְנֶחָמָה. וְשֵׁיזָבָא וּרְפוּאָה וּגְאוּלָה וּסְלִיחָה וְכַפָּרָה וְרֶוַח וְהַצָּלָה לָנוּ וּלְכָל עַמּוֹ יִשְׂרָאֵל. וְאִמְרוּ אָמֵן: [אמן] \n" +
					"עוֹשֶׂה שָׁלוֹם בִּמְרוֹמָיו. הוּא בְּרַחֲמָיו יַעֲשֶׂה שָׁלוֹם עָלֵינוּ וְעַל כָּל־עַמּוֹ יִשְׂרָאֵל. וְאִמְרוּ אָמֵן: [אמן]");
				addToSiddurHighlighted("עַד אָנָה בִּכְיָה בְּצִיּוֹן וּמִסְפֵּד בִּירוּשָׁלָיִם, תְָּשׁוּב תְּרַחֵם צִיּוֹן, וְתִּבְנֶה חוֹמוֹת יְרוּשָׁלָיִם:");
			} else {
				addKaddishTitkabal(false);
			}
		}

		addCategoryToSiddur("שיר למעלות");
		addToSiddur(
			"שִׁ֗יר לַֽמַּ֫עֲל֥וֹת אֶשָּׂ֣א עֵ֭ינַי אֶל־הֶהָרִ֑ים מֵ֝אַ֗יִן יָבֹ֥א עֶזְרִֽי׃ עֶ֭זְרִי מֵעִ֣ם יְהֹוָ֑ה עֹ֝שֵׂ֗ה שָׁמַ֥יִם וָאָֽרֶץ׃ אַל־יִתֵּ֣ן לַמּ֣וֹט רַגְלֶ֑ךָ אַל־יָ֝נ֗וּם שֹׁמְרֶֽךָ׃ הִנֵּ֣ה לֹֽא־יָ֭נוּם וְלֹ֣א יִישָׁ֑ן שׁ֝וֹמֵ֗ר יִשְׂרָאֵֽל׃ יְהֹוָ֥ה שֹׁמְרֶ֑ךָ יְהֹוָ֥ה צִ֝לְּךָ֗ עַל־יַ֥ד יְמִינֶֽךָ׃ יוֹמָ֗ם הַשֶּׁ֥מֶשׁ לֹֽא־יַכֶּ֗כָּה וְיָרֵ֥חַ בַּלָּֽיְלָה׃ יְֽהֹוָ֗ה יִשְׁמׇרְךָ֥ מִכָּל־רָ֑ע יִ֝שְׁמֹ֗ר אֶת־נַפְשֶֽׁךָ׃ יְֽהֹוָ֗ה יִשְׁמׇר־צֵאתְךָ֥ וּבוֹאֶ֑ךָ מֵ֝עַתָּ֗ה וְעַד־עוֹלָֽם׃");
		addKaddishYeheShelama();
		addBarchu(true);
		addAlenu();
		return siddur;
	}

	/**
	 * NOTE: Night prayer. The Date should be set to the next day.
	 */
	public ArrayList<HighlightString> getSefiratHaOmerPrayers() {
		siddur = new ArrayList<>();

		addInfoToSiddur("לְשֵׁם יִחוּד קֻדְשָׁא בְּרִיךְ הוּא וּשְׁכִינְתֵּיהּ, ",
			"בִּדְחִֽילוּ וּרְחִֽימוּ, וּרְחִֽימוּ וּדְחִֽילוּ, לְיַחֲדָא אוֹת יוֹ\"ד וְאוֹת הֵ\"א בְּאוֹת וָא\"ו וְאוֹת הֵ\"א בְּיִחוּדָא שְׁלִים בְּשֵׁם כָּל־יִשְׂרָאֵל. הִנֵּה אֲנַֽחְנוּ בָּאִים לְקַיֵּם מִצְוַת סְפִירַת הָעֹֽמֶר, עִם כָּל הַמִּצְוֹת הַכְּלוּלוֹת בָּהּ, לְתַקֵּן אֶת שָׁרְשָׁהּ בְּמָקוֹם עֶלְיוֹן, לַעֲשׂוֹת נַֽחַת רֽוּחַ לְיֽוֹצְרֵֽנוּ וְלַעֲשׂוֹת רְצוֹן בּֽוֹרְאֵֽנוּ. וִיהִ֤י ׀ נֹ֤עַם אֲדֹנָ֥י אֱלֹהֵ֗ינוּ עָ֫לֵ֥ינוּ וּמַעֲשֵׂ֣ה יָ֭דֵינוּ כּוֹנְנָ֥ה עָלֵ֑ינוּ וּֽמַעֲשֵׂ֥ה יָ֝דֵ֗ינוּ כּוֹנְנֵֽהוּ: יש אומרים: יְהֹוָה֮ יִגְמֹ֢ר בַּ֫עֲדִ֥י יְ֭הֹוָה חַסְדְּךָ֣ לְעוֹלָ֑ם מַעֲשֵׂ֖י יָדֶ֣יךָ אַל־תֶּֽרֶף: אֶ֭קְרָא לֵֽאלֹהִ֣ים עֶלְי֑וֹן לָ֝אֵ֗ל גֹּמֵ֥ר עָלָֽי: וָאֶעֱבֹ֤ר עָלַ֙יִךְ֙ וָֽאֶרְאֵ֔ךְ מִתְבּוֹסֶ֖סֶת בְּדָמָ֑יִךְ וָאֹ֤מַר לָךְ֙ בְּדָמַ֣יִךְ חֲיִ֔י וָאֹ֥מַר לָ֖ךְ בְּדָמַ֥יִךְ חֲיִֽי: בָּרְכִ֥י נַפְשִׁ֗י אֶת־יְהֹ֫וָ֥ה יְהֹוָ֣ה אֱ֭לֹהַי גָּדַ֣לְתָּ מְּאֹ֑ד ה֖וֹד וְהָדָ֣ר לָבָֽשְׁתָּ: עֹֽטֶה־א֭וֹר כַּשַּׂלְמָ֑ה נוֹטֶ֥ה שָׁ֝מַ֗יִם כַּיְרִיעָֽה:");
		addToSiddur("בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ עַל סְפִירַת הָעֹמֶר:");

		int day = jewishDateInfo.getJewishCalendar().getDayOfOmer() - 1;// the day is ahead, so minus it

		addToSiddur(omerList.get(day) + " (" + getSefirahAttribute(day) + ")" + "\n\n"
				+ "הָרַחֲמָן הוּא יַחֲזִיר עֲבוֹדַת בֵּית הַמִּקְדָּשׁ לִמְקוֹמָהּ בִּמְהֵרָה בְיָמֵֽינוּ אָמֵן:");

		addToSiddur(menorah);

		for (String singleAnah : anaBekoach) {
			addToSiddur(singleAnah);
		}

		return siddur;
	}

	public ArrayList<HighlightString> getBirchatHamazonPrayers() {
		siddur = new ArrayList<>();

		addToSiddur("יטול מים אחרונים, ויאמר (Wash your hands for mayim acharonim and say)");
		addToSiddur(menorah);
		addToSiddur(
			"אֲבָרְכָ֣ה אֶת־יְהֹוָ֣ה בְּכׇל־עֵ֑ת תָּ֝מִ֗יד תְּֽהִלָּת֥וֹ בְּפִֽי׃ ס֥וֹף דָּבָ֖ר הַכֹּ֣ל נִשְׁמָ֑ע אֶת־הָאֱלֹהִ֤ים יְרָא֙ וְאֶת־מִצְוֺתָ֣יו שְׁמ֔וֹר כִּי־זֶ֖ה כׇּל־הָאָדָֽם: תְּהִלַּ֥ת יְהֹוָ֗ה יְֽדַבֶּ֫ר פִּ֥י וִיבָרֵ֣ךְ כׇּל־בָּ֭שָׂר שֵׁ֥ם קׇדְשׁ֗וֹ לְעוֹלָ֥ם וָעֶֽד: וַאֲנַ֤חְנוּ ׀ נְבָ֘רֵ֤ךְ יָ֗הּ מֵעַתָּ֥ה וְעַד־עוֹלָ֗ם הַֽלְלוּיָֽהּ: וַיְדַבֵּ֣ר אֵלַ֔י זֶ֚ה הַשֻּׁלְחָ֔ן אֲשֶׁ֖ר לִפְנֵ֥י יְהֹוָֽה: \n\n" +
			"אם המסובים שלושה או יותר אומרים (If there are three or more people, we say) \n\n" +
			"יאמר המזמן (The leader says) \n\n" +
			"הַב לָן וְנִבְרִיךְ לְמַלְכָּא עִלָּאָה קַדִּישָׁא: \n\n" +
			"והמסובים עונים (The others say) \n\n" +
			"שָׁמַֽיִם:");

		addToSiddur("ואומר המזמן (The leader says) \n\nבִּרְשׁוּת מַלְכָּא עִלָּאָה קַדִּישָׁא");
		if (jewishDateInfo.getJewishCalendar().getDayOfWeek() == 7) {
			addToSiddurHighlighted("וּבִרְשׁוּת שַׁבָּת מַלְכְּתָא");
		}
		if (jewishDateInfo.getJewishCalendar().isYomTovAssurBemelacha()) {
			addToSiddurHighlighted("וּבִרְשׁוּת יוֹמָא טָבָא אוּשְׁפִּיזָא קַדִּישָׁא");
		}
		if (jewishDateInfo.getJewishCalendar().isSuccos()) {
			addToSiddurHighlighted("וּבִרְשׁוּת שִׁבְעָה אוּשְׁפִּיזִין עִלָּאִין קַדִּישִׁין");
		}
		addToSiddur("וּבִרְשׁוּת מוֹרַי וְרַבּוֹתַי וּבִרְשֽׁוּתְכֶֽם. נְבָרֵךְ\n(בעשרה ויותר/ten or more people: אֱלֹהֵֽינוּ)\n(בסעודת חתן/by a groom: שֶׁהַשִּׂמְחָה בִּמְעוֹנוֹ)\nשֶׁאָכַֽלְנוּ מִשֶּׁלּוֹ:");

		addToSiddur("והמסובים עונים (The others say) \n\n" +
			"בָּרוּךְ\n(בעשרה ויותר/ten or more people: אֱלֹהֵֽינוּ)\n(בסעודת חתן/by a groom: שֶׁהַשִּׂמְחָה בִּמְעוֹנוֹ)\nשֶׁאָכַֽלְנוּ מִשֶּׁלּוֹ וּבְטוּבוֹ חָיִֽינוּ: \n\n" +
			"והמזמן עונה (The leader answers back) \n\n" +
			"בָּרוּךְ\n(בעשרה ויותר/ten or more people: אֱלֹהֵֽינוּ)\n(בסעודת חתן/by a groom: שֶׁהַשִּׂמְחָה בִּמְעוֹנוֹ)\nשֶׁאָכַֽלְנוּ מִשֶּׁלּוֹ וּבְטוּבוֹ חָיִֽינוּ:");

		addCategoryToSiddur("ברכת המזון");

		addToSiddur("בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, הָאֵל הַזָּן אוֹתָֽנוּ וְאֶת־הָעוֹלָם כֻּלּוֹ בְּטוּבוֹ, בְּחֵן בְּחֶֽסֶד בְּרֶֽוַח וּבְרַחֲמִים רַבִּים, נֹתֵ֣ן לֶ֭חֶם לְכָל־בָּשָׂ֑ר כִּ֖י לְעוֹלָ֣ם חַסְדּֽוֹ. וּבְטוּבוֹ הַגָּדוֹל תָּמִיד לֹא חָֽסַר לָֽנוּ, וְאַל־יֶחְסַר לָֽנוּ מָזוֹן תָּמִיד לְעוֹלָם וָעֶד, כִּי הוּא אֵל זָן וּמְפַרְנֵס לַכֹּל וְשֻׁלְחָנוֹ עָרוּךְ לַכֹּל, וְהִתְקִין מִחְיָה וּמָזוֹן לְכָל־בְּרִיּוֹתָיו אֲשֶׁר בָּרָא בְּרַחֲמָיו וּבְרוֹב חֲסָדָיו. כָּאָמוּר, פּוֹתֵ֥חַ אֶת־יָדֶ֑ךָ וּמַשְׂבִּ֖יעַ לְכׇל־חַ֣י רָצֽוֹן. בָּרוּךְ אַתָּה יְהֹוָה, הַזָּן אֶת־הַכֹּל: \n\n" +
						"נוֹדֶה לְךָ יְהֹוָה אֱלֹהֵֽינוּ עַל שֶׁהִנְחַֽלְתָּ לַאֲבוֹתֵֽינוּ, אֶֽרֶץ חֶמְדָּה טוֹבָה וּרְחָבָה בְּרִית וְתוֹרָה חַיִּים וּמָזוֹן, עַל שֶׁהוֹצֵאתָֽנוּ מֵאֶֽרֶץ מִצְרַֽיִם, וּפְדִיתָֽנוּ מִבֵּית עֲבָדִים, וְעַל בְּרִֽיתְךָֽ שֶׁחָתַֽמְתָּ בִּבְשָׂרֵֽנוּ, וְעַל תּוֹרָֽתְךָֽ שֶׁלִּמַּדְתָּֽנוּ, וְעַל חֻקֵּי רְצוֹנָךְ שֶׁהוֹדַעְתָּֽנוּ, וְעַל חַיִּים וּמָזוֹן שֶׁאַתָּה זָן וּמְפַרְנֵס אוֹתָֽנוּ:");

		if (jewishDateInfo.getJewishCalendar().isChanukah() || jewishDateInfo.getJewishCalendar().isPurim()) {
			if (jewishDateInfo.getJewishCalendar().getIsSafekMukafChoma()) {
				addToSiddurHighlighted("בספק מוקפת חומה, עדיף שלא לומר ועל הניסים ב-15./In a safek mukaf choma, it is better not to say \"Al Hanisim\" on the 15th. (הליכות עולם רלב)");
			}
			addToSiddurHighlighted("וְעַל הַנִּסִּים וְעַל הַפֻּרְקָן וְעַל הַגְּבוּרוֹת וְעַל הַתְּשׁוּעוֹת וְעַל הַנִּפְלָאוֹת וְעַל הַנֶּחָמוֹת שֶׁעָשִֽׂיתָ לַאֲבוֹתֵֽינוּ בַּיָּמִים הָהֵם בַּזְּמַן הַזֶּה:");
		}

		if (jewishDateInfo.getJewishCalendar().isChanukah()) {
			addToSiddurHighlighted(
				"בִּימֵי מַתִּתְיָה בֶן־יוֹחָנָן כֹּהֵן גָּדוֹל חַשְׁמוֹנָאי וּבָנָיו, כְּשֶׁעָֽמְדָֽה מַלְכוּת יָוָן הָרְשָׁעָה עַל עַמְּךָ יִשְׂרָאֵל, לְשַׁכְּחָם תּוֹרָתָךְ וּלְהַעֲבִירָם מֵחֻקֵּי רְצוֹנָךְ, וְאַתָּה בְּרַחֲמֶֽיךָ הָרַבִּים עָמַֽדְתָּ לָהֶם בְּעֵת צָרָתָם, רַֽבְתָּ אֶת רִיבָם, דַּֽנְתָּ אֶת דִּינָם, נָקַֽמְתָּ אֶת נִקְמָתָם, מָסַֽרְתָּ גִבּוֹרִים בְּיַד חַלָּשִׁים, וְרַבִּים בְּיַד מְעַטִּים, וּרְשָׁעִים בְּיַד צַדִּיקִים, וּטְמֵאִים בְּיַד טְהוֹרִים, וְזֵדִים בְּיַד עֽוֹסְקֵֽי תוֹרָתֶֽךָ. לְךָ עָשִֽׂיתָ שֵׁם גָּדוֹל וְקָדוֹשׁ בְּעוֹלָמָךְ, וּלְעַמְּךָ יִשְׂרָאֵל עָשִֽׂיתָ תְּשׁוּעָה גְדוֹלָה וּפֻרְקָן כְּהַיּוֹם הַזֶּה. וְאַחַר כָּךְ בָּֽאוּ בָנֶֽיךָ לִדְבִיר בֵּיתֶֽךָ, וּפִנּוּ אֶת־הֵיכָלֶֽךָ, וְטִהֲרוּ אֶת־מִקְדָּשֶֽׁךָ, וְהִדְלִֽיקוּ נֵרוֹת בְּחַצְרוֹת קָדְשֶֽׁךָ. וְקָֽבְעֽוּ שְׁמוֹנַת יְמֵי חֲנֻכָּה אֵֽלּוּ בְּהַלֵּל וּבְהוֹדָאָה. וְעָשִֽׂיתָ עִמָּהֶם נִסִּים וְנִפְלָאוֹת וְנוֹדֶה לְשִׁמְךָ הַגָּדוֹל סֶֽלָה:");
		} else if (jewishDateInfo.getJewishCalendar().isPurim()) {
			addToSiddurHighlighted("בִּימֵי מָרְדְּכַי וְאֶסְתֵּר בְּשׁוּשַׁן הַבִּירָה. כְּשֶׁעָמַד עֲלֵיהֶם הָמָן הָרָשָׁע. בִּקֵּשׁ לְהַשְׁמִיד לַהֲרֹג וּלְאַבֵּד אֶת־כָּל־הַיְּהוּדִים מִנַּֽעַר וְעַד זָקֵן טַף וְנָשִׁים בְּיוֹם אֶחָד. בִּשְׁלֹשָׁה עָשָׂר לְחֹֽדֶשׁ שְׁנֵים עָשָׂר. הוּא חֹֽדֶשׁ אֲדָר. וּשְׁלָלָם לָבוֹז. וְאַתָּה בְּרַחֲמֶֽיךָ הָרַבִּים הֵפַֽרְתָּ אֶת־עֲצָתוֹ וְקִלְקַֽלְתָּ אֶת־מַחֲשַׁבְתּוֹ. וַהֲשֵׁבֽוֹתָ לּוֹ גְּמוּלוֹ בְרֹאשׁוֹ. וְתָלוּ אוֹתוֹ וְאֶת־בָּנָיו עַל הָעֵץ. וְעָשִֽׂיתָ עִמָּהֶם נִסִּים וְנִפְלָאוֹת וְנוֹדֶה לְשִׁמְךָ הַגָּדוֹל סֶֽלָה:");
		}

		addToSiddur(
			"וְעַל הַכֹּל יְהֹוָה אֱלֹהֵֽינוּ אֲנַֽחְנוּ מוֹדִים לָךְ, וּמְבָֽרְכִֽים אוֹתָךְ. כָּאָמוּר, וְאָֽכַלְתָּ֖ וְשָׂבָ֑עְתָּ וּבֵֽרַכְתָּ֙ אֶת־יְהֹוָ֣ה אֱלֹהֶ֔יךָ עַל־הָאָ֥רֶץ הַטֹּבָ֖ה אֲשֶׁ֥ר נָֽתַן־לָֽךְ. בָּרוּךְ אַתָּה יְהֹוָה, עַל הָאָֽרֶץ וְעַל הַמָּזוֹן: \n\n" +
			"רַחֵם יְהֹוָה אֱלֹהֵֽינוּ עָלֵֽינוּ וְעַל יִשְׂרָאֵל עַמָּךְ, וְעַל יְרוּשָׁלַֽיִם עִירָךְ, וְעַל הַר צִיּוֹן מִשְׁכַּן כְּבוֹדָךְ, וְעַל הֵיכָלָךְ, וְעַל מְעוֹנָךְ, וְעַל דְּבִירָךְ, וְעַל הַבַּֽיִת הַגָּדוֹל וְהַקָּדוֹשׁ שֶׁנִּקְרָא שִׁמְךָ עָלָיו. אָבִֽינוּ, רְעֵֽנוּ, זוּנֵֽנוּ, פַּרְנְסֵֽנוּ, כַּלְכְּלֵֽנוּ, הַרְוִיחֵֽנוּ הַרְוַח־לָֽנוּ מְהֵרָה מִכָּל־צָרוֹתֵֽינוּ. וְנָא, אַל תַּצְרִיכֵֽנוּ יְהֹוָה אֱלֹהֵֽינוּ, לִידֵי מַתְּנוֹת בָּשָׂר וָדָם וְלֹא לִידֵי הַלְוָאָתָם, אֶלָּא לְיָֽדְךָֽ הַמְּלֵאָה וְהָרְחָבָה, הָעֲשִׁירָה וְהַפְּתוּחָה, יְהִי רָצוֹן שֶׁלֹּא נֵבוֹשׁ בָּעוֹלָם הַזֶּה, וְלֹא נִכָּלֵם לָעוֹלָם הַבָּא, וּמַלְכוּת בֵּית דָּוִד מְשִׁיחָךְ תַּחֲזִירֶֽנָּה לִמְקוֹמָהּ בִּמְהֵרָה בְיָמֵֽינוּ:");

		// I added the shabbat text here because it might be RESEARCHED and not used, it was also one line

		if (jewishDateInfo.getJewishCalendar().getDayOfWeek() == 7) {
			addToSiddurHighlighted("רְצֵה וְהַחֲלִיצֵֽנוּ יְהֹוָה אֱלֹהֵֽינוּ בְּמִצְוֹתֶֽיךָ וּבְמִצְוַת יוֹם הַשְּׁבִיעִי, הַשַּׁבָּת הַגָּדוֹל וְהַקָּדוֹשׁ (לפני צאת השבת/before shabbat ends: הַזֶּה). כִּי יוֹם גָּדוֹל וְקָדוֹשׁ הוּא מִלְּפָנֶֽיךָ, נִשְׁבּוֹת בּוֹ וְנָנֽוּחַ בּוֹ וְנִתְעַנֵּג בּוֹ כְּמִצְוַת חֻקֵּי רְצוֹנָךְ, וְאַל־תְּהִי צָרָה וְיָגוֹן בְּיוֹם מְנוּחָתֵֽנוּ. וְהַרְאֵֽנוּ בְּנֶחָמַת צִיּוֹן בִּמְהֵרָה בְיָמֵֽינוּ, כִּי אַתָּה הוּא בַּֽעַל הַנֶּחָמוֹת. וַהֲגַם שֶׁאָכַֽלְנוּ וְשָׁתִֽינוּ חָרְבַּן בֵּֽיתְךָֽ הַגָּדוֹל וְהַקָּדוֹשׁ לֹא שָׁכַֽחְנוּ. אַל־תִּשְׁכָּחֵֽנוּ לָנֶֽצַח וְאַל־תִּזְנָחֵֽנוּ לָעַד כִּי אֵל מֶֽלֶךְ גָּדוֹל וְקָדוֹשׁ אָֽתָּה:");
		}

		if ((jewishDateInfo.getJewishCalendar().isYomTovAssurBemelacha()
				&& jewishDateInfo.getJewishCalendar().getYomTovIndex() != JewishCalendar.YOM_KIPPUR)
				|| jewishDateInfo.getJewishCalendar().isCholHamoed()
				|| jewishDateInfo.getJewishCalendar().isRoshChodesh()) {

			addToSiddurHighlighted("אֱלֹהֵֽינוּ וֵאלֹהֵי אֲבוֹתֵֽינוּ, יַעֲלֶה וְיָבֹא, וְיַגִּֽיעַ וְיֵרָאֶה, וְיֵרָצֶה וְיִשָּׁמַע, וְיִפָּקֵד וְיִזָּכֵר, זִכְרוֹנֵֽנוּ וְזִכְרוֹן אֲבוֹתֵֽינוּ, זִכְרוֹן יְרוּשָׁלַֽיִם עִירָךְ, וְזִכְרוֹן מָשִֽׁיחַ בֶּן־דָּוִד עַבְדָּךְ, וְזִכְרוֹן כָּל־עַמְּךָ בֵּית יִשְׂרָאֵל לְפָנֶֽיךָ, לִפְלֵיטָה, לְטוֹבָה, לְחֵן, לְחֶֽסֶד וּלְרַחֲמִים, לְחַיִּים טוֹבִים וּלְשָׁלוֹם, בְּיוֹם");

			if (jewishDateInfo.getJewishCalendar().isRoshChodesh()) {
				addToSiddurHighlighted("רֹאשׁ הַחֹֽדֶשׁ הַזֶּה,");
			}

			switch (jewishDateInfo.getJewishCalendar().getYomTovIndex()) {
				case JewishCalendar.PESACH:
					addToSiddurHighlighted("חַג הַמַּצּוֹת הַזֶּה, בְּיוֹם טוֹב מִקְרָא קֹֽדֶשׁ הַזֶּה,");
					break;
				case JewishCalendar.CHOL_HAMOED_PESACH:
					addToSiddurHighlighted("חַג הַמַּצּוֹת הַזֶּה, בְּיוֹם מִקְרָא קֹֽדֶשׁ הַזֶּה,");
					break;
				case JewishCalendar.SHAVUOS:
					addToSiddurHighlighted("חַג הַשָּׁבוּעוֹת הַזֶּה, בְּיוֹם טוֹב מִקְרָא קֹֽדֶשׁ הַזֶּה,");
					break;
				case JewishCalendar.ROSH_HASHANA:
					addToSiddurHighlighted("הַזִּכָּרוֹן הַזֶּה, בְּיוֹם טוֹב מִקְרָא קֹֽדֶשׁ הַזֶּה,");
					break;
				case JewishCalendar.SUCCOS:
					addToSiddurHighlighted("חַג הַסֻּכּוֹת הַזֶּה, בְּיוֹם טוֹב מִקְרָא קֹֽדֶשׁ הַזֶּה,");
					break;
				case JewishCalendar.CHOL_HAMOED_SUCCOS:
					addToSiddurHighlighted("חַג הַסֻּכּוֹת הַזֶּה, בְּיוֹם מִקְרָא קֹֽדֶשׁ הַזֶּה,");
					break;
				case JewishCalendar.SHEMINI_ATZERES:
				case JewishCalendar.SIMCHAS_TORAH:
					addToSiddurHighlighted("שְׁמִינִי חַג עֲצֶֽרֶת הַזֶּה, בְּיוֹם טוֹב מִקְרָא קֹֽדֶשׁ הַזֶּה,");
			}

			addToSiddurHighlighted("לְרַחֵם בּוֹ עָלֵֽינוּ וּלְהוֹשִׁיעֵֽנוּ. זָכְרֵֽנוּ יְהֹוָה אֱלֹהֵֽינוּ בּוֹ לְטוֹבָה, וּפָקְדֵֽנוּ בוֹ לִבְרָכָה, וְהוֹשִׁיעֵֽנוּ בוֹ לְחַיִּים טוֹבִים, בִּדְבַר יְשׁוּעָה וְרַחֲמִים, חוּס וְחָנֵּֽנוּ, וַחֲמוֹל וְרַחֵם עָלֵֽינוּ, וְהוֹשִׁיעֵֽנוּ כִּי אֵלֶֽיךָ עֵינֵֽינוּ, כִּי אֵל מֶֽלֶךְ חַנּוּן וְרַחוּם אָֽתָּה:");
		}

		addToSiddur(
			"וְתִבְנֶה יְרוּשָׁלַֽיִם עִירָךְ בִּמְהֵרָה בְיָמֵֽינוּ. בָּרוּךְ אַתָּה יְהֹוָה. בּוֹנֵה יְרוּשָׁלָֽיִם (ואומר בלחש/say quietly) אָמֵן: \n\nבָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, לָעַד הָאֵל אָבִֽינוּ, מַלְכֵּֽנוּ, אַדִּירֵֽנוּ, בּֽוֹרְאֵֽנוּ, גּוֹאֲלֵֽנוּ, קְדוֹשֵֽׁנוּ קְדוֹשׁ יַעֲקֹב, רוֹעֵֽנוּ רוֹעֵה יִשְׂרָאֵל. הַמֶּֽלֶךְ הַטּוֹב, וְהַמֵּטִיב לַכֹּל, שֶׁבְּכָל־יוֹם וָיוֹם הוּא הֵטִיב לָֽנוּ, הוּא מֵטִיב לָֽנוּ, הוּא יֵיטִיב לָֽנוּ, הוּא גְמָלָֽנוּ, הוּא גֽוֹמְלֵֽנוּ, הוּא יִגְמְלֵֽנוּ לָעַד חֵן וָחֶֽסֶד וְרַחֲמִים וְרֶֽוַח וְהַצָּלָה וְכָל־טוֹב: יענו אמן (say amen) \n\n" +
			"הָרַחֲמָן הוּא יִשְׁתַּבַּח עַל כִּסֵּא כְבוֹדוֹ: הָרַחֲמָן הוּא יִשְׁתַּבַּח בַּשָּׁמַֽיִם וּבָאָֽרֶץ: הָרַחֲמָן הוּא יִשְׁתַּבַּח בָּֽנוּ לְדוֹר דּוֹרִים: הָרַחֲמָן הוּא קֶֽרֶן לְעַמּוֹ יָרִים: הָרַחֲמָן הוּא יִתְפָּאַר בָּֽנוּ לְנֵֽצַח נְצָחִים: הָרַחֲמָן הוּא יְפַרְנְסֵֽנוּ בְּכָבוֹד וְלֹא בְבִזּוּי בְּהֶתֵּר וְלֹא בְאִסּוּר בְּנַֽחַת וְלֹא בְצַֽעַר: הָרַחֲמָן הוּא יִתֵּן שָׁלוֹם בֵּינֵֽינוּ: הָרַחֲמָן הוּא יִשְׁלַח בְּרָכָה רְוָחָה וְהַצְלָחָה בְּכָל־מַעֲשֵׂה יָדֵֽינוּ: הָרַחֲמָן הוּא יַצְלִֽיחַ אֶת־דְּרָכֵֽינוּ: הָרַחֲמָן הוּא יִשְׁבֹּר עֹל גָּלוּת מְהֵרָה מֵעַל צַוָּארֵֽנוּ: הָרַחֲמָן הוּא יוֹלִיכֵֽנוּ מְהֵרָה קוֹמְמִיּוּת לְאַרְצֵֽנוּ: הָרַחֲמָן הוּא יִרְפָּאֵֽנוּ רְפוּאָה שְׁלֵמָה, רְפוּאַת הַנֶּֽפֶשׁ וּרְפוּאַת הַגּוּף: הָרַחֲמָן הוּא יִפְתַּח לָנוּ אֶת יָדוֹ הָרְחָבָה:");

		addToSiddur("הָרַחֲמָן הוּא יְבָרֵךְ כָּל־אֶחָד וְאֶחָד מִמֶּֽנּוּ");

		addInfoToSiddur(
				"וכשאומר הרחמן יברך כל אחד ואחד ממנו, אם יש עכו\"ם יושבים שם יאמר (Add when eating in public)",
				"\n\n" + "בְּנֵי בְרִית [בן איש חי שנה א, חקת י״ח]");

		addToSiddur("בִּשְׁמוֹ הַגָּדוֹל כְּמוֹ שֶׁנִּתְבָּֽרְכֽוּ אֲבוֹתֵֽינוּ אַבְרָהָם יִצְחָק וְיַעֲקֹב, בַּכֹּל מִכֹּל כֹּל, כֵּן יְבָרֵךְ אוֹתָֽנוּ יַֽחַד בְּרָכָה שְׁלֵמָה, וְכֵן יְהִי רָצוֹן וְנֹאמַר אָמֵן: הָרַחֲמָן הוּא יִפְרוֹשׂ עָלֵֽינוּ סֻכַּת שְׁלוֹמוֹ:");

		if (jewishDateInfo.getJewishCalendar().getDayOfWeek() == 7) {
			addToSiddurHighlighted("הָרַחֲמָן הוּא יַנְחִילֵֽנוּ עוֹלָם שֶׁכֻּלּוֹ שַׁבָּת וּמְנוּחָה לְחַיֵּי הָעוֹלָמִים:");
		}

		if (jewishDateInfo.getJewishCalendar().isRoshChodesh()) {
			addToSiddurHighlighted("הָרַחֲמָן הוּא יְחַדֵּשׁ עָלֵֽינוּ אֶת הַחֹֽדֶשׁ הַזֶּה לְטוֹבָה וְלִבְרָכָה:");
		}

		switch (jewishDateInfo.getJewishCalendar().getYomTovIndex()) {
			case JewishCalendar.ROSH_HASHANA:
				addToSiddurHighlighted("הָרַחֲמָן הוּא יְחַדֵּשׁ עָלֵֽינוּ אֶת הַשָּׁנָה הַזֹּאת לְטוֹבָה וְלִבְרָכָה:");
				break;
			case JewishCalendar.SUCCOS:
			case JewishCalendar.CHOL_HAMOED_SUCCOS:
				addToSiddurHighlighted("הָרַחֲמָן הוּא יְזַכֵּֽנוּ לֵישֵׁב בְּסֻכַּת עוֹרוֹ שֶׁל לִוְיָתָן: הָרַחֲמָן הוּא יַשְׁפִּֽיעַ עָלֵֽינוּ שֶֽׁפַע קְדֻשָּׁה וְטָהֳרָה מִשִּׁבְעָה אוּשְׁפִּיזִין עִלָּאִין קַדִּישִׁין, זְכוּתָם תְּהֵא מָגֵן וְצִנָּה בַּעֲדֵֽינוּ: הָרַחֲמָן הוּא יָקִים לָֽנוּ אֶת סֻכַּת דָּוִד הַנּוֹפֶֽלֶת:");
			case JewishCalendar.PESACH:
			case JewishCalendar.CHOL_HAMOED_PESACH:
			case JewishCalendar.SHAVUOS:
				addToSiddurHighlighted("הָרַחֲמָן הוּא יַגִּיעֵֽנוּ לְמוֹעֲדִים אֲחֵרִים הַבָּאִים לִקְרָאתֵֽנוּ לְשָׁלוֹם:");
				break;
		}

		if (jewishDateInfo.getJewishCalendar().isYomTovAssurBemelacha()) {
			addToSiddurHighlighted("הָרַחֲמָן הוּא יַנְחִילֵֽנוּ יוֹם שֶׁכֻּלּוֹ טוֹב:");
		}

		addToSiddur("הָרַחֲמָן הוּא יִטַּע תּוֹרָתוֹ וְאַהֲבָתוֹ בְּלִבֵּֽנוּ וְתִהְיֶה יִרְאָתוֹ עַל פָּנֵֽינוּ לְבִלְתִּי נֶחֱטָא. וְיִהְיוּ כָל־מַעֲשֵֽׂינוּ לְשֵׁם שָׁמָֽיִם:");
		addInfoToSiddur("אורח אומר (A guest says)",
			"\n\nהָרַחֲמָן הוּא יְבָרֵךְ אֶת הַשֻּׁלְחָן הַזֶּה שֶׁאָכַֽלְנוּ עָלָיו וִיסַדֵּר בּוֹ כָּל־מַעֲדַנֵּי עוֹלָם, וְיִהְיֶה כְּשֻׁלְחָנוֹ שֶׁל אַבְרָהָם אָבִֽינוּ, כָּל־רָעֵב מִמֶּֽנּוּ יֹאכַל וְכָל־צָמֵא מִמֶּֽנּוּ יִשְׁתֶּה, וְאַל־יֶחְסַר מִמֶּֽנּוּ כָּל־טוּב לָעַד וּלְעֽוֹלְמֵֽי עוֹלָמִים, אָמֵן. הָרַחֲמָן הוּא יְבָרֵךְ בַּֽעַל הַבַּֽיִת הַזֶּה וּבַֽעַל הַסְּעוּדָּה הַזֹּאת, הוּא וּבָנָיו וְאִשְׁתּוֹ וְכָל־אֲשֶׁר לוֹ, בְּבָנִים שֶׁיִּחְיוּ וּבִנְכָסִים שֶׁיִּרְבּוּ. בָּרֵ֤ךְ יְהֹוָה֙ חֵיל֔וֹ וּפֹ֥עַל יָדָ֖יו תִּרְצֶ֑ה. וְיִהְיוּ נְכָסָיו וּנְכָסֵֽינוּ מֻצְלָחִים וּקְרוֹבִים לָעִיר, וְאַל־יִזְדַּקֵּק לְפָנָיו וְלֹא לְפָנֵֽינוּ שׁוּם דְבַר חֵטְא וְהִרְהוּר עָוֹן. שָׂשׂ וְשָׂמֵֽחַ כָּל־הַיָּמִים, בְּעֹֽשֶׁר וְכָבוֹד, מֵעַתָּה וְעַד עוֹלָם. לֹא יֵבוֹשׁ בָּעוֹלָם הַזֶּה, וְלֹא יִכָּלֵם לָעוֹלָם הַבָּא, אָמֵן כֵּן יְהִי רָצוֹן:");
		addToSiddur(lineBreak);
		addInfoToSiddur("בסעודת חתן (By a meal of a groom)",
			"\n\nהָרַחֲמָן הוּא יְבָרֵךְ אֶת הֶחָתָן וְהַכַּלָּה, בְּבָנִים זְכָרִים לַעֲבוֹדָתוֹ יִתְבָּרַךְ: הָרַחֲמָן הוּא יְבָרֵךְ אֶת כָּל־הַמְּסֻבִּין בַּשֻּׁלְחָן הַזֶּה וְיִתֵּן לָֽנוּ הַקָּדוֹשׁ בָּרוּךְ הוּא מִשְׁאֲלוֹת לִבֵּֽנוּ לְטוֹבָה:");
		addToSiddur(lineBreak);
		addInfoToSiddur("בסעודת מילה (By a meal for a circumcision)",
			" \n\nהָרַחֲמָן הוּא יְבָרֵךְ אֶת בַּֽעַל הַבַּֽיִת הַזֶּה, אֲבִי הַבֵּן, הוּא וְאִשְׁתּוֹ הַיּוֹלֶֽדֶת, מֵעַתָּה וְעַד עוֹלָם: הָרַחֲמָן הוּא יְבָרֵךְ אֶת הַיֶּֽלֶד הַנּוֹלָד, וּכְשֵׁם שֶׁזִּכָּֽהוּ הַקָּדוֹשׁ בָּרוּךְ הוּא לַמִּילָה, כֵּן יְזַכֵּֽהוּ לְהִכָּנֵס לַתּוֹרָה וְלַחֻפָּה וְלַמִּצְוֹת וּלְמַעֲשִׂים טוֹבִים, וְכֵן יְהִי רָצוֹן וְנֹאמַר אָמֵן: הָרַחֲמָן הוּא יְבָרֵךְ אֶת מַעֲלַת הַסַּנְדָּק וְהַמּוֹהֵל וּשְׁאָר הַמִּשְׁתַּדְּלִים בַּמִּצְוָה הֵם וְכָל־אֲשֶׁר לָהֶם:");
		addToSiddur("הָרַחֲמָן הוּא יְחַיֵּֽנוּ וִיזַכֵּֽנוּ וִיקָֽרְבֵֽנוּ לִימוֹת הַמָּשִֽׁיחַ וּלְבִנְיַן בֵּית הַמִּקְדָּשׁ וּלְחַיֵּי הָעוֹלָם הַבָּא.");

		if (jewishDateInfo.getJewishCalendar().isRoshChodesh()
				|| (jewishDateInfo.getJewishCalendar().isAssurBemelacha()
						&& !jewishDateInfo.getJewishCalendar().isYomKippur())
				|| jewishDateInfo.getJewishCalendar().isCholHamoed()
				|| jewishDateInfo.getJewishCalendar().isPurim()) {
			addToSiddurHighlighted("מִגְדּ֖וֹל");
		} else {
			addToSiddur("על סיום מסכת או ברית מילה אומרים \"מגדול\" ('By a Siyum Masechet or Brit Milah say 'migdol)");
			addToSiddur("מַגְדִּיל");
		}

		addToSiddur("יְשׁוּע֣וֹת מַלְכּ֑וֹ וְעֹֽשֶׂה־חֶ֧סֶד לִמְשִׁיח֛וֹ לְדָוִ֥ד וּלְזַרְע֖וֹ עַד־עוֹלָֽם: כְּ֭פִירִים רָשׁ֣וּ וְרָעֵ֑בוּ וְדֹרְשֵׁ֥י יְ֝הֹוָ֗ה לֹא־יַחְסְר֥וּ כָל־טֽוֹב: נַ֤עַר ׀ הָיִ֗יתִי גַּם־זָ֫קַ֥נְתִּי וְֽלֹא־רָ֭אִיתִי צַדִּ֣יק נֶעֱזָ֑ב וְ֝זַרְע֗וֹ מְבַקֶּשׁ־לָֽחֶם: כָּל־הַ֭יּוֹם חוֹנֵ֣ן וּמַלְוֶ֑ה וְ֝זַרְע֗וֹ לִבְרָכָֽה: מַה־שֶּׁאָכַֽלְנוּ יִהְיֶה לְשָׂבְעָה. וּמַה־שֶּׁשָּׁתִֽינוּ יִהְיֶה לִרְפוּאָה. וּמַה־שֶּׁהוֹתַֽרְנוּ יִהְיֶה לִבְרָכָה. כְּדִכְתִיב. וַיִּתֵּ֧ן לִפְנֵיהֶ֛ם וַיֹּאכְל֥וּ וַיּוֹתִ֖רוּ כִּדְבַ֥ר יְהֹוָֽה: בְּרוּכִ֣ים אַ֭תֶּם לַיהֹוָ֑ה עֹ֝שֵׂ֗ה שָׁמַ֥יִם וָאָֽרֶץ: בָּר֣וּךְ הַגֶּ֔בֶר אֲשֶׁ֥ר יִבְטַ֖ח בַּיהֹוָ֑ה וְהָיָ֥ה יְהֹוָ֖ה מִבְטַחֽוֹֹ: יְֽהֹוָ֗ה עֹ֭ז לְעַמּ֣וֹ יִתֵּ֑ן יְהֹוָ֓ה ׀ יְבָרֵ֖ךְ אֶת־עַמּ֣וֹ בַשָּׁלֽוֹם: עֹשֶׂה שָׁלוֹם בִּמְרוֹמָיו, הוּא בְּרַחֲמָיו יַעֲשֶׂה שָׁלוֹם עָלֵֽינוּ. וְעַל כָּל־עַמּוֹ יִשְׂרָאֵל, וְאִמְרוּ אָמֵן:");

		return siddur;
	}

	public ArrayList<HighlightString> getBirchatMeeyinShaloshPrayers(String[] items) {
		siddur = new ArrayList<>();
		StringBuilder full = new StringBuilder();
		for (String item : items) {
			full.append(item).append(" ");
		}
		String allItems = full.toString();
		boolean mezonot = allItems.contains("5 Grains") || allItems.contains("חמשת מיני דגן");
		boolean wine = allItems.contains("Wine") || allItems.contains("יין");
		boolean fruits = allItems.contains("Olives, dates, grapes, figs and/or pomegranates")
				|| allItems.contains("זיתים, תמרים, ענבים, תאנים ו/או רימונים");
		boolean other = allItems.contains("Other") || allItems.contains("אחר");

		if (other && !mezonot && !wine && !fruits) {
			addToSiddur(
					"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, בּוֹרֵא נְפָשׁוֹת רַבּוֹת וְחֶסְרוֹנָן עַל כָּל־מַה־שֶּׁבָּרָֽאתָ לְהַחֲיוֹת בָּהֶם נֶֽפֶשׁ כָּל־חָי, בָּרוּךְ חַי הָעוֹלָמִים.");
		} else {
			addToSiddur("בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם");

			if (mezonot) {
				addToSiddur("עַל הַמִּחְיָה וְעַל הַכַּלְכָּלָה");
			}
			if (wine) {
				addToSiddur("(וְ)עַל הַגֶּֽפֶן וְעַל פְּרִי הַגֶּֽפֶן".replace("(וְ)", (mezonot) ? "וְ" : ""));
			}
			if (fruits) {
				addToSiddur("(וְ)עַל הָעֵץ וְעַל פְּרִי הָעֵץ".replace("(וְ)", (mezonot || wine) ? "וְ" : ""));
			}

			addToSiddur("וְעַל תְּנוּבַת הַשָּׂדֶה, וְעַל אֶֽרֶץ חֶמְדָּה טוֹבָה וּרְחָבָה, שֶׁרָצִֽיתָ וְהִנְחַֽלְתָּ לַאֲבוֹתֵֽינוּ, לֶאֱכֹל מִפִּרְיָהּ וְלִשְׂבֹּֽעַ מִטּוּבָהּ. רַחֵם יְהֹוָה אֱלֹהֵֽינוּ עָלֵֽינוּ וְעַל יִשְׂרָאֵל עַמָּךְ, וְעַל יְרוּשָׁלַֽיִם עִירָךְ, וְעַל הַר צִיּוֹן מִשְׁכַּן כְּבוֹדָךְ, וְעַל מִזְבָּחָךְ וְעַל הֵיכָלָךְ. וּבְנֵה יְרוּשָׁלַֽיִם עִיר הַקֹּֽדֶשׁ בִּמְהֵרָה בְיָמֵֽינוּ, וְהַעֲלֵֽנוּ לְתוֹכָהּ, וְשַׂמְּחֵֽנוּ בְּבִנְיָנָהּ, וּנְבָֽרְכָֽךְ עָלֶֽיהָ בִּקְדֻשָּׁה וּבְטָהֳרָה:");

			if (jewishDateInfo.getJewishCalendar().getDayOfWeek() == 7) {
				addToSiddurHighlighted("וּרְצֵה וְהַחֲלִיצֵֽנוּ בְּיוֹם הַשַּׁבָּת הַזֶּה.");
			}

			if (jewishDateInfo.getJewishCalendar().isRoshChodesh()) {
				addToSiddurHighlighted("וְזָכְרֵֽנוּ לְטוֹבָה בְּיוֹם רֹאשׁ הַחֹֽדֶשׁ הַזֶּה.");
			} else if (jewishDateInfo.getJewishCalendar().isRoshHashana()) {
				addToSiddurHighlighted("וְזָכְרֵֽנוּ לְטוֹבָה בְּיוֹם הַזִּכָּרוֹן הַזֶּה.");
			} else if (jewishDateInfo.getJewishCalendar().isPesach()) {
				if (jewishDateInfo.getJewishCalendar().isYomTovAssurBemelacha()) {
					addToSiddurHighlighted("וְשַׂמְּחֵֽנוּ בְּיוֹם חַג הַמַּצּוֹת הַזֶּה, בְּיוֹם טוֹב מִקְרָא קֹדֶשׁ הַזֶּה.");
				} else {
					addToSiddurHighlighted("וְשַׂמְּחֵֽנוּ בְּיוֹם חַג הַמַּצּוֹת הַזֶּה, בְּיוֹם מִקְרָא קֹדֶשׁ הַזֶּה.");
				}
			} else if (jewishDateInfo.getJewishCalendar().isShavuos()) {
				addToSiddurHighlighted("וְשַׂמְּחֵֽנוּ בְּיוֹם חַג הַשָּׁבוּעוֹת הַזֶּה בְּיוֹם טוֹב מִקְרָא קֹֽדֶשׁ הַזֶּה.");
			} else if (jewishDateInfo.getJewishCalendar().isSuccos()) {
				if (jewishDateInfo.getJewishCalendar().isYomTovAssurBemelacha()) {
					addToSiddurHighlighted("וְשַׂמְּחֵֽנוּ בְּיוֹם חַג הַסֻּכּוֹת הַזֶּה, בְּיוֹם טוֹב מִקְרָא קֹֽדֶשׁ הַזֶּה.");
				} else {
					addToSiddurHighlighted("וְשַׂמְּחֵֽנוּ בְּיוֹם חַג הַסֻּכּוֹת הַזֶּה, בְּיוֹם מִקְרָא קֹֽדֶשׁ הַזֶּה.");
				}
			} else if (jewishDateInfo.getJewishCalendar().isShminiAtzeres()
					|| jewishDateInfo.getJewishCalendar().isSimchasTorah()) {// inIsrael does not matter
				addToSiddurHighlighted("וְשַׂמְּחֵֽנוּ בְּיוֹם שְׁמִינִי חַג עֲצֶֽרֶת הַזֶּה בְּיוֹם טוֹב מִקְרָא קֹֽדֶשׁ הַזֶּה.");
			}

			addToSiddur("כִּי אַתָּה טוֹב וּמֵטִיב לַכֹּל, וְנוֹדֶה לְךָ עַל הָאָֽרֶץ");
			if (mezonot) {
				addToSiddur(
						"וְעַל הַמִּחְיָה וְעַל הַכַּלְכָּלָה\nשל ארץ ישראל/if the produce was from Israel:\nוְעַל מִחְיָתָהּ וְעַל כַּלְכָּלָתָהּ");
			}
			if (wine) {
				addToSiddur("וְעַל פְּרִי הַגֶּֽפֶן\nשל ארץ ישראל/for wine made in Israel:\nוְעַל פְּרִי גַפְנָהּ");
			}
			if (fruits) {
				addToSiddur("וְעַל הַפֵּרוֹת\nשל ארץ ישראל/if the fruits are from Israel:\nוְעַל פֵּרוֹתֶֽיהָ");
			}

			addToSiddur("בָּרוּךְ אַתָּה יְהֹוָה, עַל הָאָֽרֶץ וְעַל");

			if (mezonot) {
				addToSiddur("הַמִּחְיָה:\nשל ארץ ישראל/if the produce was from Israel:\nמִחְיָתָהּ:");
			}
			if (wine) {
				addToSiddur("פְּרִי הַגֶּֽפֶן:\nשל ארץ ישראל/for wine made in Israel:\nפְּרִי גַפְנָהּ:");
			}
			if (fruits) {
				addToSiddur(":הַפֵּרוֹת:\nשל ארץ ישראל/if the fruits are from Israel:\nפֵּרוֹתֶֽיהָ");
			}

			if (other) {
				addToSiddur("בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, בּוֹרֵא נְפָשׁוֹת רַבּוֹת וְחֶסְרוֹנָן עַל כָּל־מַה־שֶּׁבָּרָֽאתָ לְהַחֲיוֹת בָּהֶם נֶֽפֶשׁ כָּל־חָי, בָּרוּךְ חַי הָעוֹלָמִים.");
			}
		}

		return siddur;
	}

	public ArrayList<HighlightString> getTefilatHaderechPrayer() {
		siddur = new ArrayList<>();

		addInfoToSiddur("היוצא לדרך, ",
			"ושוהה בנסיעתו מחוץ לעיר לפחות מהלך שיעור פרסה (72 דקות) אומר תפלת הדרך עם הזכרת שם השם, פחות מזה, בלי שם השם. ברכה זו מברך לאחר שיצא מהעיר. (Someone who travels outside the city for at least 72 minutes says this prayer with Hashem's name. It should be said without Hashem's name otherwise. It should ideally be said after you leave the city.) (ילקוט יוסף תפילה ב סימן קי)");

		addToSiddur(
			"יְהִי רָצוֹן מִלְּפָנֶֽיךָ יְהֹוָה אֱלֹהֵֽינוּ וֵאלֹהֵי אֲבוֹתֵֽינוּ, שֶׁתּוֹלִיכֵֽנוּ לְשָׁלוֹם, וְתַצְעִידֵֽנוּ לְשָׁלוֹם, וְתִסְמְכֵֽנוּ לְשָׁלוֹם,\n\n(אם חוזר בו ביום מוסיף (if returning on the same day): וְתַחֲזִירֵֽנוּ לְשָׁלוֹם),\n\nוְתַצִּילֵֽנוּ מִכַּף כָּל־אוֹיֵב וְאוֹרֵב בַּדֶּֽרֶךְ, וְתִשְׁלַח בְּרָכָה בְּמַעֲשֵׂה יָדֵֽינוּ, וְתִתְּנֵֽנוּ לְחֵן וּלְחֶֽסֶד וּלְרַחֲמִים בְּעֵינֶֽיךָ וּבְעֵינֵי כָל־רוֹאֵֽינוּ. בָּרוּךְ (אַתָּה יְהֹוָה) שׁוֹמֵֽעַ תְּפִלָּה:");

		addToSiddur("ויש מוסיפים פסוקים אלה לשמירה (Some add on these verses for protection) \n\n" +
			"וְיַעֲקֹ֖ב הָלַ֣ךְ לְדַרְכּ֑וֹ וַיִּפְגְּעוּ־ב֖וֹ מַלְאֲכֵ֥י אֱלֹהִֽים׃ וַיֹּ֤אמֶר יַעֲקֹב֙ כַּאֲשֶׁ֣ר רָאָ֔ם מַחֲנֵ֥ה אֱלֹהִ֖ים זֶ֑ה וַיִּקְרָ֛א שֵֽׁם־הַמָּק֥וֹם הַה֖וּא מַֽחֲנָֽיִם׃ \n\n" +
			"וַיִּסָּ֑עוּ וַיְהִ֣י ׀ חִתַּ֣ת אֱלֹהִ֗ים עַל־הֶֽעָרִים֙ אֲשֶׁר֙ סְבִיב֣וֹתֵיהֶ֔ם וְלֹ֣א רָֽדְפ֔וּ אַחֲרֵ֖י בְּנֵ֥י יַעֲקֹֽב׃ לִישׁוּעָתְךָ֖ קִוִּ֥יתִי יְהֹוָֽה׃ (ג' פעמים/three times) \n\n" +
			"יְבָרֶכְךָ֥ יְהֹוָ֖ה וְיִשְׁמְרֶֽךָ׃ יָאֵ֨ר יְהֹוָ֧ה ׀ פָּנָ֛יו אֵלֶ֖יךָ וִֽיחֻנֶּֽךָּ׃ יִשָּׂ֨א יְהֹוָ֤ה ׀ פָּנָיו֙ אֵלֶ֔יךָ וְיָשֵׂ֥ם לְךָ֖ שָׁלֽוֹם׃ (ג' פעמים/three times) \n\n" +
			"הִנֵּ֨ה אָנֹכִ֜י שֹׁלֵ֤חַ מַלְאָךְ֙ לְפָנֶ֔יךָ לִשְׁמָרְךָ֖ בַּדָּ֑רֶךְ וְלַהֲבִ֣יאֲךָ֔ אֶל־הַמָּק֖וֹם אֲשֶׁ֥ר הֲכִנֹֽתִי׃ (ג' פעמים/three times) \n\n" +
			"הַמַּלְאָךְ֩ הַגֹּאֵ֨ל אֹתִ֜י מִכׇּל־רָ֗ע יְבָרֵךְ֮ אֶת־הַנְּעָרִים֒ וְיִקָּרֵ֤א בָהֶם֙ שְׁמִ֔י וְשֵׁ֥ם אֲבֹתַ֖י אַבְרָהָ֣ם וְיִצְחָ֑ק וְיִדְגּ֥וּ לָרֹ֖ב בְּקֶ֥רֶב הָאָֽרֶץ׃ (ג' פעמים/three times)");

		return siddur;
	}

	public ArrayList<HighlightString> getBirchatHalevanaPrayers() {
		siddur = new ArrayList<>();

		addToSiddur(
			"לַמְנַצֵּ֗חַ מִזְמ֥וֹר לְדָוִֽד׃ הַשָּׁמַ֗יִם מְֽסַפְּרִ֥ים כְּבֽוֹד־אֵ֑ל וּֽמַעֲשֵׂ֥ה יָ֝דָ֗יו מַגִּ֥יד הָרָקִֽיעַ׃ י֣וֹם לְ֭יוֹם יַבִּ֣יעַֽ אֹ֑מֶר וְלַ֥יְלָה לְּ֝לַ֗יְלָה יְחַוֶּה־דָּֽעַת׃ אֵֽין־אֹ֭מֶר וְאֵ֣ין דְּבָרִ֑ים בְּ֝לִ֗י נִשְׁמָ֥ע קוֹלָֽם׃ בְּכׇל־הָאָ֨רֶץ ׀ יָ֘צָ֤א קַוָּ֗ם וּבִקְצֵ֣ה תֵ֭בֵל מִלֵּיהֶ֑ם לַ֝שֶּׁ֗מֶשׁ שָֽׂם־אֹ֥הֶל בָּהֶֽם׃ וְה֗וּא כְּ֭חָתָן יֹצֵ֣א מֵחֻפָּת֑וֹ יָשִׂ֥ישׂ כְּ֝גִבּ֗וֹר לָר֥וּץ אֹֽרַח׃ מִקְצֵ֤ה הַשָּׁמַ֨יִם ׀ מֽוֹצָא֗וֹ וּתְקוּפָת֥וֹ עַל־קְצוֹתָ֑ם וְאֵ֥ין נִ֝סְתָּ֗ר מֵחַמָּתֽוֹ׃ תּ֘וֹרַ֤ת יְהֹוָ֣ה תְּ֭מִימָה מְשִׁ֣יבַת נָ֑פֶשׁ עֵד֥וּת יְהֹוָ֥ה נֶ֝אֱמָנָ֗ה מַחְכִּ֥ימַת פֶּֽתִי׃ פִּקּ֘וּדֵ֤י יְהֹוָ֣ה יְ֭שָׁרִים מְשַׂמְּחֵי־לֵ֑ב מִצְוַ֥ת יְהֹוָ֥ה בָּ֝רָ֗ה מְאִירַ֥ת עֵינָֽיִם׃ יִרְאַ֤ת יְהֹוָ֨ה ׀ טְהוֹרָה֮ עוֹמֶ֢דֶת לָ֫עַ֥ד מִֽשְׁפְּטֵי־יְהֹוָ֥ה אֱמֶ֑ת צָֽדְק֥וּ יַחְדָּֽו׃ הַֽנֶּחֱמָדִ֗ים מִ֭זָּהָב וּמִפַּ֣ז רָ֑ב וּמְתוּקִ֥ים מִ֝דְּבַ֗שׁ וְנֹ֣פֶת צוּפִֽים׃ גַּֽם־עַ֭בְדְּךָ נִזְהָ֣ר בָּהֶ֑ם בְּ֝שׇׁמְרָ֗ם עֵ֣קֶב רָֽב׃ שְׁגִיא֥וֹת מִֽי־יָבִ֑ין מִֽנִּסְתָּר֥וֹת נַקֵּֽנִי׃ גַּ֤ם מִזֵּדִ֨ים ׀ חֲשֹׂ֬ךְ עַבְדֶּ֗ךָ אַֽל־יִמְשְׁלוּ־בִ֣י אָ֣ז אֵיתָ֑ם וְ֝נִקֵּ֗יתִי מִפֶּ֥שַֽׁע רָֽב׃ יִ֥הְיֽוּ לְרָצ֨וֹן ׀ אִמְרֵי־פִ֡י וְהֶגְי֣וֹן לִבִּ֣י לְפָנֶ֑יךָ יְ֝הֹוָ֗ה צוּרִ֥י וְגֹאֲלִֽי׃ \n\n" +
			"צוּרִי בָּעוֹלָם הַזֶּה וְגוֹאֲלִי לָעוֹלָם הַבָּא. וְכׇל־קַרְנֵ֣י רְשָׁעִ֣ים אֲגַדֵּ֑עַ תְּ֝רוֹמַ֗מְנָה קַֽרְנ֥וֹת צַדִּֽיק׃ \n\n" +
			"הַ֥לְלוּיָ֨הּ ׀ הַֽלְל֣וּ אֶת־יְ֭הֹוָה מִן־הַשָּׁמַ֑יִם הַֽ֝לְל֗וּהוּ בַּמְּרוֹמִֽים׃ הַֽלְל֥וּהוּ כׇל־מַלְאָכָ֑יו הַ֝לְל֗וּהוּ כׇּל־צְבָאָֽו׃ הַֽ֭לְלוּהוּ שֶׁ֣מֶשׁ וְיָרֵ֑חַ הַֽ֝לְל֗וּהוּ כׇּל־כּ֥וֹכְבֵי אֽוֹר׃ הַֽ֭לְלוּהוּ שְׁמֵ֣י הַשָּׁמָ֑יִם וְ֝הַמַּ֗יִם אֲשֶׁ֤ר ׀ מֵעַ֬ל הַשָּׁמָֽיִם׃ יְֽ֭הַלְלוּ אֶת־שֵׁ֣ם יְהֹוָ֑ה כִּ֤י ה֖וּא צִוָּ֣ה וְנִבְרָֽאוּ׃ וַיַּעֲמִידֵ֣ם לָעַ֣ד לְעוֹלָ֑ם חׇק־נָ֝תַ֗ן וְלֹ֣א יַעֲבֽוֹר׃ \n\n" +
			"אחר שיאמר \"כי אראה שמיך מעשה אצבעותיך\" יסתכל בלבנה וברך מיד, אבל כשיתחיל לברך לא יראה בה עוד כלל/After you say the next line, look at the moon for a brief moment, immediately say the beracha, and then don't look at it anymore.\n(חזון עובדיה חנוכה שכט) \n\n" +
			"כִּֽי־אֶרְאֶ֣ה שָׁ֭מֶיךָ מַעֲשֵׂ֣ה אֶצְבְּעֹתֶ֑יךָ יָרֵ֥חַ וְ֝כוֹכָבִ֗ים אֲשֶׁ֣ר כּוֹנָֽנְתָּה׃ יְהֹוָ֥ה אֲדֹנֵ֑ינוּ מָה־אַדִּ֥יר שִׁ֝מְךָ֗ בְּכׇל־הָאָֽרֶץ׃ \n\n" +
			"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר בְּמַאֲמָרוֹ בָּרָא שְׁחָקִים וּבְרוּחַ פִּיו כָּל צְבָאָם, חֹק וּזְמַן נָתַן לָהֶם שֶׁלֹּא יְשַׁנוּ אֶת תַּפְקִידָם, שָׂשִׂים וּשְׂמֵחִים לַעֲשׂוֹת רְצוֹן קוֹנֵיהֶם, פּוֹעֵל אֱמֶת שֶׁפְּעֻלָּתוֹ אֱמֶת, וְלַלְּבָנָה אָמַר שֶׁתִּתְחַדֵּשׁ, עֲטֶרֶת תִּפְאֶרֶת לַעֲמוּסֵי בָטֶן, שֶׁגַּם הֵם עֲתִידִים לְהִתְחַדֵּשׁ כְּמוֹתָהּ וּלְפָאֵר לְיוֹצְרָם עַל שֵׁם כְּבוֹד מַלְכוּתוֹ. בָּרוּךְ אַתָּה יְהֹוָה, מְחַדֵּשׁ חֳדָשִׁים: \n\n" +
			"סִימָן טוֹב תְּהִי לָנוּ וּלְכָל יִשְׂרָאֵל: \n" +
			"סִימָן טוֹב תְּהִי לָנוּ וּלְכָל יִשְׂרָאֵל: \n" +
			"סִימָן טוֹב תְּהִי לָנוּ וּלְכָל יִשְׂרָאֵל: \n\n" +
			"(יאמר מ\"בסימן טוב\" עד \"עליהם תפל\" שלש פעמים/Say the next paragraph 3 times) \n\n" +
			"בָּרוּךְ יוֹצְרֵיךְ, בָּרוּךְ עוֹשֵׂיךְ, בָּרוּךְ קוֹנֵיךְ, בָּרוּךְ בּוֹרְאֵיךְ, כְּשֵׁם שֶׁאֲנַחְנוּ מְרַקְּדִים (ידלג ג\"פ/jump 3 times (בא\"ח ש\"ב ויקרא הכ\"ה)) כְּנֶגְדִּיךְ, וְאֵין אֲנַחְנוּ יְכוֹלִים לִגַּע בִּיךְ, כָּךְ אִם יְרַקְּדוּ אֲחֵרִים כְּנֶגְדֵּנוּ לְהַזִּיקֵנוּ, לֹא יוּכְלוּ לִגַּע בָּנוּ, וְלֹא יִשְׁלְטוּ בָנוּ, וְלֹא יַעֲשׂוּ בָנוּ שׁוּם רֹשֶׁם כְּלַל וְעִיקָר, לֹא בְּגוּפֵנוּ וְלֹא בְּמָמוֹנֵנו וְלֹא בּכָל־אַשֶׁר לָנוּ.");
			// Based on Chazon Ovadia Chanuka 331

		addInfoToSiddur("(סגולה להוסיף בלחישה/It is a segulah to say here quietly)",
				"\n[וִיהִי רָצוֹן שֶׁלֹא יִהֽיֶה לָנוּ כּֽאֵֵבֵי שִׁנָּיִם]");

		addToSiddur(
			"תִּפֹּ֨ל עֲלֵיהֶ֤ם אֵימָ֙תָה֙ וָפַ֔חַד בִּגְדֹ֥ל זְרוֹעֲךָ֖ יִדְּמ֣וּ כָּאָ֑בֶן: כָּאָבֶן יִדְּמוּ, זְרוֹעֲךָ בִּגְדֹל, וָפַחַד אֵימָתָה עֲלֵיהֶם תִּפֹּל:\n" +
			"(עד כאן חוזר/repeat until here) \n\n" +
			"דָּוִד מֶלֶךְ יִשְׂרָאֵל חַי וְקַיָּם (שלש פעמים/three times). אָמֵן, אָמֵן, אָמֵן: נֶצַח, נֶצַח, נֶצַח: סֶלָה, סֶלָה, סֶלָה: וָעֶד, וָעֶד, וָעֶד: \n\n" +
			"לֵ֣ב טָ֭הוֹר בְּרָא־לִ֣י אֱלֹהִ֑ים וְר֥וּחַ נָ֝כ֗וֹן חַדֵּ֥שׁ בְּקִרְבִּֽי׃ (שבע פעמים/seven times) \n\n" +
			"שִׁ֗יר לַֽמַּ֫עֲל֥וֹת אֶשָּׂ֣א עֵ֭ינַי אֶל־הֶהָרִ֑ים מֵ֝אַ֗יִן יָבֹ֥א עֶזְרִֽי׃ עֶ֭זְרִי מֵעִ֣ם יְהֹוָ֑ה עֹ֝שֵׂ֗ה שָׁמַ֥יִם וָאָֽרֶץ׃ אַל־יִתֵּ֣ן לַמּ֣וֹט רַגְלֶ֑ךָ אַל־יָ֝נ֗וּם שֹׁמְרֶֽךָ׃ הִנֵּ֣ה לֹֽא־יָ֭נוּם וְלֹ֣א יִישָׁ֑ן שׁ֝וֹמֵ֗ר יִשְׂרָאֵֽל׃ יְהֹוָ֥ה שֹׁמְרֶ֑ךָ יְהֹוָ֥ה צִ֝לְּךָ֗ עַל־יַ֥ד יְמִינֶֽךָ׃ יוֹמָ֗ם הַשֶּׁ֥מֶשׁ לֹֽא־יַכֶּ֗כָּה וְיָרֵ֥חַ בַּלָּֽיְלָה׃ יְֽהֹוָ֗ה יִשְׁמׇרְךָ֥ מִכָּל־רָ֑ע יִ֝שְׁמֹ֗ר אֶת־נַפְשֶֽׁךָ׃ יְֽהֹוָ֗ה יִשְׁמׇר־צֵאתְךָ֥ וּבוֹאֶ֑ךָ מֵ֝עַתָּ֗ה וְעַד־עוֹלָֽם׃ \n\n" +
			"הַ֥לְלוּיָ֨הּ ׀ הַֽלְלוּ־אֵ֥ל בְּקָדְשׁ֑וֹ הַֽ֝לְל֗וּהוּ בִּרְקִ֥יעַ עֻזּֽוֹ׃ הַלְל֥וּהוּ בִגְבוּרֹתָ֑יו הַ֝לְל֗וּהוּ כְּרֹ֣ב גֻּדְלֽוֹ׃ הַ֭לְלוּהוּ בְּתֵ֣קַע שׁוֹפָ֑ר הַ֝לְל֗וּהוּ בְּנֵ֣בֶל וְכִנּֽוֹר׃ הַ֭לְלוּהוּ בְּתֹ֣ף וּמָח֑וֹל הַֽ֝לְל֗וּהוּ בְּמִנִּ֥ים וְעֻגָֽב׃ הַלְל֥וּהוּ בְצִלְצְלֵי־שָׁ֑מַע הַֽ֝לְל֗וּהוּ בְּֽצִלְצְלֵ֥י תְרוּעָֽה׃ כֹּ֣ל הַ֭נְּשָׁמָה תְּהַלֵּ֥ל יָ֗הּ הַֽלְלוּיָֽהּ׃ \n\n" +
			"תָּנָא דְבֵי רִבִּי יִשְׁמָעֵאל אִלְמָלֵא זָכוּ בְנֵי יִשְׂרָאֵל אֶלָּא לְהַקְבִּיל פְּנֵי אֲבִיהֶם שֶׁבַּשָּׁמַיִם פַּעַם אַחַת בַּחֹדֶשׁ דַּיָּם. אָמַר אַבַּיֵּי הֵלְכָךְ נִימְרִינְהוּ מֵעֹמֶד:");
		addKaddishAlYisrael();
		addToSiddur(
			"(ואחר הקדיש יש אומרים/After Kaddish, some say) \n\n" +
			"וְהָיָ֤ה אוֹר־הַלְּבָנָה֙ כְּא֣וֹר הַחַמָּ֔ה וְא֤וֹר הַֽחַמָּה֙ יִֽהְיֶ֣ה שִׁבְעָתַ֔יִם כְּא֖וֹר שִׁבְעַ֣ת הַיָּמִ֑ים בְּי֗וֹם חֲבֹ֤שׁ יְהֹוָה֙ אֶת־שֶׁ֣בֶר עַמּ֔וֹ וּמַ֥חַץ מַכָּת֖וֹ יִרְפָּֽא׃ וַתַּעְדִּ֞י זָהָ֣ב וָכֶ֗סֶף וּמַלְבּוּשֵׁךְ֙ שֵׁ֤שׁ וָמֶ֙שִׁי֙ וְרִקְמָ֔ה סֹ֧לֶת וּדְבַ֛שׁ וָשֶׁ֖מֶן אָכָ֑לְתְּ וַתִּ֙יפִי֙ בִּמְאֹ֣ד מְאֹ֔ד וַֽתִּצְלְחִ֖י לִמְלוּכָֽה׃ \n\n" +
			"ואומרים שלש פעמים/say three times:\n שָׁלוֹם עֲלֵיכֶם!");

		return siddur;
	}

	/**
	 * NOTE: (If isForNight is true) Night prayer. The Date should be set to the
	 * next day.
	 */
	public ArrayList<HighlightString> getTikkunChatzotPrayers(boolean isForNight) {
		siddur = new ArrayList<>();

		addCategoryToSiddur(isForNight ? "תיקון חצות (לילה)" : "תיקון חצות (יום)");

		String vidduy = "נוהגים לומר וידוי קודם אמירת תיקון חצות, אמנם אם כבר אמר וידוי בתוך ק\"ש שעל המטה, או בתוך הסליחות [בחודש אלול], או בתפלת מנחה [בימי בין-המצרים], אין לו לחזור ולומר וידוי שוב קודם תיקון חצות, כיון שאין ראוי לומר וידוי פעמיים בסמוך./It is custom to say the viduy prayer before Tikkun Chatzot, however, if you already said the viduy prayer beforehand, for example you just said Kriat Shema SheAl Hamita, or Selichot (in Elul), or you just finished mincha (during the three weeks). You should not say viduy again because it is not proper to say viduy twice close to each other (בא\"ח ש\"ר וישלח יג, ילקו\"י א, נד)\n\n" +
			"אָנָּא יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ. תָּבֹא לְפָנֶיךָ תְּפִלָּתֵנוּ. וְאַל תִּתְעַלַּם מַלְכֵּנוּ מִתְּחִנָּתֵנוּ. שֶׁאֵין אֲנַחְנוּ עַזֵּי פָנִים וּקְשֵׁי עֹרֶף לוֹמַר לְפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ צַדִּיקִים אֲנַחְנוּ וְלא חָטָאנוּ. אֲבָל חָטָאנוּ. עָוִינוּ. פָּשַׁעְנוּ. אֲנַחְנוּ וַאֲבוֹתֵינוּ וְאַנְשֵׁי בֵיתֵנוּ: אָשַׁמְנוּ. בָּגַדְנוּ. גָּזַלְנוּ. דִּבַּרְנוּ דֹפִי וְלָשׁון הָרָע. הֶעֱוִינוּ. וְהִרְשַׁעְנוּ. זַדְנוּ. חָמַסְנוּ. טָפַלְנוּ שֶׁקֶר וּמִרְמָה. יָעַצְנוּ עֵצוֹת רָעוֹת. כִּזַּבְנוּ. כָּעַסְנוּ. לַצְנוּ. מָרַדְנוּ. מָרִינוּ דְבָרֶיךָ. נִאַצְנוּ. נִאַפְנוּ. סָרַרְנוּ. עָוִינוּ. פָּשַׁעְנוּ. פָּגַמְנוּ. צָרַרְנוּ. צִעַרְנוּ אָב וָאֵם. קִשִּׁינוּ עֹרֶף. רָשַׁעְנוּ. שִׁחַתְנוּ. תִּעַבְנוּ. תָּעִינוּ וְתִעֲתַעְנוּ. וְסַרְנוּ מִמִּצְוֹתֶיךָ וּמִמִּשְׁפָּטֶיךָ הַטּוֹבִים וְלֹא שָׁוָה לָנוּ. וְאַתָּה צַדִּיק עַל כָּל הַבָּא עָלֵינוּ. כִּי אֱמֶת עָשִׂיתָ. וַאֲנַחְנוּ הִרְשָׁעְנוּ: \n\n" +
			"מַה־נֹּאמַר לְפָנֶיךָ יוֹשֵׁב מָרוֹם, וּמַה־נְסַפֵּר לְפָנֶיךָ שׁוֹכֵן שְׁחָקִים, הֲלֹא כָּל־הַנִּסְתָּרוֹת וְהַנִּגְלוֹת אַתָּה יוֹדֵעַ, אַתָּה יוֹדֵעַ רָזֵי עוֹלָם, וְתַעֲלוּמוֹת סִתְרֵי כָּל־חָי, אַתָּה חוֹפֵשׂ כָּל־חַדְרֵי בָטֶן, רוֹאֶה כְלָיוֹת וְלֵב, אֵין דָּבָר נֶעְלָם מִמְּךָּ, וְאֵין נִסְתָּר מִנֶּגֶד עֵינֶיךָ: יְהִי רָצוֹן מִלְּפָנֶיךָ, יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, שֶתִמְחוֹל לָנוּ אֶת־כָּל־חַטְּאוֹתֵינוּ, וּתְכַפֵּר לָנוּ אֶת־כָּל־עֲוֹנוֹתֵינוּ, וְתִמְחוֹל וְתִסְלַח לְכָל־פְּשָׁעֵינוּ:";

		String ending = "אחר אמירת תיקון חצות, יאמר נוסח זה/say this line after tikkun chatzot: (הלכה ברורה א, לא)\n\nאֲנִי מַאֲמִין בֶּאֱמוּנָה שְׁלֵמָה בּֽנֶחָמַת צִיוֹן. אֱלֹהֵינוּ בְּרַחֲמָיו יְנַחֲמֵינוּּ, וִיחַדֵשׁ עָלֵינוּ מַלְכוּתוֹ מְהֵרָה.";

		if (!isForNight) {
			if (isTachanunSaidInTheMorning) {
				addToSiddur(vidduy);
				addCategoryToSiddur("תיקון רחל");
				addTikkunRachel(true);
				addToSiddur(ending);
			} else {// I do not want the user to get here, I will just leave this here just in case
				addToSiddur("Tikkun Chatzot is not said today/תיקון חצות אינו נאמר היום");
			}
			return siddur;
		}

		if (jewishDateInfo.getJewishCalendar().isTishaBav()) {
			// Viduy is not said
			addCategoryToSiddur("תיקון רחל");
			addTikkunRachel(false);
			addToSiddur(ending);
			return siddur;// Do not add Tikkun Leah
		} else if (!jewishDateInfo.isOnlyTikkunLeiaSaid(true)) {
			if (isTachanunSaidInTheMorning) {
				addToSiddur(vidduy);
			}
			addCategoryToSiddur("תיקון רחל");
			addTikkunRachel(false);
		}
		if (jewishDateInfo.isAfterTheMoladAndBeforeRoshChodesh()) {
			addToSiddurHighlighted(
				"כעת זהו זמן שאחרי המולד ולפני ראש חודש. תיקון רחל אינו נאמר בשעה זו./It is currently after the Molad and before Rosh Chodesh. Tikkun Rachel is not said at this time"
				+ "\n(חזון עובדיה ימים נוראים עמוד 46)");
		}
		addCategoryToSiddur("תיקון לאה");
		addTikkunLeah(isTachanunSaidInTheMorning);
		addToSiddur(ending);

		addPatachEliyahu();

		return siddur;
	}

	private void addTikkunLeah(boolean isTachanunSaid) {
		addToSiddur(
			"לַמְנַצֵּ֗חַ מַשְׂכִּ֥יל לִבְנֵי־קֹֽרַח׃ כְּאַיָּ֗ל תַּעֲרֹ֥ג עַל־אֲפִֽיקֵי־מָ֑יִם כֵּ֤ן נַפְשִׁ֨י תַעֲרֹ֖ג אֵלֶ֣יךָ אֱלֹהִֽים׃ צָמְאָ֬ה נַפְשִׁ֨י ׀ לֵאלֹהִים֮ לְאֵ֢ל חָ֥י מָתַ֥י אָב֑וֹא וְ֝אֵרָאֶ֗ה פְּנֵ֣י אֱלֹהִֽים׃ הָיְתָה־לִּ֬י דִמְעָתִ֣י לֶ֭חֶם יוֹמָ֣ם וָלָ֑יְלָה בֶּאֱמֹ֥ר אֵלַ֥י כׇּל־הַ֝יּ֗וֹם אַיֵּ֥ה אֱלֹהֶֽיךָ׃ אֵ֤לֶּה אֶזְכְּרָ֨ה ׀ וְאֶשְׁפְּכָ֬ה עָלַ֨י ׀ נַפְשִׁ֗י כִּ֤י אֶעֱבֹ֨ר ׀ בַּסָּךְ֮ אֶדַּדֵּ֗ם עַד־בֵּ֥ית אֱלֹ֫הִ֥ים בְּקוֹל־רִנָּ֥ה וְתוֹדָ֗ה הָמ֥וֹן חוֹגֵֽג׃ מַה־תִּשְׁתּ֬וֹחֲחִ֨י ׀ נַפְשִׁי֮ וַתֶּהֱמִ֢י עָ֫לָ֥י הוֹחִ֣לִי לֵ֭אלֹהִים כִּי־ע֥וֹד אוֹדֶ֗נּוּ יְשׁוּע֥וֹת פָּנָֽיו׃ אֱלֹהַ֗י עָלַי֮ נַפְשִׁ֢י תִשְׁתּ֫וֹחָ֥ח עַל־כֵּ֗ן אֶ֭זְכׇּרְךָ מֵאֶ֣רֶץ יַרְדֵּ֑ן וְ֝חֶרְמוֹנִ֗ים מֵהַ֥ר מִצְעָֽר׃ תְּהוֹם־אֶל־תְּה֣וֹם ק֭וֹרֵא לְק֣וֹל צִנּוֹרֶ֑יךָ כׇּֽל־מִשְׁבָּרֶ֥יךָ וְ֝גַלֶּ֗יךָ עָלַ֥י עָבָֽרוּ׃ יוֹמָ֤ם ׀ יְצַוֶּ֬ה יְהֹוָ֨ה ׀ חַסְדּ֗וֹ וּ֭בַלַּיְלָה שִׁירֹ֣ה עִמִּ֑י תְּ֝פִלָּ֗ה לְאֵ֣ל חַיָּֽי׃ אוֹמְרָ֤ה ׀ לְאֵ֥ל סַלְעִי֮ לָמָ֢ה שְׁכַ֫חְתָּ֥נִי לָֽמָּה־קֹדֵ֥ר אֵלֵ֗ךְ בְּלַ֣חַץ אוֹיֵֽב׃ בְּרֶ֤צַח ׀ בְּֽעַצְמוֹתַ֗י חֵרְפ֥וּנִי צוֹרְרָ֑י בְּאׇמְרָ֥ם אֵלַ֥י כׇּל־הַ֝יּ֗וֹם אַיֵּ֥ה אֱלֹהֶֽיךָ׃ מַה־תִּשְׁתּ֬וֹחֲחִ֨י ׀ נַפְשִׁי֮ וּֽמַה־תֶּהֱמִ֢י עָ֫לָ֥י הוֹחִ֣ילִי לֵ֭אלֹהִים כִּי־ע֣וֹד אוֹדֶ֑נּוּ יְשׁוּעֹ֥ת פָּ֝נַ֗י וֵאלֹהָֽי׃ \n\n" +
			"שׇׁפְטֵ֤נִי אֱלֹהִ֨ים ׀ וְרִ֘יבָ֤ה רִיבִ֗י מִגּ֥וֹי לֹֽא־חָסִ֑יד מֵ֤אִישׁ מִרְמָ֖ה וְעַוְלָ֣ה תְפַלְּטֵֽנִי׃ כִּֽי־אַתָּ֤ה ׀ אֱלֹהֵ֣י מָֽעוּזִּי֮ לָמָ֢ה זְנַ֫חְתָּ֥נִי לָֽמָּה־קֹדֵ֥ר אֶתְהַלֵּ֗ךְ בְּלַ֣חַץ אוֹיֵֽב׃ שְׁלַח־אוֹרְךָ֣ וַ֭אֲמִתְּךָ הֵ֣מָּה יַנְח֑וּנִי יְבִיא֥וּנִי אֶל־הַֽר־קׇ֝דְשְׁךָ֗ וְאֶל־מִשְׁכְּנוֹתֶֽיךָ׃ וְאָב֤וֹאָה ׀ אֶל־מִזְבַּ֬ח אֱלֹהִ֗ים אֶל־אֵל֮ שִׂמְחַ֢ת גִּ֫ילִ֥י וְאוֹדְךָ֥ בְכִנּ֗וֹר אֱלֹהִ֥ים אֱלֹהָֽי׃ מַה־תִּשְׁתּ֬וֹחֲחִ֨י ׀ נַפְשִׁי֮ וּֽמַה־תֶּהֱמִ֢י עָ֫לָ֥י הוֹחִ֣ילִי לֵ֭אלֹהִים כִּי־ע֣וֹד אוֹדֶ֑נּוּ יְשׁוּעֹ֥ת פָּ֝נַ֗י וֵאלֹהָֽי׃");
		if (isTachanunSaid) {
			addToSiddurHighlighted(
				"לַמְנַצֵּ֗חַ מִזְמ֥וֹר לְדָוִֽד׃ יַֽעַנְךָ֣ יְ֭הֹוָה בְּי֣וֹם צָרָ֑ה יְ֝שַׂגֶּבְךָ֗ שֵׁ֤ם ׀ אֱלֹהֵ֬י יַעֲקֹֽב׃ יִשְׁלַֽח־עֶזְרְךָ֥ מִקֹּ֑דֶשׁ וּ֝מִצִּיּ֗וֹן יִסְעָדֶֽךָּ׃ יִזְכֹּ֥ר כׇּל־מִנְחֹתֶ֑ךָ וְעוֹלָתְךָ֖ יְדַשְּׁנֶ֣ה סֶֽלָה׃ יִֽתֶּן־לְךָ֥ כִלְבָבֶ֑ךָ וְֽכׇל־עֲצָתְךָ֥ יְמַלֵּֽא׃ נְרַנְּנָ֤ה ׀ בִּ֘ישׁ֤וּעָתֶ֗ךָ וּבְשֵֽׁם־אֱלֹהֵ֥ינוּ נִדְגֹּ֑ל יְמַלֵּ֥א יְ֝הֹוָ֗ה כׇּל־מִשְׁאֲלוֹתֶֽיךָ׃ עַתָּ֤ה יָדַ֗עְתִּי כִּ֤י הוֹשִׁ֥יעַ ׀ יְהֹוָ֗ה מְשִׁ֫יח֥וֹ יַ֭עֲנֵהוּ מִשְּׁמֵ֣י קׇדְשׁ֑וֹ בִּ֝גְבֻר֗וֹת יֵ֣שַׁע יְמִינֽוֹ׃ אֵ֣לֶּה בָ֭רֶכֶב וְאֵ֣לֶּה בַסּוּסִ֑ים וַאֲנַ֓חְנוּ ׀ בְּשֵׁם־יְהֹוָ֖ה אֱלֹהֵ֣ינוּ נַזְכִּֽיר׃ הֵ֭מָּה כָּרְע֣וּ וְנָפָ֑לוּ וַאֲנַ֥חְנוּ קַּ֝֗מְנוּ וַנִּתְעוֹדָֽד׃ יְהֹוָ֥ה הוֹשִׁ֑יעָה הַ֝מֶּ֗לֶךְ יַעֲנֵ֥נוּ בְיוֹם־קׇרְאֵֽנוּ׃");
		}
		addToSiddur(
			"לְדָוִ֗ד מִ֫זְמ֥וֹר לַֽ֭יהֹוָה הָאָ֣רֶץ וּמְלוֹאָ֑הּ תֵּ֝בֵ֗ל וְיֹ֣שְׁבֵי בָֽהּ׃ כִּי־ה֭וּא עַל־יַמִּ֣ים יְסָדָ֑הּ וְעַל־נְ֝הָר֗וֹת יְכוֹנְנֶֽהָ׃ מִֽי־יַעֲלֶ֥ה בְהַר־יְהֹוָ֑ה וּמִי־יָ֝קוּם בִּמְק֥וֹם קׇדְשֽׁוֹ׃ נְקִ֥י כַפַּ֗יִם וּֽבַר־לֵ֫בָ֥ב אֲשֶׁ֤ר ׀ לֹא־נָשָׂ֣א לַשָּׁ֣וְא נַפְשִׁ֑י וְלֹ֖א נִשְׁבַּ֣ע לְמִרְמָֽה׃ יִשָּׂ֣א בְ֭רָכָה מֵאֵ֣ת יְהֹוָ֑ה וּ֝צְדָקָ֗ה מֵאֱלֹהֵ֥י יִשְׁעֽוֹ׃ זֶ֭ה דּ֣וֹר דֹּרְשָׁ֑ו מְבַקְשֵׁ֨י פָנֶ֖יךָ יַעֲקֹ֣ב סֶֽלָה׃ שְׂא֤וּ שְׁעָרִ֨ים ׀ רָֽאשֵׁיכֶ֗ם וְֽ֭הִנָּשְׂאוּ פִּתְחֵ֣י עוֹלָ֑ם וְ֝יָב֗וֹא מֶ֣לֶךְ הַכָּבֽוֹד׃ מִ֥י זֶה֮ מֶ֤לֶךְ הַכָּ֫ב֥וֹד יְ֭הֹוָה עִזּ֣וּז וְגִבּ֑וֹר יְ֝הֹוָ֗ה גִּבּ֥וֹר מִלְחָמָֽה׃ שְׂא֤וּ שְׁעָרִ֨ים ׀ רָֽאשֵׁיכֶ֗ם וּ֭שְׂאוּ פִּתְחֵ֣י עוֹלָ֑ם וְ֝יָבֹ֗א מֶ֣לֶךְ הַכָּבֽוֹד׃ מִ֤י ה֣וּא זֶה֮ מֶ֤לֶךְ הַכָּ֫ב֥וֹד יְהֹוָ֥ה צְבָא֑וֹת ה֤וּא מֶ֖לֶךְ הַכָּב֣וֹד סֶֽלָה׃ \n\n" +
			menorah);
		addToSiddur(
			"הַ֥לְלוּיָ֨הּ ׀ אוֹדֶ֣ה יְ֭הֹוָה בְּכׇל־לֵבָ֑ב בְּס֖וֹד יְשָׁרִ֣ים וְעֵדָֽה׃ גְּ֭דֹלִים מַעֲשֵׂ֣י יְהֹוָ֑ה דְּ֝רוּשִׁ֗ים לְכׇל־חֶפְצֵיהֶֽם׃ הוֹד־וְהָדָ֥ר פׇּעֳל֑וֹ וְ֝צִדְקָת֗וֹ עֹמֶ֥דֶת לָעַֽד׃ זֵ֣כֶר עָ֭שָׂה לְנִפְלְאוֹתָ֑יו חַנּ֖וּן וְרַח֣וּם יְהֹוָֽה׃ טֶ֭רֶף נָתַ֣ן לִירֵאָ֑יו יִזְכֹּ֖ר לְעוֹלָ֣ם בְּרִיתֽוֹ׃ כֹּ֣חַ מַ֭עֲשָׂיו הִגִּ֣יד לְעַמּ֑וֹ לָתֵ֥ת לָ֝הֶ֗ם נַחֲלַ֥ת גּוֹיִֽם׃ מַעֲשֵׂ֣י יָ֭דָיו אֱמֶ֣ת וּמִשְׁפָּ֑ט נֶ֝אֱמָנִ֗ים כׇּל־פִּקּוּדָֽיו׃ סְמוּכִ֣ים לָעַ֣ד לְעוֹלָ֑ם עֲ֝שׂוּיִ֗ם בֶּאֱמֶ֥ת וְיָשָֽׁר׃ פְּד֤וּת ׀ שָׁ֘לַ֤ח לְעַמּ֗וֹ צִוָּֽה־לְעוֹלָ֥ם בְּרִית֑וֹ קָד֖וֹשׁ וְנוֹרָ֣א שְׁמֽוֹ׃ רֵ֘אשִׁ֤ית חׇכְמָ֨ה ׀ יִרְאַ֬ת יְהֹוָ֗ה שֵׂ֣כֶל ט֭וֹב לְכׇל־עֹֽשֵׂיהֶ֑ם תְּ֝הִלָּת֗וֹ עֹמֶ֥דֶת לָעַֽד׃ \n\n" +
			"לַמְנַצֵּ֗חַ מִזְמ֥וֹר לְדָוִֽד׃ בְּֽבוֹא־אֵ֭לָיו נָתָ֣ן הַנָּבִ֑יא כַּאֲשֶׁר־בָּ֗֝א אֶל־בַּת־שָֽׁבַע׃ חׇנֵּ֣נִי אֱלֹהִ֣ים כְּחַסְדֶּ֑ךָ כְּרֹ֥ב רַ֝חֲמֶ֗יךָ מְחֵ֣ה פְשָׁעָֽי׃ הֶ֭רֶב כַּבְּסֵ֣נִי מֵעֲוֺנִ֑י וּֽמֵחַטָּאתִ֥י טַהֲרֵֽנִי׃ כִּֽי־פְ֭שָׁעַי אֲנִ֣י אֵדָ֑ע וְחַטָּאתִ֖י נֶגְדִּ֣י תָמִֽיד׃ לְךָ֤ לְבַדְּךָ֨ ׀ חָטָאתִי֮ וְהָרַ֥ע בְּעֵינֶ֗יךָ עָ֫שִׂ֥יתִי לְ֭מַעַן תִּצְדַּ֥ק בְּדׇבְרֶ֗ךָ תִּזְכֶּ֥ה בְשׇׁפְטֶֽךָ׃ הֵן־בְּעָו֥וֹן חוֹלָ֑לְתִּי וּ֝בְחֵ֗טְא יֶחֱמַ֥תְנִי אִמִּֽי׃ הֵן־אֱ֭מֶת חָפַ֣צְתָּ בַטֻּח֑וֹת וּ֝בְסָתֻ֗ם חׇכְמָ֥ה תוֹדִיעֵֽנִי׃ תְּחַטְּאֵ֣נִי בְאֵז֣וֹב וְאֶטְהָ֑ר תְּ֝כַבְּסֵ֗נִי וּמִשֶּׁ֥לֶג אַלְבִּֽין׃ תַּ֭שְׁמִיעֵנִי שָׂשׂ֣וֹן וְשִׂמְחָ֑ה תָּ֝גֵ֗לְנָה עֲצָמ֥וֹת דִּכִּֽיתָ׃ הַסְתֵּ֣ר פָּ֭נֶיךָ מֵחֲטָאָ֑י וְֽכׇל־עֲוֺ֖נֹתַ֣י מְחֵֽה׃ לֵ֣ב טָ֭הוֹר בְּרָא־לִ֣י אֱלֹהִ֑ים וְר֥וּחַ נָ֝כ֗וֹן חַדֵּ֥שׁ בְּקִרְבִּֽי׃ אַל־תַּשְׁלִיכֵ֥נִי מִלְּפָנֶ֑יךָ וְר֥וּחַ קׇ֝דְשְׁךָ֗ אַל־תִּקַּ֥ח מִמֶּֽנִּי׃ הָשִׁ֣יבָה לִּ֭י שְׂשׂ֣וֹן יִשְׁעֶ֑ךָ וְר֖וּחַ נְדִיבָ֣ה תִסְמְכֵֽנִי׃ אֲלַמְּדָ֣ה פֹשְׁעִ֣ים דְּרָכֶ֑יךָ וְ֝חַטָּאִ֗ים אֵלֶ֥יךָ יָשֽׁוּבוּ׃ הַצִּ֘ילֵ֤נִי מִדָּמִ֨ים ׀ אֱֽלֹהִ֗ים אֱלֹהֵ֥י תְּשׁוּעָתִ֑י תְּרַנֵּ֥ן לְ֝שׁוֹנִ֗י צִדְקָתֶֽךָ׃ אֲ֭דֹנָי שְׂפָתַ֣י תִּפְתָּ֑ח וּ֝פִ֗י יַגִּ֥יד תְּהִלָּתֶֽךָ׃ כִּ֤י ׀ לֹא־תַחְפֹּ֣ץ זֶ֣בַח וְאֶתֵּ֑נָה ע֝וֹלָ֗ה לֹ֣א תִרְצֶֽה׃ זִ֥בְחֵ֣י אֱלֹהִים֮ ר֤וּחַ נִשְׁבָּ֫רָ֥ה לֵב־נִשְׁבָּ֥ר וְנִדְכֶּ֑ה אֱ֝לֹהִ֗ים לֹ֣א תִבְזֶֽה׃ הֵיטִ֣יבָה בִ֭רְצוֹנְךָ אֶת־צִיּ֑וֹן תִּ֝בְנֶ֗ה חוֹמ֥וֹת יְרוּשָׁלָֽ‍ִם׃ אָ֤ז תַּחְפֹּ֣ץ זִבְחֵי־צֶ֭דֶק עוֹלָ֣ה וְכָלִ֑יל אָ֤ז יַעֲל֖וּ עַל־מִזְבַּחֲךָ֣ פָרִֽים׃");
		if (isTachanunSaid) {
			addToSiddurHighlighted("עַד אָנָה בִּכְיָה בְּצִיּוֹן וּמִסְפֵּד בִּירוּשָׁלָיִם:");
		}
		addToSiddur("תָּקוּם תְּרַחֵם צִיּוֹן, תִּבְנֶה חוֹמוֹת יְרוּשָׁלָיִם:");
		addToSiddur(
			"מנהג לומר אחר סיום תיקון לאה מלך רחמן וכו' ומזמור בשוב וכו' כדי לפסוק בנחמה/The minhag is to finish off Tikkun Leah with these verses of consolation (בא\"ח וישלח הי\"ב) \n\n" +
			"אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, מֶלֶךְ רַחֲמָן רַחֵם עָלֵינוּ, טוֹב וּמֵטִיב הִדָּרֶשׁ לָנוּ, שׁוּבָה עָלֵינוּ בַּהֲמוֹן רַחֲמֶיךָ, בִּגְלַל אָבוֹת שֶׁעָשׂוּ רְצוֹנֶךָ, בְּנֵה בֵיתְךָ כְּבַתְּחִלָּה, כּוֹנֵן בֵּית מִקְדָּשְׁךָ עַל מְכוֹנוֹ, הַרְאֵנוּ בְּבִנְיָנוֹ, שַׂמְּחֵנוּ בְּתִקּוּנוֹ, וְהָשֵׁב שְׁכִינָתְךָ לְתוֹכוֹ, וְהָשֵׁב כֹּהֲנִים לַעֲבוֹדָתָם, וּלְוִיִּים לְדוּכָנָם, לְשִׁירָם וּלְזִמְרָם, וְהָשֵׁב יִשְׂרָאֵל לִנְוֵיהֶם. וְשָׁם נַעֲלֶה וְנֵרָאֶה וְנִשְׁתַּחֲוֶה לְפָנֶיךָ: יְהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבֹתֵינוּ, שֶׁתַּעֲלֵנוּ בְּשִׂמְחָה לְאַרְצֵנוּ, וְתִטָּעֵנוּ בִּגְבוּלֵנוּ, וְשָׁם נַעֲשֶׂה לְפָנֶיךָ אֶת קָרְבְּנוֹת חֹבֹתֵינוּ, תְּמִידִים כְּסִדְרָם וּמוּסָפִים כְּהִלְכָתָם: \n\n" +
			"שִׁ֗יר הַֽמַּ֫עֲל֥וֹת בְּשׁ֣וּב יְ֭הֹוָה אֶת־שִׁיבַ֣ת צִיּ֑וֹן הָ֝יִ֗ינוּ כְּחֹלְמִֽים׃ אָ֤ז יִמָּלֵ֪א שְׂח֡וֹק פִּינוּ֮ וּלְשׁוֹנֵ֢נוּ רִ֫נָּ֥ה אָ֭ז יֹאמְר֣וּ בַגּוֹיִ֑ם הִגְדִּ֥יל יְ֝הֹוָ֗ה לַעֲשׂ֥וֹת עִם־אֵֽלֶּה׃ הִגְדִּ֣יל יְ֭הֹוָה לַעֲשׂ֥וֹת עִמָּ֗נוּ הָיִ֥ינוּ שְׂמֵחִֽים׃ שׁוּבָ֣ה יְ֭הֹוָה אֶת־שְׁבִיתֵ֑נוּ כַּאֲפִיקִ֥ים בַּנֶּֽגֶב׃ הַזֹּרְעִ֥ים בְּדִמְעָ֗ה בְּרִנָּ֥ה יִקְצֹֽרוּ׃ הָ֘ל֤וֹךְ יֵלֵ֨ךְ ׀ וּבָכֹה֮ נֹשֵׂ֢א מֶשֶׁךְ־הַ֫זָּ֥רַע בֹּא־יָבֹ֥א בְרִנָּ֑ה נֹ֝שֵׂ֗א אֲלֻמֹּתָֽיו׃");
	}

	private void addTikkunRachel(boolean isForDay) {
		addToSiddur(
			"עַ֥ל נַהֲר֨וֹת ׀ בָּבֶ֗ל שָׁ֣ם יָ֭שַׁבְנוּ גַּם־בָּכִ֑ינוּ בְּ֝זׇכְרֵ֗נוּ אֶת־צִיּֽוֹן׃ עַֽל־עֲרָבִ֥ים בְּתוֹכָ֑הּ תָּ֝לִ֗ינוּ כִּנֹּרוֹתֵֽינוּ׃ כִּ֤י שָׁ֨ם שְֽׁאֵל֢וּנוּ שׁוֹבֵ֡ינוּ דִּבְרֵי־שִׁ֭יר וְתוֹלָלֵ֣ינוּ שִׂמְחָ֑ה שִׁ֥ירוּ לָ֗֝נוּ מִשִּׁ֥יר צִיּֽוֹן׃ אֵ֗יךְ נָשִׁ֥יר אֶת־שִׁיר־יְהֹוָ֑ה עַ֗֝ל אַדְמַ֥ת נֵכָֽר׃ אִֽם־אֶשְׁכָּחֵ֥ךְ יְֽרוּשָׁלָ֗‍ִם תִּשְׁכַּ֥ח יְמִינִֽי׃ תִּדְבַּֽק־לְשׁוֹנִ֨י ׀ לְחִכִּי֮ אִם־לֹ֢א אֶ֫זְכְּרֵ֥כִי אִם־לֹ֣א אַ֭עֲלֶה אֶת־יְרוּשָׁלַ֑‍ִם עַ֗֝ל רֹ֣אשׁ שִׂמְחָתִֽי׃ זְכֹ֤ר יְהֹוָ֨ה ׀ לִבְנֵ֬י אֱד֗וֹם אֵת֮ י֤וֹם יְֽרוּשָׁ֫לָ֥‍ִם הָ֭אֹ֣מְרִים עָ֤רוּ ׀ עָ֑רוּ עַ֗֝ד הַיְס֥וֹד בָּֽהּ׃ בַּת־בָּבֶ֗ל הַשְּׁד֫וּדָ֥ה אַשְׁרֵ֥י שֶׁיְשַׁלֶּם־לָ֑ךְ אֶת־גְּ֝מוּלֵ֗ךְ שֶׁגָּמַ֥לְתְּ לָֽנוּ׃ אַשְׁרֵ֤י ׀ שֶׁיֹּאחֵ֓ז וְנִפֵּ֬ץ אֶֽת־עֹ֝לָלַ֗יִךְ אֶל־הַסָּֽלַע׃ \n\n" +
			"מִזְמ֗וֹר לְאָ֫סָ֥ף אֱֽלֹהִ֡ים בָּ֤אוּ גוֹיִ֨ם ׀ בְּֽנַחֲלָתֶ֗ךָ טִ֭מְּאוּ אֶת־הֵיכַ֣ל קׇדְשֶׁ֑ךָ שָׂ֖מוּ אֶת־יְרֽוּשָׁלַ֣‍ִם לְעִיִּים׃ נָתְנ֡וּ אֶת־נִבְלַ֬ת עֲבָדֶ֗יךָ מַ֭אֲכָל לְע֣וֹף הַשָּׁמָ֑יִם בְּשַׂ֥ר חֲ֝סִידֶ֗יךָ לְחַיְתוֹ־אָֽרֶץ׃ שָׁפְכ֬וּ דָמָ֨ם ׀ כַּמַּ֗יִם סְֽבִ֘יב֤וֹת יְֽרוּשָׁלָ֗‍ִם וְאֵ֣ין קוֹבֵֽר׃ הָיִ֣ינוּ חֶ֭רְפָּה לִשְׁכֵנֵ֑ינוּ לַ֥עַג וָ֝קֶ֗לֶס לִסְבִיבוֹתֵֽינוּ׃ עַד־מָ֣ה יְ֭הֹוָה תֶּאֱנַ֣ף לָנֶ֑צַח תִּבְעַ֥ר כְּמוֹ־אֵ֗֝שׁ קִנְאָתֶֽךָ׃ שְׁפֹ֤ךְ חֲמָתְךָ֗ אֶֽל־הַגּוֹיִם֮ אֲשֶׁ֢ר לֹא־יְדָ֫ע֥וּךָ וְעַ֥ל מַמְלָכ֑וֹת אֲשֶׁ֥ר בְּ֝שִׁמְךָ֗ לֹ֣א קָרָֽאוּ׃ כִּ֭י אָכַ֣ל אֶֽת־יַעֲקֹ֑ב וְֽאֶת־נָוֵ֥הוּ הֵשַֽׁמּוּ׃ אַֽל־תִּזְכׇּר־לָנוּ֮ עֲוֺנֹ֢ת רִאשֹׁ֫נִ֥ים מַ֭הֵר יְקַדְּמ֣וּנוּ רַחֲמֶ֑יךָ כִּ֖י דַלּ֣וֹנוּ מְאֹֽד׃ עׇזְרֵ֤נוּ ׀ אֱלֹ֘הֵ֤י יִשְׁעֵ֗נוּ עַֽל־דְּבַ֥ר כְּבֽוֹד־שְׁמֶ֑ךָ וְהַצִּילֵ֥נוּ וְכַפֵּ֥ר עַל־חַ֝טֹּאתֵ֗ינוּ לְמַ֣עַן שְׁמֶֽךָ׃ לָ֤מָּה ׀ יֹאמְר֣וּ הַגּוֹיִם֮ אַיֵּ֢ה אֱֽלֹהֵ֫יהֶ֥ם יִוָּדַ֣ע בַּגֹּיִ֣ים לְעֵינֵ֑ינוּ נִ֝קְמַ֗ת דַּֽם־עֲבָדֶ֥יךָ הַשָּׁפֽוּךְ׃ תָּ֤ב֣וֹא לְפָנֶיךָ֮ אֶנְקַ֢ת אָ֫סִ֥יר כְּגֹ֥דֶל זְרוֹעֲךָ֑ ה֝וֹתֵ֗ר בְּנֵ֣י תְמוּתָֽה׃ וְהָ֘שֵׁ֤ב לִשְׁכֵנֵ֣ינוּ שִׁ֭בְעָתַיִם אֶל־חֵיקָ֑ם חֶרְפָּ֘תָ֤ם אֲשֶׁ֖ר חֵרְפ֣וּךָ אֲדֹנָֽי׃ וַאֲנַ֤חְנוּ עַמְּךָ֨ ׀ וְצֹ֥אן מַרְעִיתֶךָ֮ נ֤וֹדֶ֥ה לְּךָ֗ לְע֫וֹלָ֥ם לְד֥וֹר וָדֹ֑ר נְ֝סַפֵּ֗ר תְּהִלָּתֶֽךָ׃ \n\n" +
			"זְכֹ֤ר יְהֹוָה֙ מֶֽה־הָ֣יָה לָ֔נוּ הַבִּ֖יטָה וּרְאֵ֥ה אֶת־חֶרְפָּתֵֽנוּ׃ נַחֲלָתֵ֙נוּ֙ נֶֽהֶפְכָ֣ה לְזָרִ֔ים בָּתֵּ֖ינוּ לְנׇכְרִֽים׃ יְתוֹמִ֤ים הָיִ֙ינוּ֙ וְאֵ֣ין אָ֔ב אִמֹּתֵ֖ינוּ כְּאַלְמָנֽוֹת׃ מֵימֵ֙ינוּ֙ בְּכֶ֣סֶף שָׁתִ֔ינוּ עֵצֵ֖ינוּ בִּמְחִ֥יר יָבֹֽאוּ׃ עַ֤ל צַוָּארֵ֙נוּ֙ נִרְדָּ֔פְנוּ יָגַ֖עְנוּ וְלֹ֥א הֽוּנַֽח־לָֽנוּ׃ מִצְרַ֙יִם֙ נָתַ֣נּוּ יָ֔ד אַשּׁ֖וּר לִשְׂבֹּ֥עַֽ לָֽחֶם׃ אֲבֹתֵ֤ינוּ חָֽטְאוּ֙ וְאֵינָ֔ם וַאֲנַ֖חְנוּ עֲוֺנֹתֵיהֶ֥ם סָבָֽלְנוּ׃ עֲבָדִים֙ מָ֣שְׁלוּ בָ֔נוּ פֹּרֵ֖ק אֵ֥ין מִיָּדָֽם׃ בְּנַפְשֵׁ֙נוּ֙ נָבִ֣יא לַחְמֵ֔נוּ מִפְּנֵ֖י חֶ֥רֶב הַמִּדְבָּֽר׃ עוֹרֵ֙נוּ֙ כְּתַנּ֣וּר נִכְמָ֔רוּ מִפְּנֵ֖י זַלְעֲפ֥וֹת רָעָֽב׃ נָשִׁים֙ בְּצִיּ֣וֹן עִנּ֔וּ בְּתֻלֹ֖ת בְּעָרֵ֥י יְהוּדָֽה׃ שָׂרִים֙ בְּיָדָ֣ם נִתְל֔וּ פְּנֵ֥י זְקֵנִ֖ים לֹ֥א נֶהְדָּֽרוּ׃ בַּחוּרִים֙ טְח֣וֹן נָשָׂ֔אוּ וּנְעָרִ֖ים בָּעֵ֥ץ כָּשָֽׁלוּ׃ זְקֵנִים֙ מִשַּׁ֣עַר שָׁבָ֔תוּ בַּחוּרִ֖ים מִנְּגִינָתָֽם׃ שָׁבַת֙ מְשׂ֣וֹשׂ לִבֵּ֔נוּ נֶהְפַּ֥ךְ לְאֵ֖בֶל מְחֹלֵֽנוּ׃ נָֽפְלָה֙ עֲטֶ֣רֶת רֹאשֵׁ֔נוּ אֽוֹי־נָ֥א לָ֖נוּ כִּ֥י חָטָֽאנוּ׃ עַל־זֶ֗ה הָיָ֤ה דָוֶה֙ לִבֵּ֔נוּ עַל־אֵ֖לֶּה חָשְׁכ֥וּ עֵינֵֽינוּ׃ עַ֤ל הַר־צִיּוֹן֙ שֶׁשָּׁמֵ֔ם שׁוּעָלִ֖ים הִלְּכוּ־בֽוֹ׃ אַתָּ֤ה יְהֹוָה֙ לְעוֹלָ֣ם תֵּשֵׁ֔ב כִּסְאֲךָ֖ לְד֥וֹר וָדֽוֹר׃ לָ֤מָּה לָנֶ֙צַח֙ תִּשְׁכָּחֵ֔נוּ תַּֽעַזְבֵ֖נוּ לְאֹ֥רֶךְ יָמִֽים׃ הֲשִׁיבֵ֨נוּ יְהֹוָ֤ה ׀ אֵלֶ֙יךָ֙ וְֽנָשׁ֔וּבָה חַדֵּ֥שׁ יָמֵ֖ינוּ כְּקֶֽדֶם׃ כִּ֚י אִם־מָאֹ֣ס מְאַסְתָּ֔נוּ קָצַ֥פְתָּ עָלֵ֖ינוּ עַד־מְאֹֽד׃ הֲשִׁיבֵ֨נוּ יְהֹוָ֤ה ׀ אֵלֶ֙יךָ֙ וְֽנָשׁ֔וּבָה חַדֵּ֥שׁ יָמֵ֖ינוּ כְּקֶֽדֶם׃ \n\n" +
			"הַבֵּ֤ט מִשָּׁמַ֙יִם֙ וּרְאֵ֔ה מִזְּבֻ֥ל קׇדְשְׁךָ֖ וְתִפְאַרְתֶּ֑ךָ אַיֵּ֤ה קִנְאָֽתְךָ֙ וּגְב֣וּרֹתֶ֔ךָ הֲמ֥וֹן מֵעֶ֛יךָ וְֽרַחֲמֶ֖יךָ אֵלַ֥י הִתְאַפָּֽקוּ׃ כִּֽי־אַתָּ֣ה אָבִ֔ינוּ כִּ֤י אַבְרָהָם֙ לֹ֣א יְדָעָ֔נוּ וְיִשְׂרָאֵ֖ל לֹ֣א יַכִּירָ֑נוּ אַתָּ֤ה יְהֹוָה֙ אָבִ֔ינוּ גֹּאֲלֵ֥נוּ מֵעוֹלָ֖ם שְׁמֶֽךָ׃ לָ֣מָּה תַתְעֵ֤נוּ יְהֹוָה֙ מִדְּרָכֶ֔יךָ תַּקְשִׁ֥יחַ לִבֵּ֖נוּ מִיִּרְאָתֶ֑ךָ שׁ֚וּב לְמַ֣עַן עֲבָדֶ֔יךָ שִׁבְטֵ֖י נַחֲלָתֶֽךָ׃ לַמִּצְעָ֕ר יָרְשׁ֖וּ עַם־קׇדְשֶׁ֑ךָ צָרֵ֕ינוּ בּוֹסְס֖וּ מִקְדָּשֶֽׁךָ׃ \n\n" +
			"וְעַתָּ֥ה יְהֹוָ֖ה אָבִ֣ינוּ אָ֑תָּה אֲנַ֤חְנוּ הַחֹ֙מֶר֙ וְאַתָּ֣ה יֹצְרֵ֔נוּ וּמַעֲשֵׂ֥ה יָדְךָ֖ כֻּלָּֽנוּ׃ אַל־תִּקְצֹ֤ף יְהֹוָה֙ עַד־מְאֹ֔ד וְאַל־לָעַ֖ד תִּזְכֹּ֣ר עָוֺ֑ן הֵ֥ן הַבֶּט־נָ֖א עַמְּךָ֥ כֻלָּֽנוּ׃ עָרֵ֥י קׇדְשְׁךָ֖ הָי֣וּ מִדְבָּ֑ר צִיּוֹן֙ מִדְבָּ֣ר הָיָ֔תָה יְרוּשָׁלַ֖‍ִם שְׁמָמָֽה׃ בֵּ֧ית קׇדְשֵׁ֣נוּ וְתִפְאַרְתֵּ֗נוּ אֲשֶׁ֤ר הִֽלְל֙וּךָ֙ אֲבֹתֵ֔ינוּ הָיָ֖ה לִשְׂרֵ֣פַת אֵ֑שׁ וְכׇל־מַחֲמַדֵּ֖ינוּ הָיָ֥ה לְחׇרְבָּֽה׃ הַעַל־אֵ֥לֶּה תִתְאַפַּ֖ק יְהֹוָ֑ה תֶּחֱשֶׁ֥ה וּתְעַנֵּ֖נוּ עַד־מְאֹֽד׃");
		if (isForDay) {
			addToSiddur("בסוף פסוקי הקינות יאמר/some add (מורה באצבע מ״ה)\n\n" +
				"אוֹי לִי עַל גָּלוּת הַשְּׁכִינָה, אוֹי לִי עַל חֻרְבַּן בֵּית הַמִּקְדָּשׁ, אוֹי לִי עַל שְׂרֵיפַת הַתּוֹרָה, אוֹי לִי עַל הַרִיגַת הַצַּדִּיקִים, אוֹי לִי עַל חִלוּל שְׁמוֹ הַגָּדוֹל וְתוֹרָתוֹ הַקְּדוֹשָׁה, אוֹי לִי עַל כִּי גָבַר אוֹיֵב, אוֹי לִי עַל צַֽעַר כָּל־הָעוֹלָמוֹת, אוֹי לִי עַל צַֽעַר הָאָבוֹת הַקְּדוֹשִׁים וְהָאִמָּהוֹת הַקְּדוֹשׁוֹת, אוֹי לִי עַל צַֽעַר הַנְּבִיאִים וְהַחֲסִידִים וְהַצַּדִּיקִים אֲשֶׁר בְּגַן עֵֽדֶן, אוֹי לִי עַל צַעֲרוֹ שֶׁל מָשִֽׁיחַ. עֲוֹנוֹתֵֽינוּ הִטּוּ אֵֽלֶּה וּפְשָׁעֵֽינוּ הֶאֱרִֽיכוּ קִצֵּֽנוּ, וְחַטֹּאתֵֽינוּ מָֽנְעֽוּ הַטּוֹב מִמֶּֽנּוּ, אוֹי לָהֶם לַבָּנִים שֶׁגָּלוּ מֵעַל שֻׁלְחַן אֲבִיהֶם זֶה כַּמָּה אֽוֹרֶךְ יָמִים וְשָׁנִים רַבִּים וְרָעִים, כָּל־דּוֹר שֶׁלֹּא נִבְנָה בֵּית הַמִּקְדָּשׁ בְּיָמָיו כְּאִלּוּ נֶחֱרַב בְּיָמָיו:");
			addToSiddur("יקום ויתנער ממקומו, ויאמר/stand up and say");
			addToSiddur(
					"הִתְנַעֲרִי מֵעָפָר קוּמִי שְּׁבִ֖י יְרֽוּשָׁלִָים. הִֽתְפַּתְּחִי֙ מוֹסְרֵ֣י צַוָּארֵ֔ךְ שְׁבִיָּ֖ה בַּת־צִיּֽוֹן:");
		}
		addToSiddur(
			"עַל־חֽוֹמֹתַ֣יִךְ יְרוּשָׁלַ֗‍ִם הִפְקַ֙דְתִּי֙ שֹֽׁמְרִ֔ים כׇּל־הַיּ֧וֹם וְכׇל־הַלַּ֛יְלָה תָּמִ֖יד לֹ֣א יֶחֱשׁ֑וּ הַמַּזְכִּרִים֙ אֶת־יְהֹוָ֔ה אַל־דֳּמִ֖י לָכֶֽם׃ וְאַֽל־תִּתְּנ֥וּ דֳמִ֖י ל֑וֹ עַד־יְכוֹנֵ֞ן וְעַד־יָשִׂ֧ים אֶת־יְרוּשָׁלַ֛‍ִם תְּהִלָּ֖ה בָּאָֽרֶץ׃ נִשְׁבַּ֧ע יְהֹוָ֛ה בִּימִינ֖וֹ וּבִזְר֣וֹעַ עֻזּ֑וֹ אִם־אֶתֵּן֩ אֶת־דְּגָנֵ֨ךְ ע֤וֹד מַֽאֲכָל֙ לְאֹ֣יְבַ֔יִךְ וְאִם־יִשְׁתּ֤וּ בְנֵֽי־נֵכָר֙ תִּֽירוֹשֵׁ֔ךְ אֲשֶׁ֥ר יָגַ֖עַתְּ בּֽוֹ׃ כִּ֤י מְאַסְפָיו֙ יֹאכְלֻ֔הוּ וְהִֽלְל֖וּ אֶת־יְהֹוָ֑ה וּמְקַבְּצָ֥יו יִשְׁתֻּ֖הוּ בְּחַצְר֥וֹת קׇדְשִֽׁי׃ \n\n" +
			"אַתָּ֣ה תָ֭קוּם תְּרַחֵ֣ם צִיּ֑וֹן כִּי־עֵ֥ת לְ֝חֶֽנְנָ֗הּ כִּי־בָ֥א מוֹעֵֽד׃ כִּי־רָצ֣וּ עֲ֭בָדֶיךָ אֶת־אֲבָנֶ֑יהָ וְֽאֶת־עֲפָרָ֥הּ יְחֹנֵֽנוּ׃ בּוֹנֵ֣ה יְרֽוּשָׁלַ֣‍ִם יְהֹוָ֑ה נִדְחֵ֖י יִשְׂרָאֵ֣ל יְכַנֵּֽס:");
	}

	private void addPatachEliyahu() {
		addInfoToSiddur("פתיחת אליהו", "\n\n" + "וִיהִ֤י ׀ נֹ֤עַם אֲדֹנָ֥י אֱלֹהֵ֗ינוּ עָ֫לֵ֥ינוּ וּמַעֲשֵׂ֣ה יָ֭דֵינוּ כּוֹנְנָ֥ה עָלֵ֑ינוּ וּֽמַעֲשֵׂ֥ה יָ֝דֵ֗ינוּ כּוֹנְנֵֽהוּ׃ \n" +
				"פָּתַח אֵלִיָּֽהוּ הַנָּבִיא זָכוּר לְטוֹב וְאָמַר: רִבּוֹן עָֽלְמִֽין דְּאַנְתְּ הוּא חָד וְלָא בְּחֻשְׁבָּן. אַנְתְּ הוּא עִלָּאָה עַל־כָּל־עִלָּאִין סְתִימָא עַל־כָּל־סְתִימִין. לֵית מַחֲשָׁבָה תְּפִיסָא בָךְ כְּלָל: אַנְתְּ הוּא דְאַפַּקְתְּ עֶֽשֶׂר תִּקּוּנִין וְקָרֵינָן לוֹן עֶֽשֶׂר סְפִירָן. לְאַנְהָגָא בְהוֹן עָֽלְמִֽין סְתִימִין דְּלָא אִתְגַּלְיָן וְעָֽלְמִֽין דְּאִתְגַּלְיָן. וּבְהוֹן אִתְכַּסִּיאַת מִבְּנֵי נָשָׁא. וְאַנְתְּ הוּא דְּקָשִׁיר לוֹן וּמְיַחֵד לוֹן: וּבְגִין דְּאַנְתְּ מִלְּגָאו. כָּל־מָאן דְּאַפְרִישׁ חַד מִן חַבְרֵיהּ מֵאִלֵּין עֶֽשֶׂר אִתְחַשִּׁיב לֵיהּ כְּאִלּוּ אַפְרִישׁ בָּֽךְ:  \n\n" +
				"וְאִלֵּין עֶֽשֶׂר סְפִירָן אִנּוּן אָֽזְלִֽין כְּסִדְרָן. חַד אָרִיךְ וְחַד קָצֵר וְחַד בֵּינוֹנִי: וְאַנְתְּ הוּא דְּאַנְהִיג לוֹן. וְלֵית מָאן דְּאַנְהִיג לָךְ. לָא לְעֵֽלָּא וְלָא לְתַֽתָּא וְלָא מִכָּל־סִטְרָא. לְבוּשִׁין תַּקַּנְתְּ לוֹן דְּמִנַּֽיְהוּ פָֽרְחִֽין נִשְׁמָתִין לִבְנֵי נָשָׁא: וְכַמָּה גוּפִין תַּקַּנְתְּ לוֹן דְּאִתְקְרִֽיאוּ גוּפָא לְגַבֵּי לְבוּשִׁין דִּמְכַסְיָן עֲלֵיהוֹן: וְאִתְקְרִֽיאוּ בְּתִקּוּנָא דָא. חֶֽסֶד דְּרוֹעָא יְמִינָא. גְּבוּרָה דְּרוֹעָא שְׂמָאלָא. תִּפְאֶֽרֶת גּוּפָא. נֶֽצַח וְהוֹד תְּרֵין שׁוֹקִין. יְסוֹד סִיּוּמָא דְגוּפָא אוֹת בְּרִית קֽוֹדֶשׁ. מַלְכוּת פֶּה תּוֹרָה שֶׁבְּעַל־פֶּה קָרֵֽינָן לָהּ. חָכְמָה מוֹחָא אִֽיהִי מַחֲשָׁבָה מִלְּגָאו. בִּינָה לִבָּא וּבָהּ הַלֵּב מֵבִין. וְעַל אִלֵּין תְּרֵין כְּתִיב הַנִּ֨סְתָּרֹ֔ת לַיהֹוָ֖ה אֱלֹהֵ֑ינוּ. כֶּֽתֶר עֶלְיוֹן אִֽיהוּ כֶּֽתֶר מַלְכוּת. וְעָלֵיהּ אִתְמַר מַגִּיד מֵרֵאשִׁית אַחֲרִית. וְאִֽיהוּ קַרְקַפְתָּא דִתְפִלֵּי: מִלְּגָאו אִֽיהוּ אוֹת יוֹ\"ד וְאוֹת הֵ\"א וְאוֹת וָא\"ו וְאוֹת הֵ\"א דְּאִֽיהוּ אֹֽרַח אֲצִילוּת. אִֽיהוּ שַׁקְיוּ דְאִילָנָא בִּדְרוֹעוֹי וְעַנְפּוֹי. כְּמַיָּא דְאַשְׁקֵי לְאִילָנָא וְאִתְרַבֵּי בְּהַהוּא שַׁקְיוּ:  \n\n" +
				"רִבּוֹן עָֽלְמִֽין אַנְתְּ הוּא עִלַּת הָעִלּוֹת וְסִבַּת הַסִּבּוֹת דְּאַשְׁקֵי לְאִילָנָא בְּהַהוּא נְבִיעוּ. וְהַהוּא נְבִיעוּ אִֽיהוּ כְּנִשְׁמְתָא לְגוּפָא דְּאִֽיהִי חַיִּים לְגוּפָא: וּבָךְ לֵית דִּמְיוֹן וְלֵית דִּיּוּקְנָא מִכָּל־מַה־דִּלְגַאו וּלְבַר. וּבָרָֽאתָ שְׁמַיָּא וְאַרְעָא. וְאַפַּקְתְּ מִנְּהוֹן שִׁמְשָׁא וְסִיהֲרָא וְכוֹכְבַיָּא וּמַזָּלֵי. וּבְאַרְעָא אִילָנִין וּדְשָׁאִין וְגִנְּתָא דְעֵֽדֶן וְעִשְׂבִּין וְחֵיוָן וְעוֹפִין וְנוּנִין וּבְעִירִין וּבְנֵי נָשָׁא. לְאִשְׁתְּמֽוֹדְעָֽא בְהוֹן עִלָּאִין וְאֵיךְ יִתְנַהֲגוּן בְּהוֹן עִלָּאִין וְתַתָּאִין. וְאֵיךְ אִשְׁתְּמֽוֹדְעָֽן מֵעִלָּאֵי וְתַתָּאֵי וְלֵית דְּיָדַע בָּךְ כְּלָל. וּבַר מִנָּךְ לֵית יִחוּדָא בְּעִלָּאֵי וְתַתָּאֵי. וְאַנְתְּ אִשְׁתְּמוֹדָע אָדוֹן עַל־כֹּֽלָּא: וְכָל־סְפִירָן כָּל־חַד אִית לֵיהּ שֵׁם יְדִֽיעַ. וּבְהוֹן אִתְקְרִֽיאוּ מַלְאָכַיָּא. וְאַנְתְּ לֵית לָךְ שֵׁם יְדִֽיעַ. דְּאַנְתְּ הוּא מְמַלֵּא כָּל־שְׁמָהָן וְאַנְתְּ הוּא שְׁלִֽימוּ דְּכֻלְּהוּ: וְכַד אַנְתְּ תִּסְתַּלָּק מִנְּהוֹן. אִשְׁתְּאָֽרוּ כֻּלְּהוּ שְׁמָהָן כְּגוּפָא בְלָא נִשְׁמָתָא: אַנְתְּ הוּא חַכִּים וְלָאו בְּחָכְמָה יְדִיעָא. אַנְתְּ הוּא מֵבִין וְלָאו מִבִּינָה יְדִיעָא. לֵית לָךְ אֲתָר יְדִיעָא. אֶלָּא לְאִשְׁתְּמֽוֹדְעָא תֻּקְפָךְ וְחֵילָךְ לִבְנֵי נָשָׁא. וּלְאַחְזָאָה לוֹן אֵיךְ אִתְנְהִיג עָֽלְמָא בְּדִינָא וּבְרַחֲמֵי דְּאִנּוּן צֶֽדֶק וּמִשְׁפָּט כְּפוּם עוֹבָדֵיהוֹן דִּבְנֵי נָשָׁא: דִּין אִֽיהוּ גְבוּרָה. מִשְׁפָּט עַמּוּדָא דְאֶמְצָעִיתָא. צֶֽדֶק מַלְכוּתָא קַדִּישָׁא. מֹֽאזְנֵֽי צֶֽדֶק תְּרֵין סַמְכֵי קְשׁוֹט. הִין צֶֽדֶק אוֹת בְּרִית. כֹּלָּא לְאַחְזָאָה אֵיךְ אִתְנְהִיג עָֽלְמָא: אֲבָל לָאו דְּאִית לָךְ צֶֽדֶק יְדִיעָא דְּאִֽיהוּ דִין. וְלָאו מִשְׁפָּט יְדִיעָא דְאִֽיהוּ רַחֲמֵי. וְלָאו מִכָּל־אִלֵּין מִדּוֹת כְּלָל: קוּם רִבִּי שִׁמְעוֹן וְיִתְחַדְּשׁוּן מִלִּין עַל יְדָךְ, דְּהָא רְשׁוּתָא אִית לָךְ לְגַלָּאָה רָזִין טְמִירִין עַל יְדָךְ, מַה דְּלָא אִתְיְהִב רְשׁוּ לְגַלָּאָה לָשׂוּם בַּר־נָשׁ עַד כְּעָן:  \n\n" +
				"קָם רַבִּי שִׁמְעוֹן פָּתַח וְאָמַר, לְךָ֣ יְ֠הֹוָ֠ה הַגְּדֻלָּ֨ה וְהַגְּבוּרָ֤ה וְהַתִּפְאֶ֙רֶת֙ וְהַנֵּ֣צַח וְהַה֔וֹד כִּי־כֹ֖ל בַּשָּׁמַ֣יִם וּבָאָ֑רֶץ לְךָ֤ יְהֹוָה֙ הַמַּמְלָכָ֔ה וְהַמִּתְנַשֵּׂ֖א לְכֹ֥ל ׀ לְרֹֽאשׁ, עִלָּאִין שִׁמְעוּ אִינוּן דְמִיכִין דְּחֶבְרוֹן, וְרַעְיָא מְהֵימְנָא אִתְּעָרוּ מִשְּׁנַתְכוֹן, הָקִיצוּ וְרַנְּנוּ שׁוֹכְנֵי עָפָר, אִלֵּין אִינוּן צַדִּיקַיָּא דְּאִינוּן מִסִּטְרָא דְּהַהִיא דְּאִתְמַר בָּהּ אֲנִ֥י יְשֵׁנָ֖ה וְלִבִּ֣י עֵ֑ר, וְלָאו אִינוּן מֵתִים, וּבְגִין דָּא אִתְמַר בְּהוֹן: הָקִיצוּ וְרַנְּנוּ שׁוֹכְנֵי עָפָר, רַעְיָא מְהֵימְנָא, אַנְתְּ וַאֲבָהָן הָקִיצוּ וְרַנְּנוּ לְאִתְּעָרוּתָא דִּשְׁכִינְתָּא, דְּאִיהִי יְשֵׁנָהּ בְּגָלוּתָא, דְּעַד כְּעַן צַדִּיקַיָּא כֻּלְּהוּ דְמִיכִין וְשִׁנְתָּא בְּחוֹרֵיהוֹן: מִיַּד יְהִיבַת שְׁכִינְתָּא תְּלָת קָלִין לְגַבֵּי רַעְיָא מְהֵימְנָא, וְיֵימָא לֵיהּ קוּם רַעְיָא מְהֵימְנָא, דְּהָא עֲלָךְ אִתְמַר ק֣וֹל ׀ דּוֹדִ֣י דוֹפֵ֗ק לְגַבָּאי בְּאַרְבַּע אַתְוָן דִּילֵיהּ, וְיֵימָא בְּהוֹן, פִּתְחִי־לִ֞י אֲחֹתִ֤י רַעְיָתִי֙ יוֹנָתִ֣י תַמָּתִ֔י, דְּהָא תַּם־עֲוֺנֵךְ֙ בַּת־צִיּ֔וֹן, לֹ֥א יוֹסִ֖יף לְהַגְלוֹתֵ֑ךְ: שֶׁרֹּאשִׁי֙ נִמְלָא־טָ֔ל, מַאי נִמְלָא טָל, אֶלָּא אָמַר קוּדְשָׁא בְּרִיךְ הוּא, אַנְתְּ חָשַׁבְתְּ דְּמִיּוֹמָא דְאִתְחָרַב בֵּי מַקְדְּשָׁא דְּעָֽאלְנָא בְּבֵיתָא דִילִי, וְעָֽאלְנָא בְיִשּׁוּבָא, לָאו הָכִי, דְּלָא עָֽאלְנָא כָּל זִמְנָא דְּאַנְתְּ בְּגָלוּתָא, הֲרֵי לְךָ סִימָנָא, שֶׁרֹּאשִׁי֙ נִמְלָא־טָ֔ל, הֵ\"א שְׁכִינְתָּא בְּגָלוּתָא, שְׁלִימוּ דִילָהּ וְחַיִּים דִילָהּ אִיהוּ טַ\"ל, וְדָא אִיהוּ אוֹת יוֹ\"ד וְאוֹת הֵ\"א וְאוֹת וָא\"ו, וְהֵ\"א אִיהִי שְׁכִינְתָּא דְּלָא מֵחֻשְׁבָּן טָ\"ל, אֶלָּא אוֹת יוֹ\"ד וְאוֹת הֵ\"א וְאוֹת וָא\"ו, דִּסְלִיקוּ אַתְוָן לְחֻשְׁבָּן טָ\"ל, דְּאִיהִי מַלְיָא לִשְׁכִינְתָּא מִנְּבִיעוּ דְכָל־מְקוֹרִין עִלָּאִין, מִיַּד קָם רַעְיָא מְהֵימְנָא, וַאֲבָהָן קַדִּישִׁין עִמֵּיהּ, עַד כָּאן רָזָא דְיִחוּדָא. בָּר֖וּךְ יְהֹוָ֥ה לְ֝עוֹלָ֗ם אָ֘מֵ֥ן ׀ וְאָמֵֽן:  \n\n" +
				"יְהֵא רַעֲוָא מִן קֳדָם עַתִּיקָא קַדִּישָׁא דְכָל־קַדִּישִׁין. טְמִירָא דְּכָל־טְמִירִין סְתִימָא דְכֹֽלָּא דְּיִתְמְשָׁךְ טַלָּא עִלָּאָה מִנֵּיהּ לְמַלְיָא רֵישֵׁיהּ דִזְעֵיר אַנְפִּין וּלְהַטִּיל לַחֲקַל תַּפּוּחִין קַדִּישִׁין בִּנְהִֽירוּ דְּאַנְפִּין בְּרַעֲוָא וּבְחֶדְוָתָא דְכֹֽלָּא. וְיִתְמְשָָׁךְ מִן קֳדָם עַתִּיקָא קַדִּישָׁא דְכָל־קַדִּישִׁין טְמִירָא דְכָל־טְמִירִין סְתִימָא דְכֹֽלָא רְעוּתָא וְרַחֲמֵי חִנָּא וְחִסְדָּא בִּנְהִֽירוּ עִלָּאָה בִּרְעוּתָא וְחֶדְוָא עָלַי וְעַל־כָּל־בְּנֵי בֵֽיתִי וְעַל־כָּל־הַנִּלְוִים אֵלַי וְעַל־כָּל־יִשְׂרָאֵל עַמֵּיהּ. וְיִפְרְקִינָן מִכָּל־עַקְתִין בִּישִׁין דְּיֵיתוּן לְעָֽלְמָא וְיַזְמִין וְיִתְיְהִיב לָֽנָא וּלְכָל־נַפְשָׁתָֽנָא חִנָּא וְחִסְדָּא וְחַיֵּי אֲרִיכֵי וּמְזוֹנֵי רְוִיחֵי וְרַחֲמֵי מִן קֳדָמֵיהּ. אָמֵן כֵּן יְהִי רָצוֹן אָמֵן וְאָמֵן:");
	}

	/**
	 * NOTE: Night prayer. The Date should be set to the next day. Chatzot is
	 * pre-calculated for the before and passed in as a bool
	 */
	public ArrayList<HighlightString> getKriatShemaShealHamitaPrayers(boolean isBeforeChatzot) {
		siddur = new ArrayList<>();

		addInfoToSiddur("לְשֵׁם יִחוּד ",
			"קֻדְשָׁא בְּרִיךְ הוּא וּשְׁכִינְתֵּהּ, בִּדְחִילוּ וּרְחִימוּ, וּרְחִימוּ וּדְחִילוּ, לְיַחֲדָא אוֹת יוֹ\"ד וְאוֹת הֵ\"א בְּאוֹת וָא\"ו וְאוֹת הֵ\"א בְּיִחוּדָא שְׁלִים בְּשֵׁם כָּל־יִשְׂרָאֵל. הֲרֵֽינִי מְקַבֵּל עָלַי אֱלָהוּתוֹ יִתְבָּרַךְ וְאַהֲבָתוֹ וְיִרְאָתוֹ. וַהֲרֵֽינִי יָרֵא מִמֶּֽנּוּ בְּגִין דְּאִֽיהוּ רַב וְשַׁלִּיט עַל כֹּֽלָּא. וְכֹֽלָּא קַמֵּיהּ כְּלָא. וַהֲרֵֽינִי מַמְלִיכוֹ עַל כָּל־אֵֽבֶר וְאֵֽבֶר וְגִיד וָגִיד מֵרַמַ\"ח אֵבָרִים וְשַׁסַ\"הּ גִּידִים שֶׁל גּוּפִי וְנַפְשִׁי רוּחִי וְנִשְׁמָתִי. מַלְכוּת גְּמוּרָה וּשְׁלֵמָה. וַהֲרֵֽינִי עֶֽבֶד לְהַשֵּׁם יִתְבָּרַךְ וְהוּא בְרַחֲמָיו יְזַכֵּֽנִי לְעָבְדּוֹ בְּלֵבָב שָׁלֵם וְנֶֽפֶשׁ חֲפֵצָה. אָמֵן כֵּן יְהִי רָצוֹן:");
		addToSiddur(
			"רִבּוֹנוֹ שֶׁל עוֹלָם הֲרֵֽינִי מוֹחֵל וְסוֹלֵֽחַ לְכָל־מִי־שֶׁהִכְעִיס וְהִקְנִיט אוֹתִי אוֹ שֶׁחָטָא כְּנֶגְדִּי. בֵּין בְּגוּפִי בֵּין בְּמָמוֹנִי בֵּין בִּכְבוֹדִי בֵּין בְּכָל־אֲשֶׁר לִי. בֵּין בְּאֽוֹנֶס בֵּין בְּרָצוֹן בֵּין בְּשׁוֹגֵג בֵּין בְּמֵזִיד בֵּין בְּדִבּוּר בֵּין בְּמַעֲשֶׂה. בֵּין בְּגִלְגּוּל זֶה בֵּין בְּגִלְגּוּל אַחֵר. לְכָל־בַּר־יִשְׂרָאֵל. וְלֹא יֵעָנֵשׁ שׁוּם אָדָם בְּסִבָּתִי. יְהִי רָצוֹן מִלְּפָנֶֽיךָ יְהֹוָה אֱלֹהַי וֵאלֹהֵי אֲבוֹתַי שֶׁלֹּא אֶחֱטָא עוֹד. וּמַה־שֶּׁחָטָֽאתִי לְפָנֶֽיךָ מְחוֹק בְּרַחֲמֶֽיךָ הָרַבִּים. אֲבָל לֹא עַל־יְדֵי יִסּוּרִין וְחוֹלָאִים רָעִים. יִ֥הְיֽוּ לְרָצ֨וֹן ׀ אִמְרֵי־פִ֡י וְהֶגְי֣וֹן לִבִּ֣י לְפָנֶ֑יךָ יְ֝הֹוָ֗ה צוּרִ֥י וְגֹאֲלִֽי׃");
		addToSiddur(
			"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם הַמַּפִּיל חֶבְלֵי שֵׁנָה עַל־עֵינָי וּתְנוּמָה עַל־עַפְעַפַּי, וּמֵאִיר לְאִישׁוֹן בַּת־עָֽיִן. יְהִי רָצוֹן מִלְּפָנֶֽיךָ יְהֹוָה אֱלֹהַי וֵאלֹהֵי אֲבוֹתַי שֶׁתַּשְׁכִּיבֵֽנִי לְשָׁלוֹם, וְתַעֲמִידֵֽנִי לְחַיִּים טוֹבִים וּלְשָׁלוֹם, וְתֵן חֶלְקִי בְּתוֹרָתֶֽךָ, וְתַרְגִּילֵֽנִי לִדְבַר מִצְוָה, וְאַל־תַּרְגִּילֵֽנִי לִדְבַר עֲבֵרָה, וְאַל־תְּבִיאֵֽנִי לִידֵי חֵטְא. וְלֹא לִידֵי נִסָּיוֹן וְלֹא לִידֵי בִזָּיוֹן, וְיִשְׁלוֹט בִּי יֵֽצֶר הַטּוֹב וְאַל־יִשְׁלוֹט בִּי יֵֽצֶר הָרָע. וְתַצִּילֵֽנִי מִיֵּֽצֶר הָרָע וּמֵחוֹלָאִים רָעִים, וְאַל־יַבְהִילֽוּנִי חֲלוֹמוֹת רָעִים וְהִרְהוּרִים רָעִים, וּתְהֵא מִטָּתִי שְׁלֵמָה לְפָנֶֽיךָ, וְהָאֵר עֵינַי פֶּן אִישַׁן הַמָּֽוֶת. בָּרוּךְ אַתָּה יְהֹוָה הַמֵּאִיר לָעוֹלָם כֻּלּוֹ בִּכְבוֹדוֹ:");
		addToSiddur("שְׁמַ֖ע יִשְׂרָאֵ֑ל יְהֹוָ֥ה אֱלֹהֵ֖ינוּ יְהֹוָ֥ה ׀ אֶחָֽד׃ \n" +
			"בלחש/quietly: בָּרוּךְ, שֵׁם כְּבוֹד מַלְכוּתוֹ, לְעוֹלָם וָעֶד: \n\n" +
			shema +
			"יְהֹוָה אֱלֹהֵיכֶם אֱמֶת. \n\n" +
			"יַעְלְז֣וּ חֲסִידִ֣ים בְּכָב֑וֹד יְ֝רַנְּנ֗וּ עַל־מִשְׁכְּבוֹתָֽם׃ רוֹמְמ֣וֹת אֵ֭ל בִּגְרוֹנָ֑ם וְחֶ֖רֶב פִּיפִיּ֣וֹת בְּיָדָֽם׃ \n\n" +
			"הִנֵּ֗ה מִטָּתוֹ֙ שֶׁלִּשְׁלֹמֹ֔ה שִׁשִּׁ֥ים גִּבֹּרִ֖ים סָבִ֣יב לָ֑הּ מִגִּבֹּרֵ֖י יִשְׂרָאֵֽל׃ כֻּלָּם֙ אֲחֻ֣זֵי חֶ֔רֶב מְלֻמְּדֵ֖י מִלְחָמָ֑ה אִ֤ישׁ חַרְבּוֹ֙ עַל־יְרֵכ֔וֹ מִפַּ֖חַד בַּלֵּילֽוֹת׃ (ג' פעמים/three times) \n\n" +
			"יְבָרֶכְךָ֥ יְהֹוָ֖ה וְיִשְׁמְרֶֽךָ׃ יָאֵ֨ר יְהֹוָ֧ה ׀ פָּנָ֛יו אֵלֶ֖יךָ וִֽיחֻנֶּֽךָּ׃ יִשָּׂ֨א יְהֹוָ֤ה ׀ פָּנָיו֙ אֵלֶ֔יךָ וְיָשֵׂ֥ם לְךָ֖ שָׁלֽוֹם׃ \n\n" +
			"יֹ֭שֵׁב בְּסֵ֣תֶר עֶלְי֑וֹן בְּצֵ֥ל שַׁ֝דַּ֗י יִתְלוֹנָֽן׃ אֹמַ֗ר לַ֭יהֹוָה מַחְסִ֣י וּמְצוּדָתִ֑י אֱ֝לֹהַ֗י אֶבְטַח־בּֽוֹ׃ כִּ֤י ה֣וּא יַ֭צִּילְךָ מִפַּ֥ח יָק֗וּשׁ מִדֶּ֥בֶר הַוּֽוֹת׃ בְּאֶבְרָת֨וֹ ׀ יָ֣סֶךְ לָ֭ךְ וְתַחַת־כְּנָפָ֣יו תֶּחְסֶ֑ה צִנָּ֖ה וְסֹחֵרָ֣ה אֲמִתּֽוֹ׃ לֹֽא־תִ֭ירָא מִפַּ֣חַד לָ֑יְלָה מֵ֝חֵ֗ץ יָע֥וּף יוֹמָֽם׃ מִ֭דֶּבֶר בָּאֹ֣פֶל יַהֲלֹ֑ךְ מִ֝קֶּ֗טֶב יָשׁ֥וּד צׇהֳרָֽיִם׃ יִפֹּ֤ל מִצִּדְּךָ֨ ׀ אֶ֗לֶף וּרְבָבָ֥ה מִימִינֶ֑ךָ אֵ֝לֶ֗יךָ לֹ֣א יִגָּֽשׁ׃ רַ֭ק בְּעֵינֶ֣יךָ תַבִּ֑יט וְשִׁלֻּמַ֖ת רְשָׁעִ֣ים תִּרְאֶֽה׃ כִּֽי־אַתָּ֣ה יְהֹוָ֣ה מַחְסִ֑י.");

		boolean isTachanunSaid;
		if (isBeforeChatzot) {// tachanun is based on chatzot layla
			jewishDateInfo.back();
			isTachanunSaid = jewishDateInfo.getIsTachanunSaid().equals("Some say Tachanun today")
					|| jewishDateInfo.getIsTachanunSaid().equals("יש אומרים תחנון")
					|| jewishDateInfo.getIsTachanunSaid().equals("There is Tachanun today")
					|| jewishDateInfo.getIsTachanunSaid().equals("אומרים תחנון")
					|| jewishDateInfo.getIsTachanunSaid().equals("יש מדלגים תחנון במנחה")
					|| jewishDateInfo.getIsTachanunSaid().equals("Some skip Tachanun by mincha");
		} else {
			isTachanunSaid = jewishDateInfo.getIsTachanunSaid().equals("Tachanun only in the morning")
					|| jewishDateInfo.getIsTachanunSaid().equals("אומרים תחנון רק בבוקר")
					|| jewishDateInfo.getIsTachanunSaid().equals("Some say Tachanun today")
					|| jewishDateInfo.getIsTachanunSaid().equals("יש אומרים תחנון")
					|| jewishDateInfo.getIsTachanunSaid().equals("There is Tachanun today")
					|| jewishDateInfo.getIsTachanunSaid().equals("אומרים תחנון")
					|| jewishDateInfo.getIsTachanunSaid().equals("יש מדלגים תחנון במנחה")
					|| jewishDateInfo.getIsTachanunSaid().equals("Some skip Tachanun by mincha");
		}

		if (jewishDateInfo.getIsTachanunSaid().equals("Some say Tachanun today")
				|| jewishDateInfo.getIsTachanunSaid().equals("יש אומרים תחנון")
				|| jewishDateInfo.getIsTachanunSaid().equals("יש מדלגים תחנון במנחה")
				|| jewishDateInfo.getIsTachanunSaid().equals("Some skip Tachanun by mincha")) {
			addToSiddur("[" + jewishDateInfo.getIsTachanunSaid() + "]");
		}

		if (isTachanunSaid) {// Do not use isTachanunSaidInTheMorning, because it really depends on Chatzot
			addToSiddurHighlighted("(טוב לעמוד פה/stand for the viduy)\n\n"
				+ "אָנָּא יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ. תָּבֹא לְפָנֶיךָ תְּפִלָּתֵנוּ. וְאַל־תִּתְעַלַּם מַלְכֵּנוּ מִתְּחִנָּתֵנוּ. שֶׁאֵין אֲנַחְנוּ עַזֵּי פָנִים וּקְשֵׁי עֹרֶף לוֹמַר לְפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ צַדִּיקִים אֲנַחְנוּ וְלֹא חָטָאנוּ. אֲבָל חָטָאנוּ. עָוִינוּ. פָּשַׁעְנוּ. אֲנַחְנוּ וַאֲבוֹתֵינוּ וְאַנְשֵׁי בֵיתֵנוּ: אָשַׁמְנוּ. בָּגַדְנוּ. גָּזַלְנוּ. דִּבַּרְנוּ דֹפִי וְלָשׁוֹן הָרָע. הֶעֱוִינוּ. וְהִרְשַׁעְנוּ. זַדְנוּ. חָמַסְנוּ. טָפַלְנוּ שֶׁקֶר וּמִרְמָה. יָעַצְנוּ עֵצוֹת רָעוֹת. כִּזַּבְנוּ. כָּעַסְנוּ. לַצְנוּ. מָרַדְנוּ. מָרִינוּ דְבָרֶיךָ. נִאַצְנוּ. נִאַפְנוּ. סָרַרְנוּ. עָוִינוּ. פָּשַׁעְנוּ. פָּגַמְנוּ. צָרַרְנוּ. צִעַרְנוּ אָב וָאֵם. קִשִּׁינוּ עֹרֶף. רָשַׁעְנוּ. שִׁחַתְנוּ. תִּעַבְנוּ. תָּעִינוּ וְתִעֲתַעְנוּ. וְסַרְנוּ מִמִּצְוֹתֶיךָ וּמִמִּשְׁפָּטֶיךָ הַטּוֹבִים וְלֹא שָׁוָה לָנוּ. וְאַתָּה צַדִּיק עַל־כָּל־הַבָּא עָלֵינוּ. כִּי אֱמֶת עָשִׂיתָ. וַאֲנַחְנוּ הִרְשָׁעְנוּ:");
		}

		if (isBeforeChatzot) {// reset
			jewishDateInfo.forward();
		}

		for (String singleAnah : anaBekoach) {
			addToSiddur(singleAnah);
		}

		int dayOfWeek = jewishDateInfo.getJewishCalendar().getDayOfWeek() - 1;
		// This method should be called when the jewish calendar is set to the DAY
		// following the night that these prayers are said.
		// Therefore, if dayOfWeek is equal to 1 the jewish calendar has been set to
		// Sunday and the night before should match that case.
		addToSiddurHighlighted(anaBekoach[dayOfWeek] + " (ג' פעמים/three times)");

		addToSiddur("בָּרוּךְ, שֵׁם כְּבוֹד מַלְכוּתוֹ, לְעוֹלָם וָעֶד: \n\n" +
			"אַתָּ֣ה תָ֭קוּם תְּרַחֵ֣ם צִיּ֑וֹן כִּי־עֵ֥ת לְ֝חֶֽנְנָ֗הּ כִּי־בָ֥א מוֹעֵֽד׃ בְּיָדְךָ֮ אַפְקִ֢יד ר֫וּחִ֥י פָּדִ֖יתָ אוֹתִ֥י יְהֹוָ֗ה אֵ֣ל אֱמֶֽת׃");
		addToSiddur("דָּוִד מֶלֶךְ יִשְׂרָאֵל חַי וְקַיָּם (יב' פעמים/twelve times) (עוד יוסף חי פקודי, ח)");

		return siddur;
	}

	public ArrayList<HighlightString> getSiyumMasechetPrayer(String[] masechtas) {
		siddur = new ArrayList<>();

		addCategoryToSiddur("הדרן");

		addToSiddur(
			"הֲדְרָן עֲלָךְ מַסֶּכֶת (יאמר שם המסכת) וְהֲדְרָךְ עֲלָן. דַּעְתָּן עֲלָךְ מַסֶּכֶת (יאמר שם המסכת) וְדַעְתָּךְ עֲלָן. לָא נִתְנְשֵׁי מִינָךְ מַסֶּכֶת (יאמר שם המסכת) וְלֹא תִתְנְשֵׁי מִינָן, לָא בְּעָלְמָא הָדֵין וְלֹא בְּעָלְמָא דְאַָתֵי: (ג' פעמים/three times) \n\n" +
			"יְהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֶאֱלֹהֵי אֲבוֹתֵינוּ שֶׁתְּהֵא תּוֹרָתְךָ אֻמָּנוּתֵנוּ בָּעוֹלָם הַזֶּה וּתְהֵא עִמָּנוּ לָעוֹלָם הַבָּא. חֲנִינָא בַּר פָּפָּא, רָמִי בַּר פָּפָּא, נַחְמָן בַּר פָּפָּא, אַחַאי בַּר פָּפָּא, אַבָּא מָרִי בַּר פָּפָּא, רַפְרָם בַּר פָּפָּא, רָכִישׁ בַּר פָּפָּא, סוּרְחָב בַּר פָּפָּא, אַדָּא בַּר פָּפָּא, דָּרוּ בַּר פָּפָּא: \n\n" +
			"הַעֲרֵב נָא יְהֹוָה אֱלֹהֵינוּ, אֶת דִּבְרֵי תּוֹרָתְךָ בְּפִינוּ וּבְפִיפִיּוֹת עַמְּךָ בֵּית יִשְׂרָאֵל, וְנִהְיֶה כּוּלָנוּ אֲנַחְנוּ וְצֶאֱצָאֵינוּ וְצֶאֱצָאֵי עַמְּךָ בֵּית יִשְׂרָאֵל, כּוּלָנוּ יוֹדְעֵי שְׁמֶךָ וְלוֹמְדֵי תּוֹרָתְךָ. מֵֽ֭אֹיְבַי תְּחַכְּמֵ֣נִי מִצְוֺתֶ֑ךָ כִּ֖י לְעוֹלָ֣ם הִיא־לִֽי׃ יְהִי־לִבִּ֣י תָמִ֣ים בְּחֻקֶּ֑יךָ לְ֝מַ֗עַן לֹ֣א אֵבֽוֹשׁ׃ לְ֭עוֹלָם לֹא־אֶשְׁכַּ֣ח פִּקּוּדֶ֑יךָ כִּ֥י בָ֗֝ם חִיִּיתָֽנִי׃ בָּר֖וּךְ אַתָּ֥ה יְהֹוָ֗ה לַמְּדֵ֥נִי חֻקֶּֽיךָ׃ אָמֵן | אָמֵן | אָמֵן סֶלָה וָעֶד: \n\n" +
			"מוֹדִים אֲנַחְנוּ לְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֶאֱלֹהֵי אַבוֹתֵינוּ שֶׁשַּׂמְתָּ חֶלְקֵנוּ מִיּוֹשְׁבֵי בֵּית הַמִּדְרָשׁ, וְלֹא שַׂמְתָּ חֶלְקֵנוּ מִיּוֹשְׁבֵי קְרָנוֹת. שֶׁאָנוּ מַשְׁכִּימִים וְהֵם מַשְׁכִּימִים. אָנוּ מַשְׁכִּימִים לְדִבְרֵי תּוֹרָה וְהֵם מַשְׁכִּימִים לִדְבָרִים בְּטֵלִים. אָנוּ עֲמֵלִים וְהֵם עֲמֵלִים. אָנוּ עֲמֵלִים וּמְקַבְּלִים שָׂכָר וְהֵם עֲמֵלִים וְאֵינָם מְקַבְּלִים שָׂכָר. אָנוּ רָצִים וְהֵם רָצִים. אָנוּ רָצִים לְחַיֵּי הָעוֹלָם הַבָּא, וְהֵם רָצִים לִבְאֵר שַׁחַת. שֶׁנֱאמַר: וְאַתָּ֤ה אֱלֹהִ֨ים ׀ תּוֹרִדֵ֬ם ׀ לִבְאֵ֬ר שַׁ֗חַת אַנְשֵׁ֤י דָמִ֣ים וּ֭מִרְמָה לֹא־יֶחֱצ֣וּ יְמֵיהֶ֑ם וַ֝אֲנִ֗י אֶבְטַח־בָּֽךְ׃ \n\n" +
			"יְהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהַי, כְּשֵׁם שֶׁעֲזַרֽתַּנִי לְסַיֵים מַסֶּכֶת (יאמר שם המסכת) כֵּן תּֽעַזְרֵנִי לְהַתְחִיל מַסֶּכְתּוֹת וּסֽפָרִים קדֹשִׁים אַחֵרִים וּלְסַיֵימָם, לִלְמֹד וּלְלַמֵּד, לִשְׁמֹר וְלַעֲשׂוֹת וּלְקַיֵּם אֶת כָּל דִּבְרֵי תַלְמוּד תּוֹרָתֶךָ בְּאַהֲבָה, וּזְכוּת כָּל הַתַּנָּאִים וַאַמוֹרָאִים וּתַלְמִידֵי חֲכָמִים יַעֲמוֹד לִי וּלְזַרְעִי שֶׁלֹא תָּמוּש הַתּוֹרָה מִפִּי וּמִפִּי זַרְעִי עַד עוֹלָם. וַתִתְקַיֵים בִּי: בְּהִתְהַלֶּכְךָ֨ ׀ תַּנְחֶ֬ה אֹתָ֗ךְ בְּֽ֭שׇׁכְבְּךָ תִּשְׁמֹ֣ר עָלֶ֑יךָ וַ֝הֲקִיצ֗וֹתָ הִ֣יא תְשִׂיחֶֽךָ׃ כִּי־בִ֭י יִרְבּ֣וּ יָמֶ֑יךָ וְיוֹסִ֥יפוּ לְּ֝ךָ֗ שְׁנ֣וֹת חַיִּֽים׃ אֹ֣רֶךְ יָ֭מִים בִּֽימִינָ֑הּ בִּ֝שְׂמֹאולָ֗הּ עֹ֣שֶׁר וְכָבֽוֹד׃ יְֽהֹוָ֗ה עֹ֭ז לְעַמּ֣וֹ יִתֵּ֑ן יְהֹוָ֓ה ׀ יְבָרֵ֖ךְ אֶת־עַמּ֣וֹ בַשָּׁלֽוֹם:");

		addCategoryToSiddur("קדיש מיוחד");

		addToSiddur(
			"יִתְגַּדַּל וְיִתְקַדַּשׁ שְׁמֵהּ רַבָּא. [אמן] דְּהוּא עָתִיד לְחַדְתָּא עָלְמָא, וּלְאַחְיָּאָה מֵתַיָּא, וּלְשַׁכְלְלָא הֵיכָלָא. וּלְמִפְרַק חַיָּיָא. וּלְמִבְנֵה קַרְתָּא דִירוּשְׁלֵם. וּלְמֱעְקַר פּוּלְחָנָא נוּכְרׇאׇה מֵאַרְעָא. וּלְאָתְבָא פֻלְחָנָא יַקִּירָא דִשְׁמַיָא לְהַדְרֵהּ וְזִיוֵיהּ וִיקָרֵיהּ. וְיַצְמַח פֻּרְקָנֵהּ, וִיקָרֵב מְשִׁיחֵהּ. [אמן] בְּחַיֵּיכוֹן וּבְיוֹמֵיכוֹן וּבְחַיֵּי דְכָל בֵּית יִשְׂרָאֵל, בַּעֲגָלָא וּבִזְמַן קָרִיב וְאִמְרוּ אָמֵן. [אמן] יְהֵא שְׁמֵהּ רַבָּא מְבָרַךְ לְעָלַם לְעָלְמֵי עָלְמַיָּא יִתְבָּרַךְ וְיִשְׁתַּבַּח וְיִתְפָּאַר וְיִתְרוֹמַם וְיִתְנַשֵּׂא וְיִתְהַדָּר וְיִתְעַלֶּה וְיִתְהַלָּל, שְׁמֵיהּ דְּקֻדְשָׁא בְּרִיךְ הוּא. [אמן] לְעֵלָּא מִן־כָּל־בִּרְכָתָא, שִׁירָתָא, תִּשְׁבְּחָתָא וְנֶחֱמָתָא, דַּאֲמִירָן בְּעָלְמָא, וְאִמְרוּ אָמֵן: [אמן] \n" +
			"עַל יִשְׂרָאֵל וְעַל רַבָּנָן. וְעַל תַּלְמִידֵיהוֹן וְעַל כָּל תַּלְמִידֵי תַלְמִידֵיהוֹן. דְּעָסְקִין בְּאוֹרַיְתָא קַדִּשְׁתָּא. דִּי בְאַתְרָא הָדֵין וְדִי בְכָל אֲתַר וַאֲתַר. יְהֵא לָנָא וּלְהוֹן וּלְכוֹן חִנָּא וְחִסְדָּא וְרַחֲמֵי. מִן קֳדָם מָארֵי שְׁמַיָּא וְאַרְעָא וְאִמְרוּ אָמֵן. [אָמֵן] \n" +
			"יְהֵא שְׁלָמָא רַבָּא מִן שְׁמַיָּא. חַיִּים וְשָׂבָע וִישׁוּעָה וְנֶחָמָה. וְשֵׁיזָבָא וּרְפוּאָה וּגְאוּלָה וּסְלִיחָה וְכַפָּרָה וְרֶוַח וְהַצָּלָה לָנוּ וּלְכָל עַמּוֹ יִשְׂרָאֵל. וְאִמְרוּ אָמֵן. [אָמֵן]\n" +
			"עוֹשֶׂה שָׁלוֹם בִּמְרוֹמָיו. הוּא בְּרַחֲמָיו יַעֲשֶׂה שָׁלוֹם עָלֵינוּ וְעַל כָּל־עַמּוֹ יִשְׂרָאֵל. וְאִמְרוּ אָמֵן. [אָמֵן]");

		StringBuilder allMasechtas = new StringBuilder();

		for (String s : masechtas) {
			allMasechtas.append(s).append(", ");
		}
		allMasechtas.deleteCharAt(allMasechtas.length() - 1);

		for (HighlightString highlightString : siddur) {
			highlightString.setString(highlightString.toString().replace("(יאמר שם המסכת)", allMasechtas.toString()));
		}

		return siddur;
	}

	public ArrayList<HighlightString> getHavdalahPrayers() {
		siddur = new ArrayList<>();

		if (jewishDateInfo.yesterday().getJewishCalendar().getDayOfWeek() == 7) {
			addInfoToSiddur("יש הנוהגים לומר לפני הבדלה/Some say before havdalah", "\n\n" +
				"אֵלִֽיָּהוּ הַנָּבִיא. אֵלִֽיָּהוּ הַנָּבִיא. אֵלִֽיָּהוּ הַנָּבִיא. בִּמְהֵרָה יָבֹא אֵלֵֽינוּ עִם מָשִֽׁיחַ בֶּן דָּוִד: \n" +
				"אִישׁ אֲשֶׁר קִנֵּא לְשֵׁם הָאֵל, אִישׁ בֻּשַּׂר שָׁלוֹם עַל יַד יְקוּתִיאֵל, אִישׁ גָּשׁ וַיְכַפֵּר עַל בְּנֵי יִשְׂרָאֵל. אֵלִֽיָּהוּ הַנָּבִיא: \n" +
				"אִישׁ דּוֹרוֹת שְׁנֵים עָשָׂר רָאוּ עֵינָיו, אִישׁ הַנִּקְרָא בַּֽעַל שֵׂעָר בְּסִימָּנָיו, אִישׁ וְאֵזוֹר עוֹר אָזוּר בְּמָתְנָיו. אֵלִֽיָּהוּ הַנָּבִיא: \n" +
				"אִישׁ זָעַף עַל עֽוֹבְדֵֽי חַמָּנִים, אִישׁ חָשׁ וְנִשְׁבַּע מִהְיוֹת גִּשְׁמֵי מְעוֹנִים, אִישׁ טַל וּמָטָר עָצַר שָׁלֹשׁ שָׁנִים. אֵלִֽיָּהוּ הַנָּבִיא: \n" +
				"אִישׁ יָצָא לִמְצֹא לְנַפְשׁוֹ נַֽחַת, אִישׁ כִּלְכְּלֽוּהוּ הָעֽוֹרְבִֽים וְלֹא מֵת לַשַּֽׁחַת, אִישׁ לְמַעֲנוֹ נִתְבָּֽרְכֽוּ כַּד וְצַפַּֽחַת. אֵלִֽיָּהוּ הַנָּבִיא: \n" +
				"אִישׁ מוּסָרָיו הִקְשִֽׁיבוּ כְמֵהִים, אִישׁ נֶעֱנָה בָאֵשׁ מִשְּׁמֵי גְבוֹהִים, אִישׁ שָׂחוּ אַחֲרָיו יְהֹוָה הוּא הָאֱלֹהִים. אֵלִֽיָּהוּ הַנָּבִיא: \n" +
				"אִישׁ עָתִיד לְהִשְׁתַּלֵּֽחַ מִשְּׁמֵי עֲרָבוֹת, אִישׁ פָּקִיד עַל כָּל בְּשׂוֹרוֹת טוֹבוֹת, אִישׁ צִיר נֶאֱמָן לְהָשִׁיב לֵב בָּנִים עַל אָבוֹת. אֵלִֽיָּהוּ הַנָּבִיא: \n" +
				"אִישׁ קָרָא קַנֹּא קִנֵּֽאתִי לַיהֹוָה בְּתִפְאָרָה, אִישׁ רָכַב עַל סוּסֵי אֵשׁ וְעָלָה בַסְּעָרָה, אִישׁ שֶׁלֹּא טָעַם טַֽעַם מִיתָה וּקְבוּרָה. אֵלִֽיָּהוּ הַנָּבִיא: \n" +
				"תִּשְׁבִּי תַּצִּילֵֽנוּ מִפִּי אֲרָיוֹת, תְּבַשְּׂרֵֽנוּ בְּשׂוֹרוֹת טוֹבוֹת בְּמוֹצָאֵי שַׁבָּתוֹת, תְּשַׂמְּחֵֽנוּ בָּנִים עַל אָבוֹת. אֵלִֽיָּהוּ הַנָּבִיא: \n" +
				"אִישׁ תִּשְׁבִּי עַל שְׁמוֹ נִקְרָא, תַּצְלִיחֵֽנוּ עַל יָדוֹ בַּתּוֹרָה, תַּשְׁמִיעֵֽנוּ מִפִּיו בְּשׂוֹרָה טוֹבָה בִּמְהֵרָה, תּוֹצִיאֵֽנוּ מֵאֲפֵלָה לְאוֹרָה. אֵלִֽיָּהוּ הַנָּבִיא: \n" +
				"אַשְׁרֵי מִי שֶׁרָאָה פָנָיו בַּחֲלוֹם, אַשְׁרֵי מִי שֶׁנָּתַן לוֹ שָׁלוֹם וְהֶחֱזִיר לוֹ שָׁלוֹם, יְהֹוָה יְבָרֵךְ אֶת עַמּוֹ בַשָּׁלוֹם. אֵלִֽיָּהוּ הַנָּבִיא: \n" +
				"כַּכָּתוּב הִנֵּ֤ה אָֽנֹכִי֙ שֹׁלֵ֣חַ לָכֶ֔ם אֵ֖ת אֵלִיָּ֣ה הַנָּבִ֑יא לִפְנֵ֗י בּ֚וֹא י֣וֹם יְהֹוָ֔ה הַגָּד֖וֹל וְהַנּוֹרָֽא׃ וְהֵשִׁ֤יב לֵב־אָבוֹת֙ עַל־בָּנִ֔ים וְלֵ֥ב בָּנִ֖ים עַל־אֲבוֹתָ֑ם:" +
				"אֱלֹהֵֽינוּ וֵאלֹהֵי אֲבוֹתֵֽינוּ, בְּסִימָן טוֹב וּבְמַזָּל טוֹב הָחֵל עָלֵֽינוּ אֶת שֵֽׁשֶׁת יְמֵי הַמַּעֲשֶׂה הַבָּאִים לִקְרָאתֵֽנוּ לְשָׁלוֹם, חֲשׂוּכִים מִכָּל־חֵטְא וָפֶֽשַׁע, וּמְנֻקִּים מִכָּל־עָוֹן וְאַשְׁמָה וָרֶֽשַׁע, וּמְדֻבָּקִים בְּתַלְמוּד תּוֹרָה וּמַעֲשִׂים טוֹבִים, וַחֲנוּנִים חָכְמָה בִּינָה וָדַֽעַת מֵאִתְּךָ, וְתַשְׁמִיעֵֽנוּ בָהֶם שָׂשׂוֹן וְשִׂמְחָה. וְלֹא תַעֲלֶה קִנְאָתֵֽנוּ עַל לֵב אָדָם, וְלֹא קִנְאַת אָדָם תַּעֲלֶה עַל לִבֵּֽנוּ. מַלְכֵּֽנוּ וֵאלֹהֵֽינוּ, שִׂים בְּרָכָה רְוָחָה וְהַצְלָחָה בְּכָל־מַעֲשֵׂה יָדֵֽינוּ. וְכָל־הַיּוֹעֵץ עָלֵֽינוּ וְעַל עַמְּךָ בֵּית יִשְׂרָאֵל עֵצָה שֶׁאֵינָהּ טוֹבָה וּמַחֲשָׁבָה שֶׁאֵינָהּ טוֹבָה, אַבְּדוֹ, בַּטְּלוֹ, גַּדְּעוֹ, הָפֵרוֹ, הָפֵר עֲצָתוֹ, כַּדָּבָר שֶׁנֶּאֱמַר יְֽהֹוָ֗ה הֵפִ֥יר עֲצַת־גּוֹיִ֑ם הֵ֝נִ֗יא מַחְשְׁב֥וֹת עַמִּֽים: וְנֶאֱמַר עֻ֥צוּ עֵצָ֖ה וְתֻפָ֑ר דַּבְּר֤וּ דָבָר֙ וְלֹ֣א יָק֔וּם כִּ֥י עִמָּ֖נוּ אֵֽל: וְכָל־הַיּוֹעֵץ עָלֵֽינוּ וְעַל עַמְּךָ בֵּית יִשְׂרָאֵל עֵצָה טוֹבָה, וּמַחֲשָׁבָה טוֹבָה, אַמְּצוֹ, בָּֽרְכֽוֹ, גַּדְּלוֹ, קַיְּמוֹ, קַיֵּם עֲצָתוֹ, כַּדָּבָר שֶׁנֶּאֱמַר יִֽתֶּן־לְךָ֥ כִלְבָבֶ֑ךָ וְֽכָל־עֲצָתְךָ֥ יְמַלֵּֽא׃ וְנֶאֱמַר וְֽתִגְזַר־א֭וֹמֶר וְיָ֣קָם לָ֑ךְ וְעַל־דְּ֝רָכֶ֗יךָ נָ֣גַֽהּ אֽוֹר: וּפְתַח לָֽנוּ יְהֹוָה אֱלֹהֵֽינוּ בָּזֶה הַשָּׁבֽוּעַ וּבְכָל־שָׁבֽוּעַ וְשָׁבֽוּעַ: \n" +
				"שַׁעֲרֵי אוֹרָה, שַׁעֲרֵי בְרָכָה, שַׁעֲרֵי גִילָה, שַׁעֲרֵי דִיצָה, שַׁעֲרֵי דֵעָה, שַׁעֲרֵי הוֹד וְהָדָר, שַׁעֲרֵי וַעַד טוֹב, שַׁעֲרֵי זִמְרָה, שַׁעֲרֵי חֶדְוָה, שַׁעֲרֵי חֶמְלָה, שַׁעֲרֵי חֵן וָחֶֽסֶד, שַׁעֲרֵי חַיִּים טוֹבִים, שַׁעֲרֵי טוֹבָה, שַׁעֲרֵי יְשׁוּעָה, שַׁעֲרֵי כַפָּרָה, שַׁעֲרֵי כַלְכָּלָה, שַׁעֲרֵי לִמּוּד תּוֹרָה לִשְׁמָהּ, שַׁעֲרֵי מָזוֹן, שַׁעֲרֵי מְחִילָה, שַׁעֲרֵי נֶחָמָה, שַׁעֲרֵי סְלִיחָה, שַׁעֲרֵי עֶזְרָה, שַׁעֲרֵי פְדוּת, שַׁעֲרֵי פַרְנָסָה טוֹבָה, שַׁעֲרֵי צְדָקָה, שַׁעֲרֵי צָהֳלָה, שַׁעֲרֵי קוֹמְמִיּוּת, שַׁעֲרֵי רְפוּאָה שְׁלֵימָה, שַׁעֲרֵי שָׁלוֹם, שַׁעֲרֵי שַׁלְוָה, שַׁעֲרֵי תוֹרָה, שַׁעֲרֵי תְפִלָּה, שַׁעֲרֵי תְשׁוּבָה, שַׁעֲרֵי תְשׁוּעָה: \n" +
				"כְּדִכְתִיב וּתְשׁוּעַ֣ת צַ֭דִּיקִים מֵיְהֹוָ֑ה מָ֝עוּזָּ֗ם בְּעֵ֣ת צָרָֽה׃ וַ֥יַּעְזְרֵ֥ם יְהֹוָ֗ה וַֽיְפַ֫לְּטֵ֥ם יְפַלְּטֵ֣ם מֵ֭רְשָׁעִים וְיוֹשִׁיעֵ֑ם כִּי־חָ֥סוּ בֽוֹ׃ וְנֶאֱמַר חָשַׂ֤ף יְהֹוָה֙ אֶת־זְר֣וֹעַ קׇדְשׁ֔וֹ לְעֵינֵ֖י כׇּל־הַגּוֹיִ֑ם וְרָאוּ֙ כׇּל־אַפְסֵי־אָ֔רֶץ אֵ֖ת יְשׁוּעַ֥ת אֱלֹהֵֽינוּ׃ וְנֶאֱמַר ק֥וֹל צֹפַ֛יִךְ נָ֥שְׂאוּ ק֖וֹל יַחְדָּ֣ו יְרַנֵּ֑נוּ כִּ֣י עַ֤יִן בְּעַ֙יִן֙ יִרְא֔וּ בְּשׁ֥וּב יְהֹוָ֖ה צִיּֽוֹן׃ וְקַיֵּם לָֽנוּ יְהֹוָה אֱלֹהֵֽינוּ מִקְרָא שֶׁכָּתוּב, מַה־נָּאו֨וּ עַל־הֶהָרִ֜ים רַגְלֵ֣י מְבַשֵּׂ֗ר מַשְׁמִ֧יעַ שָׁל֛וֹם מְבַשֵּׂ֥ר ט֖וֹב מַשְׁמִ֣יעַ יְשׁוּעָ֑ה אֹמֵ֥ר לְצִיּ֖וֹן מָלַ֥ךְ אֱלֹהָֽיִךְ׃" +
				"נמצא בכתבי הקודש של רבי לוי יצחק מברדיטשוב זצ\"ל, תפלה להצלחה לאומרה במוצ\"ש ג\"פ/Found in the holy writings of Rabbi Levi Yitzchak of Berditchev, a prayer for success to be recited on Saturday night three times: \n\n" +
				"אֱלֹהֵי אַבְרָהָם, אֱלֹהֵי יִצְחָק וֵאלֹהֵי יַעֲקֹב, שְׁמֹר וְהַצֵּל אֶת עַמְּךָ יִשְׂרָאֵל אֲהוּבֶיךָ מִכּל רָע, לְמַעַן שֵׁם תְּהִלָּתֶךָ, הִנֵּה שַׁבַּת קֹדֶשׁ הָאֲהוּבָה עוֹבֶרֶת, וִיהִי רָצוֹן מִלְּפָנֶיךָ, שֶׁיָּבֹא עָלֵינוּ הַשָּׁבוּעַ הַבָּא לֶאֱמוּנָה שְׁלֵמָה, לֶאֱמוּנַת חֲכָמִים, לְאַהֲבַת חֲבֵרִים, לִדְבֵקוּת הַבּוֹרֵא בָּרוּךְ הוּא, לְהַאֲמִין בִּשְׁלֹשָׁה עָשָׂר עִקָּרִים שֶׁלְּךָ, וּבִגְאֻלָּה קְרוֹבָה בִּמְהֵרָה בְּיָמֵינוּ, וּבִתְחִיַּת הַמֵּתִים, וּבִנְבוּאַת מֹשֶׁה רַבֵּנוּ עָלָיו הַשָּׁלוֹם: \n" +
				"רִבּוֹנוֹ שֶׁל עוֹלָם, אַתָּה הַנּוֹתֵן לַיָּעֵף כֹּחַ, תֵּן כֹּחַ גַּם לִילָדֶיךָ רְחוּמֶיךָ הַיְּהוּדִים, לְהַלֵּל שִׁמְךָ וְלַעֲבֹד אוֹתךָ לְבַדֶּךָ, וְהַשָּׁבוּעַ הַבָּא, יָבוֹא עָלֵינוּ לִבְרִיאוּת וּלְמַזָּל, וּלְהַצְלָחָה וְלִבְרָכָה וּלְחֶסֶד, וְלִבְנֵי חַיֵּי וּמְזוֹנֵי, לָנוּ וּלְכָל יִשְׂרָאֵל, וְנֹאמַר אָמֵן:");
		}

		addCategoryToSiddur("סדר הבדלה");
		// based on the yechave daat siddur
		addToSiddur(
			"רִאשׁ֥וֹן לְצִיּ֖וֹן הִנֵּ֣ה הִנָּ֑ם וְלִירוּשָׁלַ֖‍ִם מְבַשֵּׂ֥ר אֶתֵּֽן: ק֥וּמִי א֖וֹרִי כִּ֣י בָ֣א אוֹרֵ֑ךְ וּכְב֥וֹד יְהֹוָ֖ה עָלַ֥יִךְ זָרָֽח׃ כִּֽי־הִנֵּ֤ה הַחֹ֙שֶׁךְ֙ יְכַסֶּה־אֶ֔רֶץ וַעֲרָפֶ֖ל לְאֻמִּ֑ים וְעָלַ֙יִךְ֙ יִזְרַ֣ח יְהֹוָ֔ה וּכְבוֹד֖וֹ עָלַ֥יִךְ יֵרָאֶֽה׃ (אַֽל־תִּשְׂמְחִ֤י אֹיַ֙בְתִּי֙ לִ֔י כִּ֥י נָפַ֖לְתִּי קָ֑מְתִּי כִּֽי־אֵשֵׁ֣ב בַּחֹ֔שֶׁךְ יְהֹוָ֖ה א֥וֹר לִֽי׃)");
		addToSiddur("כּוֹס־יְשׁוּע֥וֹת אֶשָּׂ֑א וּבְשֵׁ֖ם יְהֹוָ֣ה אֶקְרָֽא׃ \n\n" +
			"אָנָּ֣א יְ֭הֹוָה הוֹשִׁ֘יעָ֥ה נָּ֑א, אָנָּ֣א יְ֭הֹוָה הוֹשִׁ֘יעָ֥ה נָּ֑א: \n" +
			"אָנָּ֥א יְ֝הֹוָ֗ה הַצְלִ֘יחָ֥ה נָּֽא. אָֽנָּ֥א יְ֝הֹוָ֗ה הַצְלִ֘יחָ֥ה נָֽא׃");
		addToSiddur(
			"הַצְלִיחֵֽנוּ, הַצְלִֽיחַ דְּרָכֵֽינוּ, הַצְלִֽיחַ לִמּוּדֵֽינוּ, וּשְׁלַח בְּרָכָה רְוָחָה וְהַצְלָחָה בְּכָל־מַעֲשֵׂה יָדֵֽינוּ, כְּדִכְתִיב יִשָּׂ֣א בְ֭רָכָה מֵאֵ֣ת יְהֹוָ֑ה וּ֝צְדָקָ֗ה מֵאֱלֹהֵ֥י יִשְׁעֽוֹ: לַיְּהוּדִ֕ים הָֽיְתָ֥ה אוֹרָ֖ה וְשִׂמְחָ֑ה וְשָׂשֹׂ֖ן וִיקָֽר׃ וּכְתִיב וַיְהִ֥י דָוִ֛ד לְכׇל־דְּרָכָ֖ו מַשְׂכִּ֑יל וַיהֹוָ֖ה עִמּֽוֹ׃ כֵּן יִהְיֶה עִמָּֽנוּ תָּמִיד: וְנֹ֕חַ מָ֥צָא חֵ֖ן בְּעֵינֵ֥י יְהֹוָֽה׃ כֵּן נִמְצָא חֵן וְתִמְצְאוּ חֵן וְשֵׂכֶל טוֹב בְּעֵינֵי אֱלֹהִים וְאָדָם: בֵּאלֹהִ֥ים נַֽעֲשֶׂה־חָ֑יִל וְ֝ה֗וּא יָב֥וּס צָרֵֽינוּ׃\nאֱלָהָא דְמֵאִיר עֲנֵנוּ\nאֱלָהָא דְמֵאִיר עֲנֵנוּ\nאֱלָהָא דְמֵאִיר עֲנֵנוּ\nוְאַתֶּם֙ הַדְּבֵקִ֔ים בַּיהֹוָ֖ה אֱלֹהֵיכֶ֑ם חַיִּ֥ים כֻּלְּכֶ֖ם הַיּֽוֹם׃ הוֹד֣וּ לַיהֹוָ֣ה כִּי־ט֑וֹב כִּ֖י לְעוֹלָ֣ם חַסְדּֽוֹ׃");
		addToSiddur("סַבְרִי מָרָנָן. ועונים: לְחַיִּים. \n" +
			"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, בּוֹרֵא פְּרִי הַגֶּֽפֶן:");

		if (jewishDateInfo.yesterday().getJewishCalendar().getDayOfWeek() == 7
				&& !jewishDateInfo.yesterday().getJewishCalendar().isYomKippur()) {
			addToSiddur("בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, בּוֹרֵא עֲצֵי (עִשְׂבֵּי) (מִינֵי) בְשָׂמִים:");
		}

		if (jewishDateInfo.yesterday().getJewishCalendar().getDayOfWeek() == 7
				|| jewishDateInfo.yesterday().getJewishCalendar().isYomKippur()) {
			if (jewishDateInfo.yesterday().getJewishCalendar().isYomKippur()) {
				addToSiddurHighlighted("מברכים על נר שהיה דולק מערב יום כיפור/Only say the beracha on a fire that was lit from before Yom Kippur started");
			}
			addToSiddur("בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶֽלֶךְ הָעוֹלָם, בּוֹרֵא מְאוֹרֵי הָאֵשׁ:");
		}

		addToSiddur(
			"בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵֽינוּ מֶלֶֽךְ הָעוֹלָם, הַמַּבְדִּיל בֵּין קֹֽדֶשׁ לְחוֹל, וּבֵין אוֹר לְחֹֽשֶׁךְ, וּבֵין יִשְׂרָאֵל לָעַמִּים, וּבֵין יוֹם הַשְּׁבִיעִי לְשֵֽׁשֶׁת יְמֵי הַמַּעֲשֶׂה. בָּרוּךְ אַתָּה יְהֹוָה, הַמַּבְדִּיל בֵּין קֹֽדֶשׁ לְחוֹל:");
		addToSiddur("שותה רביעית ומברך על הגפן/Drink a revi'it and then say 'Al HaGefen'");

		ArrayList<HighlightString> havdalaSiddur = (ArrayList<HighlightString>) siddur.clone();
		ArrayList<HighlightString> meeyinShaloshSiddur = getBirchatMeeyinShaloshPrayers(new String[]{"Wine"});

		siddur = new ArrayList<>(havdalaSiddur);
		siddur.addAll(meeyinShaloshSiddur);

		return siddur;
	}

	public ArrayList<HighlightString> getHadlakatNeirotChanukaPrayers() {
		siddur = new ArrayList<>();

		addToSiddur("בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ לְהַדְלִיק נֵר חֲנֻכָּה.");
		addToSiddur("בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, שֶׁעָשָׂה נִסִּים לַאֲבוֹתֵינוּ בַּיָּמִים הָהֵם בַּזְּמַן הַזֶּה:");
		addToSiddur("אם זו הפעם הראשונה שאתה מדליק/If this is the first time you are lighting");
		addToSiddur("בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, שֶׁהֶחֱיָינוּ וְקִיְּמָנוּ וְהִגִּיעָנוּ לַזְּמַן הַזֶּה:");
		addToSiddur(
			"מייד הדלק את החנוכיה משמאל לימין, ולאחר שהנר הראשון נדלק אמור:/Immediately light the menorah from left to right, and after the first candle is lit say:");
		addToSiddur(
			"הַנֵּרוֹת הַלָּלוּ אֲנַחְנוּ מַדְלִיקִין, עַל הַנִּסִּים וְעַל הַתְּשׁוּעוֹת וְעַל הַנִּפְלָאוֹת, שֶׁעָשִׂיתָ לַאֲבוֹתֵינוּ, עַל יְדֵי כֹּהֲנֶיךָ הַקְּדוֹשִׁים. וְכָל שְׁמוֹנַת יְמֵי חֲנֻכָּה הַנֵּרוֹת הַלָּלוּ קֹדֶשׁ, וְאֵין לָנוּ רְשׁוּת לְהִשְׁתַּמֵּשׁ בָּהֶם, אֶלָּא לִרְאוֹתָם בִּלְבָד, כְּדֵי לְהוֹדוֹת לְשִׁמְךָ עַל נִסֶּיךָ וְנִפְלְאוֹתֶיךָ וְיְשׁוּעָתֶךָ.");
		addInfoToSiddur(
			"הנזהרים לומר את הנוסח בעל 36 מילים יכולים לעשות זאת. אך מרן זצ\"ל לא היה מקפיד לומר נוסח זה. הוא היה אומר את הנוסח הבא:/Those who are careful to say the 36-word version may do so. However, Maran zt\"l was not particular about saying this version. He would say the following version:",
			"\n\n" +
			"הַנֵּרוֹת הַלָּלוּ אֲנַחְנוּ מַדְלִיקִין, עַל הַנִּסִּים וְעַל הַפֻּרְקָן וְעַל הַגְּבוּרוֹת וְעַל הַתְּשׁוּעוֹת וְעַל הַנִּפְלָאוֹת וְעַל הַנֶּחָמוֹת, שֶׁעָשִׂיתָ לַאֲבוֹתֵינוּ בַּיָּמִים הָהֵם בַּזְּמַן הַזֶּה, עַל יְדֵי כֹּהֲנֶיךָ הַקְּדוֹשִׁים. וְכָל שְׁמוֹנַת יְמֵי חֲנֻכָּה הַנֵּרוֹת הַלָּלוּ קֹדֶשׁ הֵם, וְאֵין לָנוּ רְשׁוּת לְהִשְׁתַּמֵּשׁ בָּהֶם, אֶלָּא לִרְאוֹתָם בִּלְבָד, כְּדֵי לְהוֹדוֹת לְשִׁמְךָ עַל נִסֶּיךָ וְעַל נִפְלְאוֹתֶיךָ וְעַל יְשׁוּעָתֶךָ.");
		addToSiddur(
			"מִזְמ֡וֹר שִׁיר־חֲנֻכַּ֖ת הַבַּ֣יִת לְדָוִֽד׃ אֲרוֹמִמְךָ֣ יְ֭הֹוָה כִּ֣י דִלִּיתָ֑נִי וְלֹֽא־שִׂמַּ֖חְתָּ אֹיְבַ֣י לִֽי׃ יְהֹוָ֥ה אֱלֹהָ֑י שִׁוַּ֥עְתִּי אֵ֝לֶ֗יךָ וַתִּרְפָּאֵֽנִי׃ יְֽהֹוָ֗ה הֶעֱלִ֣יתָ מִן־שְׁא֣וֹל נַפְשִׁ֑י חִ֝יִּיתַ֗נִי מִיׇּֽרְדִי־בֽוֹר׃ זַמְּר֣וּ לַיהֹוָ֣ה חֲסִידָ֑יו וְ֝הוֹד֗וּ לְזֵ֣כֶר קׇדְשֽׁוֹ׃ כִּ֤י רֶ֨גַע ׀ בְּאַפּוֹ֮ חַיִּ֢ים בִּרְצ֫וֹנ֥וֹ בָּ֭עֶרֶב יָלִ֥ין בֶּ֗כִי וְלַבֹּ֥קֶר רִנָּֽה׃ וַ֭אֲנִי אָמַ֣רְתִּי בְשַׁלְוִ֑י בַּל־אֶמּ֥וֹט לְעוֹלָֽם׃ יְֽהֹוָ֗ה בִּרְצוֹנְךָ֮ הֶעֱמַ֢דְתָּה לְֽהַרְרִ֫י עֹ֥ז הִסְתַּ֥רְתָּ פָנֶ֗יךָ הָיִ֥יתִי נִבְהָֽל׃ אֵלֶ֣יךָ יְהֹוָ֣ה אֶקְרָ֑א וְאֶל־אֲ֝דֹנָ֗י אֶתְחַנָּֽן׃ מַה־בֶּ֥צַע בְּדָמִי֮ בְּרִדְתִּ֢י אֶ֫ל שָׁ֥חַת הֲיוֹדְךָ֥ עָפָ֑ר הֲיַגִּ֥יד אֲמִתֶּֽךָ׃ שְׁמַע־יְהֹוָ֥ה וְחׇנֵּ֑נִי יְ֝הֹוָ֗ה הֱֽיֵה־עֹזֵ֥ר לִֽי׃ הָפַ֣כְתָּ מִסְפְּדִי֮ לְמָח֢וֹל לִ֥י פִּתַּ֥חְתָּ שַׂקִּ֑י וַֽתְּאַזְּרֵ֥נִי שִׂמְחָֽה׃ לְמַ֤עַן ׀ יְזַמֶּרְךָ֣ כָ֭בוֹד וְלֹ֣א יִדֹּ֑ם יְהֹוָ֥ה אֱ֝לֹהַ֗י לְעוֹלָ֥ם אוֹדֶֽךָּ׃");
		addToSiddur(
			"סגולה לשמירה לומר כל לילה אחר הדלקת נרות חנוכה ויהי נועם ומזמור יושב בסתר ז' פעמים/Every night after the menorah is lit, there is a segulah for protection to say 'Vihi Noam' and 'Yoshev BeSeter' seven times \n\n" +
			"וִיהִ֤י ׀ נֹ֤עַם אֲדֹנָ֥י אֱלֹהֵ֗ינוּ עָ֫לֵ֥ינוּ וּמַעֲשֵׂ֣ה יָ֭דֵינוּ כּוֹנְנָ֥ה עָלֵ֑ינוּ וּֽמַעֲשֵׂ֥ה יָ֝דֵ֗ינוּ כּוֹנְנֵֽהוּ׃ \n" +
			"יֹ֭שֵׁב בְּסֵ֣תֶר עֶלְי֑וֹן בְּצֵ֥ל שַׁ֝דַּ֗י יִתְלוֹנָֽן׃ אֹמַ֗ר לַ֭יהֹוָה מַחְסִ֣י וּמְצוּדָתִ֑י אֱ֝לֹהַ֗י אֶבְטַח־בּֽוֹ׃ כִּ֤י ה֣וּא יַ֭צִּילְךָ מִפַּ֥ח יָק֗וּשׁ מִדֶּ֥בֶר הַוּֽוֹת׃ בְּאֶבְרָת֨וֹ ׀ יָ֣סֶךְ לָ֭ךְ וְתַחַת־כְּנָפָ֣יו תֶּחְסֶ֑ה צִנָּ֖ה וְסֹחֵרָ֣ה אֲמִתּֽוֹ׃ לֹֽא־תִ֭ירָא מִפַּ֣חַד לָ֑יְלָה מֵ֝חֵ֗ץ יָע֥וּף יוֹמָֽם׃ מִ֭דֶּבֶר בָּאֹ֣פֶל יַהֲלֹ֑ךְ מִ֝קֶּ֗טֶב יָשׁ֥וּד צׇהֳרָֽיִם׃ יִפֹּ֤ל מִצִּדְּךָ֨ ׀ אֶ֗לֶף וּרְבָבָ֥ה מִימִינֶ֑ךָ אֵ֝לֶ֗יךָ לֹ֣א יִגָּֽשׁ׃ רַ֭ק בְּעֵינֶ֣יךָ תַבִּ֑יט וְשִׁלֻּמַ֖ת רְשָׁעִ֣ים תִּרְאֶֽה׃ כִּֽי־אַתָּ֣ה יְהֹוָ֣ה מַחְסִ֑י עֶ֝לְי֗וֹן שַׂ֣מְתָּ מְעוֹנֶֽךָ׃ לֹא־תְאֻנֶּ֣ה אֵלֶ֣יךָ רָעָ֑ה וְ֝נֶ֗גַע לֹא־יִקְרַ֥ב בְּאׇהֳלֶֽךָ׃ כִּ֣י מַ֭לְאָכָיו יְצַוֶּה־לָּ֑ךְ לִ֝שְׁמׇרְךָ֗ בְּכׇל־דְּרָכֶֽיךָ׃ עַל־כַּפַּ֥יִם יִשָּׂא֑וּנְךָ פֶּן־תִּגֹּ֖ף בָּאֶ֣בֶן רַגְלֶֽךָ׃ עַל־שַׁ֣חַל וָפֶ֣תֶן תִּדְרֹ֑ךְ תִּרְמֹ֖ס כְּפִ֣יר וְתַנִּֽין׃ כִּ֤י בִ֣י חָ֭שַׁק וַאֲפַלְּטֵ֑הוּ אֲ֝שַׂגְּבֵ֗הוּ כִּֽי־יָדַ֥ע שְׁמִֽי׃ יִקְרָאֵ֨נִי ׀ וְֽאֶעֱנֵ֗הוּ עִמּֽוֹ־אָנֹכִ֥י בְצָרָ֑ה אֲ֝חַלְּצֵ֗הוּ וַאֲכַבְּדֵֽהוּ׃ אֹ֣רֶךְ יָ֭מִים אַשְׂבִּיעֵ֑הוּ וְ֝אַרְאֵ֗הוּ בִּישׁוּעָתִֽי׃");
		addToSiddur("מעוז צור \n" +
			"סימן: מרדכי חזק \n\n" +
			"מָעוֹז צוּר יְשׁוּעָתִי לְךָ נָאֶה לְשַׁבֵּחַ. תִּכּוֹן בֵּית תְּפִלָּתִי וְשָׁם תּוֹדָה נְזַבֵּחַ. לְעֵת תָּכִין מַטְבֵּחַ מִצָּר הַמְנַבֵּחַ. אָז אֶגְמוֹר בְּשִׁיר מִזְמוֹר חֲנֻכַּת הַמִּזְבֵּחַ: \n" +
			"רָעוֹת שָׂבְעָה נַפְשִׁי בְּיָגוֹן כֹּחִי כִלָה חַיַּי מֵרְרוּ בְקֹשִׁי בְּשִׁעְבּוּד מַלְכוּת עֶגְלָה וּבְיָדוֹ הַגְּדוֹלָה הוֹצִיא אֶת הַסְּגֻלָּה חֵיל פַּרְעֹה וְכָל זַרְעוֹ יָרְדוּ כְּאֶבֶן בִּמְצוּלָה: \n" +
			"דְּבִיר קָדְשׁוֹ הֱבִיאַנִי וְגַם שָׁם לֹא שָׁקַטְתִּי וּבָא נוֹגֵשׂ וְהִגְלַנִי כִּי זָרִים עָבַדְתִּי וְיֵין רַעַל מָסַכְתִּי כִּמְעַט שֶׁעָבַרְתִּי קֵץ בָּבֶל זְרֻבָּבֶל לְקֵץ שִׁבְעִים נוֹשַׁעְתִּי: \n" +
			"כְּרוֹת קוֹמַת בְּרוֹשׁ בִּקֵּשׁ אֲגָגִי בֶּן הַמְּדָתָא וְנִהְיָתָה לוֹ לְפַח וּלְמוֹקֵשׁ וְגַאֲוָתוֹ נִשְׁבָּתָה רֹאשׁ יְמִינִי נִשֵּׂאתָ וְאוֹיֵב שְׁמוֹ מָחִיתָ רֹב בָּנָיו וְקִנְיָנָיו עַל הָעֵץ תָּלִיתָ: \n" +
			"יְוָנִים נִקְבְּצוּ עָלַי אֲזַי בִּימֵי חַשְׁמַנִּים וּפָרְצוּ חוֹמוֹת מִגְדָּלַי וְטִמְּאוּ כָּל־הַשְּׁמָנִים וּמִנּוֹתַר קַנְקַנִּים נַעֲשָׂה נֵס לַשּׁוֹשַׁנִּים בְּנֵי בִינָה יְמֵי שְׁמוֹנָה קָבְעוּ שִׁיר וּרְנָנִים: \n" +
			"חֲשׂוֹף זְרוֹעַ קָדְשֶׁךָ וְקָרֵב קֵץ הַיְשׁוּעָה נְקֹם נִקְמַת עֲבָדֶיךָ מֵאֻמָּה הָרְשָׁעָה כִּי אָרְכָה לָנוּ הַשָּׁעָה וְאֵין קֵץ לִימֵי הָרָעָה דְּחֵה אַדְמוֹן בְּצֵל צַלְמוֹן הָקֵם לָנוּ רוֹעֶה שִׁבְעָה:");

		return siddur;
	}

	private void addToSiddur(String s) {
		siddur.add(new HighlightString(s));
	}

	private void addToSiddurHighlighted(String s) {
		siddur.add(new HighlightString(s).setShouldBeHighlighted(true));
	}

	private void addCategoryToSiddur(String s) {
		siddur.add(new HighlightString(s).setShouldBeHighlighted(false).setCategory(true));
	}

	private void addInfoToSiddur(String summary, String s) {
		siddur.add(new HighlightString(s).setSummary(summary).setInfo(true));
	}
}
